#![allow(clippy::all)]
#![allow(unknown_lints)]
#![allow(deref_nullptr)]
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
include!("fix.rs");

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < self.storage.as_ref().len());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= self.storage.as_ref().len());
        let mut val = 0;
        for i in 0..(bit_width as usize) {
            if self.get_bit(i + bit_offset) {
                let index = if cfg!(target_endian = "big") {
                    bit_width as usize - 1 - i
                } else {
                    i
                };
                val |= 1 << index;
            }
        }
        val
    }
    #[inline]
    pub fn set(&mut self, bit_offset: usize, bit_width: u8, val: u64) {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < self.storage.as_ref().len());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= self.storage.as_ref().len());
        for i in 0..(bit_width as usize) {
            let mask = 1 << i;
            let val_bit_is_set = val & mask == mask;
            let index = if cfg!(target_endian = "big") {
                bit_width as usize - 1 - i
            } else {
                i
            };
            self.set_bit(index + bit_offset, val_bit_is_set);
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct std_input_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_input_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_input_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_input_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_input_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_input_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct std_forward_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_forward_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(std_forward_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<std_forward_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(std_forward_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct std_iterator {
    pub _address: u8,
}
pub type std_iterator_iterator_category<_Category> = _Category;
pub type std_iterator_value_type<_Tp> = _Tp;
pub type std_iterator_difference_type<_Distance> = _Distance;
pub type std_iterator_pointer<_Pointer> = _Pointer;
pub type std_iterator_reference<_Reference> = _Reference;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_math_details_TVecAddOperators {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_math_details_TVecProductOperators {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_math_details_TVecUnaryOperators {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_math_details_TVecComparisonOperators {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_math_details_TVecFunctions {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_math_details_TQuatProductOperators {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_math_details_TQuatFunctions {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_math_details_TMatProductOperators {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_math_details_TMatSquareFunctions {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_math_details_TMatHelpers {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_math_details_TMatTransform {
    pub _address: u8,
}
#[doc = " An axis aligned 3D box represented by its center and half-extent."]
#[repr(C)]
pub struct filament_Box {
    #[doc = " Center of the 3D box"]
    pub center: filament_math_float3,
    #[doc = " Half extent from the center on all 3 axis"]
    pub halfExtent: filament_math_float3,
}
#[test]
fn bindgen_test_layout_filament_Box() {
    assert_eq!(
        ::std::mem::size_of::<filament_Box>(),
        24usize,
        concat!("Size of: ", stringify!(filament_Box))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_Box>(),
        4usize,
        concat!("Alignment of ", stringify!(filament_Box))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<filament_Box>())).center as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_Box),
            "::",
            stringify!(center)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<filament_Box>())).halfExtent as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_Box),
            "::",
            stringify!(halfExtent)
        )
    );
}
impl Default for filament_Box {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " \\privatesection"]
#[doc = " FilamentAPI is used to define an API in filament."]
#[doc = " It ensures the class defining the API can't be created, destroyed"]
#[doc = " or copied by the caller."]
#[repr(C)]
#[derive(Debug, Default)]
pub struct filament_FilamentAPI {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_filament_FilamentAPI() {
    assert_eq!(
        ::std::mem::size_of::<filament_FilamentAPI>(),
        1usize,
        concat!("Size of: ", stringify!(filament_FilamentAPI))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_FilamentAPI>(),
        1usize,
        concat!("Alignment of ", stringify!(filament_FilamentAPI))
    );
}
#[doc = " \\privatesection"]
#[doc = " BuilderBase is used to hide the implementation details of builders and ensure a higher"]
#[doc = " level of backward binary compatibility."]
#[doc = " The actual implementation is in src/FilamentAPI-impl.h\""]
#[repr(C)]
#[derive(Debug)]
pub struct filament_BuilderBase<T> {
    pub mImpl: *mut T,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
}
impl<T> Default for filament_BuilderBase<T> {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " A PresentCallable is a callable object that, when called, schedules a frame for presentation on"]
#[doc = " a SwapChain."]
#[doc = ""]
#[doc = " Typically, Filament's backend is responsible scheduling a frame's presentation. However, there"]
#[doc = " are certain cases where the application might want to control when a frame is scheduled for"]
#[doc = " presentation."]
#[doc = ""]
#[doc = " For example, on iOS, UIKit elements can be synchronized to 3D content by scheduling a present"]
#[doc = " within a CATransation:"]
#[doc = ""]
#[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
#[doc = " void myFrameScheduledCallback(PresentCallable presentCallable, void* user) {"]
#[doc = "     [CATransaction begin];"]
#[doc = "     // Update other UI elements..."]
#[doc = "     presentCallable();"]
#[doc = "     [CATransaction commit];"]
#[doc = " }"]
#[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
#[doc = ""]
#[doc = " To obtain a PresentCallable, set a SwapChain::FrameScheduledCallback on a SwapChain with the"]
#[doc = " SwapChain::setFrameScheduledCallback method. The callback is called with a PresentCallable object"]
#[doc = " and optional user data:"]
#[doc = ""]
#[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
#[doc = " swapChain->setFrameScheduledCallback(myFrameScheduledCallback, nullptr);"]
#[doc = " if (renderer->beginFrame(swapChain)) {"]
#[doc = "     renderer->render(view);"]
#[doc = "     renderer->endFrame();"]
#[doc = " }"]
#[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
#[doc = ""]
#[doc = " @remark Only Filament's Metal backend supports PresentCallables and frame callbacks. Other"]
#[doc = " backends ignore the callback (which will never be called) and proceed normally."]
#[doc = ""]
#[doc = " @remark The SwapChain::FrameScheduledCallback is called on an arbitrary thread."]
#[doc = ""]
#[doc = " Applications *must* call each PresentCallable they receive. Each PresentCallable represents a"]
#[doc = " frame that is waiting to be presented. If an application fails to call a PresentCallable, a"]
#[doc = " memory leak could occur. To \"cancel\" the presentation of a frame, pass false to the"]
#[doc = " PresentCallable, which will cancel the presentation of the frame and release associated memory."]
#[doc = ""]
#[doc = " @see Renderer, SwapChain::setFrameScheduledCallback"]
#[repr(C)]
#[derive(Debug)]
pub struct filament_backend_PresentCallable {
    pub mPresentFn: filament_backend_PresentCallable_PresentFn,
    pub mUser: *mut ::std::os::raw::c_void,
}
pub type filament_backend_PresentCallable_PresentFn = ::std::option::Option<
    unsafe extern "C" fn(presentFrame: bool, user: *mut ::std::os::raw::c_void),
>;
#[test]
fn bindgen_test_layout_filament_backend_PresentCallable() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_PresentCallable>(),
        16usize,
        concat!("Size of: ", stringify!(filament_backend_PresentCallable))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_PresentCallable>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_PresentCallable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_PresentCallable>())).mPresentFn as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_PresentCallable),
            "::",
            stringify!(mPresentFn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_PresentCallable>())).mUser as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_PresentCallable),
            "::",
            stringify!(mUser)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament7backend15PresentCallableC1EPFvbPvES2_"]
    pub fn filament_backend_PresentCallable_PresentCallable(
        this: *mut filament_backend_PresentCallable,
        fn_: filament_backend_PresentCallable_PresentFn,
        user: *mut ::std::os::raw::c_void,
    );
}
impl Default for filament_backend_PresentCallable {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl filament_backend_PresentCallable {
    #[inline]
    pub unsafe fn new(
        fn_: filament_backend_PresentCallable_PresentFn,
        user: *mut ::std::os::raw::c_void,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_backend_PresentCallable_PresentCallable(__bindgen_tmp.as_mut_ptr(), fn_, user);
        __bindgen_tmp.assume_init()
    }
}
#[doc = "!< Automatically selects an appropriate driver for the platform."]
pub const filament_backend_Backend_DEFAULT: filament_backend_Backend = 0;
#[doc = "!< Selects the OpenGL/ES driver (default on Android)"]
pub const filament_backend_Backend_OPENGL: filament_backend_Backend = 1;
#[doc = "!< Selects the Vulkan driver if the platform supports it (default on Linux/Windows)"]
pub const filament_backend_Backend_VULKAN: filament_backend_Backend = 2;
#[doc = "!< Selects the Metal driver if the platform supports it (default on MacOS/iOS)."]
pub const filament_backend_Backend_METAL: filament_backend_Backend = 3;
#[doc = "!< Selects the no-op driver for testing purposes."]
pub const filament_backend_Backend_NOOP: filament_backend_Backend = 4;
#[doc = " Selects which driver a particular Engine should use."]
pub type filament_backend_Backend = u8;
#[doc = " Defines a viewport, which is the origin and extent of the clip-space."]
#[doc = " All drawing is clipped to the viewport."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_backend_Viewport {
    #[doc = "!< left coordinate in window space."]
    pub left: i32,
    #[doc = "!< bottom coordinate in window space."]
    pub bottom: i32,
    #[doc = "!< width in pixels"]
    pub width: u32,
    #[doc = "!< height in pixels"]
    pub height: u32,
}
#[test]
fn bindgen_test_layout_filament_backend_Viewport() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_Viewport>(),
        16usize,
        concat!("Size of: ", stringify!(filament_backend_Viewport))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_Viewport>(),
        4usize,
        concat!("Alignment of ", stringify!(filament_backend_Viewport))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<filament_backend_Viewport>())).left as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_Viewport),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_Viewport>())).bottom as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_Viewport),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<filament_backend_Viewport>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_Viewport),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_Viewport>())).height as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_Viewport),
            "::",
            stringify!(height)
        )
    );
}
#[doc = "!< An error occured. The Fence condition is not satisfied."]
pub const filament_backend_FenceStatus_ERROR: filament_backend_FenceStatus = -1;
#[doc = "!< The Fence condition is satisfied."]
pub const filament_backend_FenceStatus_CONDITION_SATISFIED: filament_backend_FenceStatus = 0;
#[doc = "!< wait()'s timeout expired. The Fence condition is not satisfied."]
pub const filament_backend_FenceStatus_TIMEOUT_EXPIRED: filament_backend_FenceStatus = 1;
#[doc = " Error codes for Fence::wait()"]
#[doc = " @see Fence, Fence::wait()"]
pub type filament_backend_FenceStatus = i8;
#[doc = "! For testing"]
pub const filament_backend_ShaderModel_UNKNOWN: filament_backend_ShaderModel = 0;
#[doc = "!< Mobile level functionality"]
pub const filament_backend_ShaderModel_GL_ES_30: filament_backend_ShaderModel = 1;
#[doc = "!< Desktop level functionality"]
pub const filament_backend_ShaderModel_GL_CORE_41: filament_backend_ShaderModel = 2;
#[doc = " Shader model."]
#[doc = ""]
#[doc = " These enumerants are used across all backends and refer to a level of functionality, rather"]
#[doc = " than to an OpenGL specific shader model."]
pub type filament_backend_ShaderModel = u8;
#[doc = "!< points"]
pub const filament_backend_PrimitiveType_POINTS: filament_backend_PrimitiveType = 0;
#[doc = "!< lines"]
pub const filament_backend_PrimitiveType_LINES: filament_backend_PrimitiveType = 1;
#[doc = "!< line strip"]
pub const filament_backend_PrimitiveType_LINE_STRIP: filament_backend_PrimitiveType = 3;
#[doc = "!< triangles"]
pub const filament_backend_PrimitiveType_TRIANGLES: filament_backend_PrimitiveType = 4;
#[doc = "!< triangle strip"]
pub const filament_backend_PrimitiveType_TRIANGLE_STRIP: filament_backend_PrimitiveType = 5;
pub const filament_backend_PrimitiveType_NONE: filament_backend_PrimitiveType = 255;
#[doc = " Primitive types"]
pub type filament_backend_PrimitiveType = u8;
pub const filament_backend_UniformType_BOOL: filament_backend_UniformType = 0;
pub const filament_backend_UniformType_BOOL2: filament_backend_UniformType = 1;
pub const filament_backend_UniformType_BOOL3: filament_backend_UniformType = 2;
pub const filament_backend_UniformType_BOOL4: filament_backend_UniformType = 3;
pub const filament_backend_UniformType_FLOAT: filament_backend_UniformType = 4;
pub const filament_backend_UniformType_FLOAT2: filament_backend_UniformType = 5;
pub const filament_backend_UniformType_FLOAT3: filament_backend_UniformType = 6;
pub const filament_backend_UniformType_FLOAT4: filament_backend_UniformType = 7;
pub const filament_backend_UniformType_INT: filament_backend_UniformType = 8;
pub const filament_backend_UniformType_INT2: filament_backend_UniformType = 9;
pub const filament_backend_UniformType_INT3: filament_backend_UniformType = 10;
pub const filament_backend_UniformType_INT4: filament_backend_UniformType = 11;
pub const filament_backend_UniformType_UINT: filament_backend_UniformType = 12;
pub const filament_backend_UniformType_UINT2: filament_backend_UniformType = 13;
pub const filament_backend_UniformType_UINT3: filament_backend_UniformType = 14;
pub const filament_backend_UniformType_UINT4: filament_backend_UniformType = 15;
#[doc = "!< a 3x3 float matrix"]
pub const filament_backend_UniformType_MAT3: filament_backend_UniformType = 16;
#[doc = "!< a 4x4 float matrix"]
pub const filament_backend_UniformType_MAT4: filament_backend_UniformType = 17;
pub const filament_backend_UniformType_STRUCT: filament_backend_UniformType = 18;
#[doc = " Supported uniform types"]
pub type filament_backend_UniformType = u8;
pub const filament_backend_Precision_LOW: filament_backend_Precision = 0;
pub const filament_backend_Precision_MEDIUM: filament_backend_Precision = 1;
pub const filament_backend_Precision_HIGH: filament_backend_Precision = 2;
pub const filament_backend_Precision_DEFAULT: filament_backend_Precision = 3;
pub type filament_backend_Precision = u8;
#[doc = "!< 2D texture"]
pub const filament_backend_SamplerType_SAMPLER_2D: filament_backend_SamplerType = 0;
#[doc = "!< 2D array texture"]
pub const filament_backend_SamplerType_SAMPLER_2D_ARRAY: filament_backend_SamplerType = 1;
#[doc = "!< Cube map texture"]
pub const filament_backend_SamplerType_SAMPLER_CUBEMAP: filament_backend_SamplerType = 2;
#[doc = "!< External texture"]
pub const filament_backend_SamplerType_SAMPLER_EXTERNAL: filament_backend_SamplerType = 3;
#[doc = "!< 3D texture"]
pub const filament_backend_SamplerType_SAMPLER_3D: filament_backend_SamplerType = 4;
#[doc = "! Texture sampler type"]
pub type filament_backend_SamplerType = u8;
pub const filament_backend_SubpassType_SUBPASS_INPUT: filament_backend_SubpassType = 0;
#[doc = "! Subpass type"]
pub type filament_backend_SubpassType = u8;
#[doc = "!< signed integer sampler"]
pub const filament_backend_SamplerFormat_INT: filament_backend_SamplerFormat = 0;
#[doc = "!< unsigned integer sampler"]
pub const filament_backend_SamplerFormat_UINT: filament_backend_SamplerFormat = 1;
#[doc = "!< float sampler"]
pub const filament_backend_SamplerFormat_FLOAT: filament_backend_SamplerFormat = 2;
#[doc = "!< shadow sampler (PCF)"]
pub const filament_backend_SamplerFormat_SHADOW: filament_backend_SamplerFormat = 3;
#[doc = "! Texture sampler format"]
pub type filament_backend_SamplerFormat = u8;
pub const filament_backend_ElementType_BYTE: filament_backend_ElementType = 0;
pub const filament_backend_ElementType_BYTE2: filament_backend_ElementType = 1;
pub const filament_backend_ElementType_BYTE3: filament_backend_ElementType = 2;
pub const filament_backend_ElementType_BYTE4: filament_backend_ElementType = 3;
pub const filament_backend_ElementType_UBYTE: filament_backend_ElementType = 4;
pub const filament_backend_ElementType_UBYTE2: filament_backend_ElementType = 5;
pub const filament_backend_ElementType_UBYTE3: filament_backend_ElementType = 6;
pub const filament_backend_ElementType_UBYTE4: filament_backend_ElementType = 7;
pub const filament_backend_ElementType_SHORT: filament_backend_ElementType = 8;
pub const filament_backend_ElementType_SHORT2: filament_backend_ElementType = 9;
pub const filament_backend_ElementType_SHORT3: filament_backend_ElementType = 10;
pub const filament_backend_ElementType_SHORT4: filament_backend_ElementType = 11;
pub const filament_backend_ElementType_USHORT: filament_backend_ElementType = 12;
pub const filament_backend_ElementType_USHORT2: filament_backend_ElementType = 13;
pub const filament_backend_ElementType_USHORT3: filament_backend_ElementType = 14;
pub const filament_backend_ElementType_USHORT4: filament_backend_ElementType = 15;
pub const filament_backend_ElementType_INT: filament_backend_ElementType = 16;
pub const filament_backend_ElementType_UINT: filament_backend_ElementType = 17;
pub const filament_backend_ElementType_FLOAT: filament_backend_ElementType = 18;
pub const filament_backend_ElementType_FLOAT2: filament_backend_ElementType = 19;
pub const filament_backend_ElementType_FLOAT3: filament_backend_ElementType = 20;
pub const filament_backend_ElementType_FLOAT4: filament_backend_ElementType = 21;
pub const filament_backend_ElementType_HALF: filament_backend_ElementType = 22;
pub const filament_backend_ElementType_HALF2: filament_backend_ElementType = 23;
pub const filament_backend_ElementType_HALF3: filament_backend_ElementType = 24;
pub const filament_backend_ElementType_HALF4: filament_backend_ElementType = 25;
#[doc = " Supported element types"]
pub type filament_backend_ElementType = u8;
pub const filament_backend_BufferObjectBinding_VERTEX: filament_backend_BufferObjectBinding = 0;
pub const filament_backend_BufferObjectBinding_UNIFORM: filament_backend_BufferObjectBinding = 1;
#[doc = "! Buffer object binding type"]
pub type filament_backend_BufferObjectBinding = u8;
#[doc = "!< No culling, front and back faces are visible"]
pub const filament_backend_CullingMode_NONE: filament_backend_CullingMode = 0;
#[doc = "!< Front face culling, only back faces are visible"]
pub const filament_backend_CullingMode_FRONT: filament_backend_CullingMode = 1;
#[doc = "!< Back face culling, only front faces are visible"]
pub const filament_backend_CullingMode_BACK: filament_backend_CullingMode = 2;
#[doc = "!< Front and Back, geometry is not visible"]
pub const filament_backend_CullingMode_FRONT_AND_BACK: filament_backend_CullingMode = 3;
#[doc = "! Face culling Mode"]
pub type filament_backend_CullingMode = u8;
#[doc = "!< One Red channel, float"]
pub const filament_backend_PixelDataFormat_R: filament_backend_PixelDataFormat = 0;
#[doc = "!< One Red channel, integer"]
pub const filament_backend_PixelDataFormat_R_INTEGER: filament_backend_PixelDataFormat = 1;
#[doc = "!< Two Red and Green channels, float"]
pub const filament_backend_PixelDataFormat_RG: filament_backend_PixelDataFormat = 2;
#[doc = "!< Two Red and Green channels, integer"]
pub const filament_backend_PixelDataFormat_RG_INTEGER: filament_backend_PixelDataFormat = 3;
#[doc = "!< Three Red, Green and Blue channels, float"]
pub const filament_backend_PixelDataFormat_RGB: filament_backend_PixelDataFormat = 4;
#[doc = "!< Three Red, Green and Blue channels, integer"]
pub const filament_backend_PixelDataFormat_RGB_INTEGER: filament_backend_PixelDataFormat = 5;
#[doc = "!< Four Red, Green, Blue and Alpha channels, float"]
pub const filament_backend_PixelDataFormat_RGBA: filament_backend_PixelDataFormat = 6;
#[doc = "!< Four Red, Green, Blue and Alpha channels, integer"]
pub const filament_backend_PixelDataFormat_RGBA_INTEGER: filament_backend_PixelDataFormat = 7;
pub const filament_backend_PixelDataFormat_UNUSED: filament_backend_PixelDataFormat = 8;
#[doc = "!< Depth, 16-bit or 24-bits usually"]
pub const filament_backend_PixelDataFormat_DEPTH_COMPONENT: filament_backend_PixelDataFormat = 9;
#[doc = "!< Two Depth (24-bits) + Stencil (8-bits) channels"]
pub const filament_backend_PixelDataFormat_DEPTH_STENCIL: filament_backend_PixelDataFormat = 10;
pub const filament_backend_PixelDataFormat_ALPHA: filament_backend_PixelDataFormat = 11;
#[doc = "! Pixel Data Format"]
pub type filament_backend_PixelDataFormat = u8;
#[doc = "!< unsigned byte"]
pub const filament_backend_PixelDataType_UBYTE: filament_backend_PixelDataType = 0;
#[doc = "!< signed byte"]
pub const filament_backend_PixelDataType_BYTE: filament_backend_PixelDataType = 1;
#[doc = "!< unsigned short (16-bit)"]
pub const filament_backend_PixelDataType_USHORT: filament_backend_PixelDataType = 2;
#[doc = "!< signed short (16-bit)"]
pub const filament_backend_PixelDataType_SHORT: filament_backend_PixelDataType = 3;
#[doc = "!< unsigned int (32-bit)"]
pub const filament_backend_PixelDataType_UINT: filament_backend_PixelDataType = 4;
#[doc = "!< signed int (32-bit)"]
pub const filament_backend_PixelDataType_INT: filament_backend_PixelDataType = 5;
#[doc = "!< half-float (16-bit float)"]
pub const filament_backend_PixelDataType_HALF: filament_backend_PixelDataType = 6;
#[doc = "!< float (32-bits float)"]
pub const filament_backend_PixelDataType_FLOAT: filament_backend_PixelDataType = 7;
#[doc = "!< compressed pixels, @see CompressedPixelDataType"]
pub const filament_backend_PixelDataType_COMPRESSED: filament_backend_PixelDataType = 8;
#[doc = "!< three low precision floating-point numbers"]
pub const filament_backend_PixelDataType_UINT_10F_11F_11F_REV: filament_backend_PixelDataType = 9;
#[doc = "!< unsigned int (16-bit), encodes 3 RGB channels"]
pub const filament_backend_PixelDataType_USHORT_565: filament_backend_PixelDataType = 10;
#[doc = "!< unsigned normalized 10 bits RGB, 2 bits alpha"]
pub const filament_backend_PixelDataType_UINT_2_10_10_10_REV: filament_backend_PixelDataType = 11;
#[doc = "! Pixel Data Type"]
pub type filament_backend_PixelDataType = u8;
pub const filament_backend_CompressedPixelDataType_EAC_R11:
    filament_backend_CompressedPixelDataType = 0;
pub const filament_backend_CompressedPixelDataType_EAC_R11_SIGNED:
    filament_backend_CompressedPixelDataType = 1;
pub const filament_backend_CompressedPixelDataType_EAC_RG11:
    filament_backend_CompressedPixelDataType = 2;
pub const filament_backend_CompressedPixelDataType_EAC_RG11_SIGNED:
    filament_backend_CompressedPixelDataType = 3;
pub const filament_backend_CompressedPixelDataType_ETC2_RGB8:
    filament_backend_CompressedPixelDataType = 4;
pub const filament_backend_CompressedPixelDataType_ETC2_SRGB8:
    filament_backend_CompressedPixelDataType = 5;
pub const filament_backend_CompressedPixelDataType_ETC2_RGB8_A1:
    filament_backend_CompressedPixelDataType = 6;
pub const filament_backend_CompressedPixelDataType_ETC2_SRGB8_A1:
    filament_backend_CompressedPixelDataType = 7;
pub const filament_backend_CompressedPixelDataType_ETC2_EAC_RGBA8:
    filament_backend_CompressedPixelDataType = 8;
pub const filament_backend_CompressedPixelDataType_ETC2_EAC_SRGBA8:
    filament_backend_CompressedPixelDataType = 9;
pub const filament_backend_CompressedPixelDataType_DXT1_RGB:
    filament_backend_CompressedPixelDataType = 10;
pub const filament_backend_CompressedPixelDataType_DXT1_RGBA:
    filament_backend_CompressedPixelDataType = 11;
pub const filament_backend_CompressedPixelDataType_DXT3_RGBA:
    filament_backend_CompressedPixelDataType = 12;
pub const filament_backend_CompressedPixelDataType_DXT5_RGBA:
    filament_backend_CompressedPixelDataType = 13;
pub const filament_backend_CompressedPixelDataType_DXT1_SRGB:
    filament_backend_CompressedPixelDataType = 14;
pub const filament_backend_CompressedPixelDataType_DXT1_SRGBA:
    filament_backend_CompressedPixelDataType = 15;
pub const filament_backend_CompressedPixelDataType_DXT3_SRGBA:
    filament_backend_CompressedPixelDataType = 16;
pub const filament_backend_CompressedPixelDataType_DXT5_SRGBA:
    filament_backend_CompressedPixelDataType = 17;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_4x4:
    filament_backend_CompressedPixelDataType = 18;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_5x4:
    filament_backend_CompressedPixelDataType = 19;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_5x5:
    filament_backend_CompressedPixelDataType = 20;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_6x5:
    filament_backend_CompressedPixelDataType = 21;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_6x6:
    filament_backend_CompressedPixelDataType = 22;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_8x5:
    filament_backend_CompressedPixelDataType = 23;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_8x6:
    filament_backend_CompressedPixelDataType = 24;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_8x8:
    filament_backend_CompressedPixelDataType = 25;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_10x5:
    filament_backend_CompressedPixelDataType = 26;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_10x6:
    filament_backend_CompressedPixelDataType = 27;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_10x8:
    filament_backend_CompressedPixelDataType = 28;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_10x10:
    filament_backend_CompressedPixelDataType = 29;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_12x10:
    filament_backend_CompressedPixelDataType = 30;
pub const filament_backend_CompressedPixelDataType_RGBA_ASTC_12x12:
    filament_backend_CompressedPixelDataType = 31;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_4x4:
    filament_backend_CompressedPixelDataType = 32;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_5x4:
    filament_backend_CompressedPixelDataType = 33;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_5x5:
    filament_backend_CompressedPixelDataType = 34;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_6x5:
    filament_backend_CompressedPixelDataType = 35;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_6x6:
    filament_backend_CompressedPixelDataType = 36;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_8x5:
    filament_backend_CompressedPixelDataType = 37;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_8x6:
    filament_backend_CompressedPixelDataType = 38;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_8x8:
    filament_backend_CompressedPixelDataType = 39;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_10x5:
    filament_backend_CompressedPixelDataType = 40;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_10x6:
    filament_backend_CompressedPixelDataType = 41;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_10x8:
    filament_backend_CompressedPixelDataType = 42;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_10x10:
    filament_backend_CompressedPixelDataType = 43;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_12x10:
    filament_backend_CompressedPixelDataType = 44;
pub const filament_backend_CompressedPixelDataType_SRGB8_ALPHA8_ASTC_12x12:
    filament_backend_CompressedPixelDataType = 45;
#[doc = "! Compressed pixel data types"]
pub type filament_backend_CompressedPixelDataType = u16;
pub const filament_backend_TextureFormat_R8: filament_backend_TextureFormat = 0;
pub const filament_backend_TextureFormat_R8_SNORM: filament_backend_TextureFormat = 1;
pub const filament_backend_TextureFormat_R8UI: filament_backend_TextureFormat = 2;
pub const filament_backend_TextureFormat_R8I: filament_backend_TextureFormat = 3;
pub const filament_backend_TextureFormat_STENCIL8: filament_backend_TextureFormat = 4;
pub const filament_backend_TextureFormat_R16F: filament_backend_TextureFormat = 5;
pub const filament_backend_TextureFormat_R16UI: filament_backend_TextureFormat = 6;
pub const filament_backend_TextureFormat_R16I: filament_backend_TextureFormat = 7;
pub const filament_backend_TextureFormat_RG8: filament_backend_TextureFormat = 8;
pub const filament_backend_TextureFormat_RG8_SNORM: filament_backend_TextureFormat = 9;
pub const filament_backend_TextureFormat_RG8UI: filament_backend_TextureFormat = 10;
pub const filament_backend_TextureFormat_RG8I: filament_backend_TextureFormat = 11;
pub const filament_backend_TextureFormat_RGB565: filament_backend_TextureFormat = 12;
pub const filament_backend_TextureFormat_RGB9_E5: filament_backend_TextureFormat = 13;
pub const filament_backend_TextureFormat_RGB5_A1: filament_backend_TextureFormat = 14;
pub const filament_backend_TextureFormat_RGBA4: filament_backend_TextureFormat = 15;
pub const filament_backend_TextureFormat_DEPTH16: filament_backend_TextureFormat = 16;
pub const filament_backend_TextureFormat_RGB8: filament_backend_TextureFormat = 17;
pub const filament_backend_TextureFormat_SRGB8: filament_backend_TextureFormat = 18;
pub const filament_backend_TextureFormat_RGB8_SNORM: filament_backend_TextureFormat = 19;
pub const filament_backend_TextureFormat_RGB8UI: filament_backend_TextureFormat = 20;
pub const filament_backend_TextureFormat_RGB8I: filament_backend_TextureFormat = 21;
pub const filament_backend_TextureFormat_DEPTH24: filament_backend_TextureFormat = 22;
pub const filament_backend_TextureFormat_R32F: filament_backend_TextureFormat = 23;
pub const filament_backend_TextureFormat_R32UI: filament_backend_TextureFormat = 24;
pub const filament_backend_TextureFormat_R32I: filament_backend_TextureFormat = 25;
pub const filament_backend_TextureFormat_RG16F: filament_backend_TextureFormat = 26;
pub const filament_backend_TextureFormat_RG16UI: filament_backend_TextureFormat = 27;
pub const filament_backend_TextureFormat_RG16I: filament_backend_TextureFormat = 28;
pub const filament_backend_TextureFormat_R11F_G11F_B10F: filament_backend_TextureFormat = 29;
pub const filament_backend_TextureFormat_RGBA8: filament_backend_TextureFormat = 30;
pub const filament_backend_TextureFormat_SRGB8_A8: filament_backend_TextureFormat = 31;
pub const filament_backend_TextureFormat_RGBA8_SNORM: filament_backend_TextureFormat = 32;
pub const filament_backend_TextureFormat_UNUSED: filament_backend_TextureFormat = 33;
pub const filament_backend_TextureFormat_RGB10_A2: filament_backend_TextureFormat = 34;
pub const filament_backend_TextureFormat_RGBA8UI: filament_backend_TextureFormat = 35;
pub const filament_backend_TextureFormat_RGBA8I: filament_backend_TextureFormat = 36;
pub const filament_backend_TextureFormat_DEPTH32F: filament_backend_TextureFormat = 37;
pub const filament_backend_TextureFormat_DEPTH24_STENCIL8: filament_backend_TextureFormat = 38;
pub const filament_backend_TextureFormat_DEPTH32F_STENCIL8: filament_backend_TextureFormat = 39;
pub const filament_backend_TextureFormat_RGB16F: filament_backend_TextureFormat = 40;
pub const filament_backend_TextureFormat_RGB16UI: filament_backend_TextureFormat = 41;
pub const filament_backend_TextureFormat_RGB16I: filament_backend_TextureFormat = 42;
pub const filament_backend_TextureFormat_RG32F: filament_backend_TextureFormat = 43;
pub const filament_backend_TextureFormat_RG32UI: filament_backend_TextureFormat = 44;
pub const filament_backend_TextureFormat_RG32I: filament_backend_TextureFormat = 45;
pub const filament_backend_TextureFormat_RGBA16F: filament_backend_TextureFormat = 46;
pub const filament_backend_TextureFormat_RGBA16UI: filament_backend_TextureFormat = 47;
pub const filament_backend_TextureFormat_RGBA16I: filament_backend_TextureFormat = 48;
pub const filament_backend_TextureFormat_RGB32F: filament_backend_TextureFormat = 49;
pub const filament_backend_TextureFormat_RGB32UI: filament_backend_TextureFormat = 50;
pub const filament_backend_TextureFormat_RGB32I: filament_backend_TextureFormat = 51;
pub const filament_backend_TextureFormat_RGBA32F: filament_backend_TextureFormat = 52;
pub const filament_backend_TextureFormat_RGBA32UI: filament_backend_TextureFormat = 53;
pub const filament_backend_TextureFormat_RGBA32I: filament_backend_TextureFormat = 54;
pub const filament_backend_TextureFormat_EAC_R11: filament_backend_TextureFormat = 55;
pub const filament_backend_TextureFormat_EAC_R11_SIGNED: filament_backend_TextureFormat = 56;
pub const filament_backend_TextureFormat_EAC_RG11: filament_backend_TextureFormat = 57;
pub const filament_backend_TextureFormat_EAC_RG11_SIGNED: filament_backend_TextureFormat = 58;
pub const filament_backend_TextureFormat_ETC2_RGB8: filament_backend_TextureFormat = 59;
pub const filament_backend_TextureFormat_ETC2_SRGB8: filament_backend_TextureFormat = 60;
pub const filament_backend_TextureFormat_ETC2_RGB8_A1: filament_backend_TextureFormat = 61;
pub const filament_backend_TextureFormat_ETC2_SRGB8_A1: filament_backend_TextureFormat = 62;
pub const filament_backend_TextureFormat_ETC2_EAC_RGBA8: filament_backend_TextureFormat = 63;
pub const filament_backend_TextureFormat_ETC2_EAC_SRGBA8: filament_backend_TextureFormat = 64;
pub const filament_backend_TextureFormat_DXT1_RGB: filament_backend_TextureFormat = 65;
pub const filament_backend_TextureFormat_DXT1_RGBA: filament_backend_TextureFormat = 66;
pub const filament_backend_TextureFormat_DXT3_RGBA: filament_backend_TextureFormat = 67;
pub const filament_backend_TextureFormat_DXT5_RGBA: filament_backend_TextureFormat = 68;
pub const filament_backend_TextureFormat_DXT1_SRGB: filament_backend_TextureFormat = 69;
pub const filament_backend_TextureFormat_DXT1_SRGBA: filament_backend_TextureFormat = 70;
pub const filament_backend_TextureFormat_DXT3_SRGBA: filament_backend_TextureFormat = 71;
pub const filament_backend_TextureFormat_DXT5_SRGBA: filament_backend_TextureFormat = 72;
pub const filament_backend_TextureFormat_RGBA_ASTC_4x4: filament_backend_TextureFormat = 73;
pub const filament_backend_TextureFormat_RGBA_ASTC_5x4: filament_backend_TextureFormat = 74;
pub const filament_backend_TextureFormat_RGBA_ASTC_5x5: filament_backend_TextureFormat = 75;
pub const filament_backend_TextureFormat_RGBA_ASTC_6x5: filament_backend_TextureFormat = 76;
pub const filament_backend_TextureFormat_RGBA_ASTC_6x6: filament_backend_TextureFormat = 77;
pub const filament_backend_TextureFormat_RGBA_ASTC_8x5: filament_backend_TextureFormat = 78;
pub const filament_backend_TextureFormat_RGBA_ASTC_8x6: filament_backend_TextureFormat = 79;
pub const filament_backend_TextureFormat_RGBA_ASTC_8x8: filament_backend_TextureFormat = 80;
pub const filament_backend_TextureFormat_RGBA_ASTC_10x5: filament_backend_TextureFormat = 81;
pub const filament_backend_TextureFormat_RGBA_ASTC_10x6: filament_backend_TextureFormat = 82;
pub const filament_backend_TextureFormat_RGBA_ASTC_10x8: filament_backend_TextureFormat = 83;
pub const filament_backend_TextureFormat_RGBA_ASTC_10x10: filament_backend_TextureFormat = 84;
pub const filament_backend_TextureFormat_RGBA_ASTC_12x10: filament_backend_TextureFormat = 85;
pub const filament_backend_TextureFormat_RGBA_ASTC_12x12: filament_backend_TextureFormat = 86;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_4x4: filament_backend_TextureFormat = 87;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_5x4: filament_backend_TextureFormat = 88;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_5x5: filament_backend_TextureFormat = 89;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_6x5: filament_backend_TextureFormat = 90;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_6x6: filament_backend_TextureFormat = 91;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_8x5: filament_backend_TextureFormat = 92;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_8x6: filament_backend_TextureFormat = 93;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_8x8: filament_backend_TextureFormat = 94;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_10x5: filament_backend_TextureFormat =
    95;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_10x6: filament_backend_TextureFormat =
    96;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_10x8: filament_backend_TextureFormat =
    97;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_10x10: filament_backend_TextureFormat =
    98;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_12x10: filament_backend_TextureFormat =
    99;
pub const filament_backend_TextureFormat_SRGB8_ALPHA8_ASTC_12x12: filament_backend_TextureFormat =
    100;
#[doc = " Supported texel formats"]
#[doc = " These formats are typically used to specify a texture's internal storage format."]
#[doc = ""]
#[doc = " Enumerants syntax format"]
#[doc = " ========================"]
#[doc = ""]
#[doc = " `[components][size][type]`"]
#[doc = ""]
#[doc = " `components` : List of stored components by this format.\\n"]
#[doc = " `size`       : Size in bit of each component.\\n"]
#[doc = " `type`       : Type this format is stored as.\\n"]
#[doc = ""]
#[doc = ""]
#[doc = " Name     | Component"]
#[doc = " :--------|:-------------------------------"]
#[doc = " R        | Linear Red"]
#[doc = " RG       | Linear Red, Green"]
#[doc = " RGB      | Linear Red, Green, Blue"]
#[doc = " RGBA     | Linear Red, Green Blue, Alpha"]
#[doc = " SRGB     | sRGB encoded Red, Green, Blue"]
#[doc = " DEPTH    | Depth"]
#[doc = " STENCIL  | Stencil"]
#[doc = ""]
#[doc = " \\n"]
#[doc = " Name     | Type"]
#[doc = " :--------|:---------------------------------------------------"]
#[doc = " (none)   | Unsigned Normalized Integer [0, 1]"]
#[doc = " _SNORM   | Signed Normalized Integer [-1, 1]"]
#[doc = " UI       | Unsigned Integer @f$ [0, 2^{size}] @f$"]
#[doc = " I        | Signed Integer @f$ [-2^{size-1}, 2^{size-1}-1] @f$"]
#[doc = " F        | Floating-point"]
#[doc = ""]
#[doc = ""]
#[doc = " Special color formats"]
#[doc = " ---------------------"]
#[doc = ""]
#[doc = " There are a few special color formats that don't follow the convention above:"]
#[doc = ""]
#[doc = " Name             | Format"]
#[doc = " :----------------|:--------------------------------------------------------------------------"]
#[doc = " RGB565           |  5-bits for R and B, 6-bits for G."]
#[doc = " RGB5_A1          |  5-bits for R, G and B, 1-bit for A."]
#[doc = " RGB10_A2         | 10-bits for R, G and B, 2-bits for A."]
#[doc = " RGB9_E5          | **Unsigned** floating point. 9-bits mantissa for RGB, 5-bits shared exponent"]
#[doc = " R11F_G11F_B10F   | **Unsigned** floating point. 6-bits mantissa, for R and G, 5-bits for B. 5-bits exponent."]
#[doc = " SRGB8_A8         | sRGB 8-bits with linear 8-bits alpha."]
#[doc = " DEPTH24_STENCIL8 | 24-bits unsigned normalized integer depth, 8-bits stencil."]
#[doc = " DEPTH32F_STENCIL8| 32-bits floating-point depth, 8-bits stencil."]
#[doc = ""]
#[doc = ""]
#[doc = " Compressed texture formats"]
#[doc = " --------------------------"]
#[doc = ""]
#[doc = " Many compressed texture formats are supported as well, which include (but are not limited to)"]
#[doc = " the following list:"]
#[doc = ""]
#[doc = " Name             | Format"]
#[doc = " :----------------|:--------------------------------------------------------------------------"]
#[doc = " EAC_R11          | Compresses R11UI"]
#[doc = " EAC_R11_SIGNED   | Compresses R11I"]
#[doc = " EAC_RG11         | Compresses RG11UI"]
#[doc = " EAC_RG11_SIGNED  | Compresses RG11I"]
#[doc = " ETC2_RGB8        | Compresses RGB8"]
#[doc = " ETC2_SRGB8       | compresses SRGB8"]
#[doc = " ETC2_EAC_RGBA8   | Compresses RGBA8"]
#[doc = " ETC2_EAC_SRGBA8  | Compresses SRGB8_A8"]
#[doc = " ETC2_RGB8_A1     | Compresses RGB8 with 1-bit alpha"]
#[doc = " ETC2_SRGB8_A1    | Compresses sRGB8 with 1-bit alpha"]
#[doc = ""]
#[doc = ""]
#[doc = " @see Texture"]
pub type filament_backend_TextureFormat = u16;
pub const filament_backend_TextureUsage_NONE: filament_backend_TextureUsage = 0;
#[doc = "!< Texture can be used as a color attachment"]
pub const filament_backend_TextureUsage_COLOR_ATTACHMENT: filament_backend_TextureUsage = 1;
#[doc = "!< Texture can be used as a depth attachment"]
pub const filament_backend_TextureUsage_DEPTH_ATTACHMENT: filament_backend_TextureUsage = 2;
#[doc = "!< Texture can be used as a stencil attachment"]
pub const filament_backend_TextureUsage_STENCIL_ATTACHMENT: filament_backend_TextureUsage = 4;
#[doc = "!< Data can be uploaded into this texture (default)"]
pub const filament_backend_TextureUsage_UPLOADABLE: filament_backend_TextureUsage = 8;
#[doc = "!< Texture can be sampled (default)"]
pub const filament_backend_TextureUsage_SAMPLEABLE: filament_backend_TextureUsage = 16;
#[doc = "!< Texture can be used as a subpass input"]
pub const filament_backend_TextureUsage_SUBPASS_INPUT: filament_backend_TextureUsage = 32;
#[doc = "!< Default texture usage"]
pub const filament_backend_TextureUsage_DEFAULT: filament_backend_TextureUsage = 24;
#[doc = "! Bitmask describing the intended Texture Usage"]
pub type filament_backend_TextureUsage = u8;
pub const filament_backend_TextureSwizzle_SUBSTITUTE_ZERO: filament_backend_TextureSwizzle = 0;
pub const filament_backend_TextureSwizzle_SUBSTITUTE_ONE: filament_backend_TextureSwizzle = 1;
pub const filament_backend_TextureSwizzle_CHANNEL_0: filament_backend_TextureSwizzle = 2;
pub const filament_backend_TextureSwizzle_CHANNEL_1: filament_backend_TextureSwizzle = 3;
pub const filament_backend_TextureSwizzle_CHANNEL_2: filament_backend_TextureSwizzle = 4;
pub const filament_backend_TextureSwizzle_CHANNEL_3: filament_backend_TextureSwizzle = 5;
#[doc = "! Texture swizzle"]
pub type filament_backend_TextureSwizzle = u8;
#[doc = "!< +x face"]
pub const filament_backend_TextureCubemapFace_POSITIVE_X: filament_backend_TextureCubemapFace = 0;
#[doc = "!< -x face"]
pub const filament_backend_TextureCubemapFace_NEGATIVE_X: filament_backend_TextureCubemapFace = 1;
#[doc = "!< +y face"]
pub const filament_backend_TextureCubemapFace_POSITIVE_Y: filament_backend_TextureCubemapFace = 2;
#[doc = "!< -y face"]
pub const filament_backend_TextureCubemapFace_NEGATIVE_Y: filament_backend_TextureCubemapFace = 3;
#[doc = "!< +z face"]
pub const filament_backend_TextureCubemapFace_POSITIVE_Z: filament_backend_TextureCubemapFace = 4;
#[doc = "!< -z face"]
pub const filament_backend_TextureCubemapFace_NEGATIVE_Z: filament_backend_TextureCubemapFace = 5;
#[doc = "! Texture Cubemap Face"]
pub type filament_backend_TextureCubemapFace = u8;
#[doc = "! Face offsets for all faces of a cubemap"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct filament_backend_FaceOffsets {
    pub __bindgen_anon_1: filament_backend_FaceOffsets__bindgen_ty_1,
}
pub type filament_backend_FaceOffsets_size_type = size_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union filament_backend_FaceOffsets__bindgen_ty_1 {
    pub __bindgen_anon_1: filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1,
    pub offsets: [filament_backend_FaceOffsets_size_type; 6usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "!< +x face offset in bytes"]
    pub px: filament_backend_FaceOffsets_size_type,
    #[doc = "!< -x face offset in bytes"]
    pub nx: filament_backend_FaceOffsets_size_type,
    #[doc = "!< +y face offset in bytes"]
    pub py: filament_backend_FaceOffsets_size_type,
    #[doc = "!< -y face offset in bytes"]
    pub ny: filament_backend_FaceOffsets_size_type,
    #[doc = "!< +z face offset in bytes"]
    pub pz: filament_backend_FaceOffsets_size_type,
    #[doc = "!< -z face offset in bytes"]
    pub nz: filament_backend_FaceOffsets_size_type,
}
#[test]
fn bindgen_test_layout_filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1>())).px
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(px)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1>())).nx
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(nx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1>())).py
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(py)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1>())).ny
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ny)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1>())).pz
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(pz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1>())).nz
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_FaceOffsets__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(nz)
        )
    );
}
#[test]
fn bindgen_test_layout_filament_backend_FaceOffsets__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_FaceOffsets__bindgen_ty_1>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(filament_backend_FaceOffsets__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_FaceOffsets__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_FaceOffsets__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_FaceOffsets__bindgen_ty_1>())).offsets
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_FaceOffsets__bindgen_ty_1),
            "::",
            stringify!(offsets)
        )
    );
}
impl Default for filament_backend_FaceOffsets__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_filament_backend_FaceOffsets() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_FaceOffsets>(),
        48usize,
        concat!("Size of: ", stringify!(filament_backend_FaceOffsets))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_FaceOffsets>(),
        8usize,
        concat!("Alignment of ", stringify!(filament_backend_FaceOffsets))
    );
}
impl Default for filament_backend_FaceOffsets {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "!< clamp-to-edge. The edge of the texture extends to infinity."]
pub const filament_backend_SamplerWrapMode_CLAMP_TO_EDGE: filament_backend_SamplerWrapMode = 0;
#[doc = "!< repeat. The texture infinitely repeats in the wrap direction."]
pub const filament_backend_SamplerWrapMode_REPEAT: filament_backend_SamplerWrapMode = 1;
#[doc = "!< mirrored-repeat. The texture infinitely repeats and mirrors in the wrap direction."]
pub const filament_backend_SamplerWrapMode_MIRRORED_REPEAT: filament_backend_SamplerWrapMode = 2;
#[doc = "! Sampler Wrap mode"]
pub type filament_backend_SamplerWrapMode = u8;
#[doc = "!< No filtering. Nearest neighbor is used."]
pub const filament_backend_SamplerMinFilter_NEAREST: filament_backend_SamplerMinFilter = 0;
#[doc = "!< Box filtering. Weighted average of 4 neighbors is used."]
pub const filament_backend_SamplerMinFilter_LINEAR: filament_backend_SamplerMinFilter = 1;
#[doc = "!< Mip-mapping is activated. But no filtering occurs."]
pub const filament_backend_SamplerMinFilter_NEAREST_MIPMAP_NEAREST:
    filament_backend_SamplerMinFilter = 2;
#[doc = "!< Box filtering within a mip-map level."]
pub const filament_backend_SamplerMinFilter_LINEAR_MIPMAP_NEAREST:
    filament_backend_SamplerMinFilter = 3;
#[doc = "!< Mip-map levels are interpolated, but no other filtering occurs."]
pub const filament_backend_SamplerMinFilter_NEAREST_MIPMAP_LINEAR:
    filament_backend_SamplerMinFilter = 4;
#[doc = "!< Both interpolated Mip-mapping and linear filtering are used."]
pub const filament_backend_SamplerMinFilter_LINEAR_MIPMAP_LINEAR:
    filament_backend_SamplerMinFilter = 5;
#[doc = "! Sampler minification filter"]
pub type filament_backend_SamplerMinFilter = u8;
#[doc = "!< No filtering. Nearest neighbor is used."]
pub const filament_backend_SamplerMagFilter_NEAREST: filament_backend_SamplerMagFilter = 0;
#[doc = "!< Box filtering. Weighted average of 4 neighbors is used."]
pub const filament_backend_SamplerMagFilter_LINEAR: filament_backend_SamplerMagFilter = 1;
#[doc = "! Sampler magnification filter"]
pub type filament_backend_SamplerMagFilter = u8;
pub const filament_backend_SamplerCompareMode_NONE: filament_backend_SamplerCompareMode = 0;
pub const filament_backend_SamplerCompareMode_COMPARE_TO_TEXTURE:
    filament_backend_SamplerCompareMode = 1;
#[doc = "! Sampler compare mode"]
pub type filament_backend_SamplerCompareMode = u8;
#[doc = "!< Less or equal"]
pub const filament_backend_SamplerCompareFunc_LE: filament_backend_SamplerCompareFunc = 0;
#[doc = "!< Greater or equal"]
pub const filament_backend_SamplerCompareFunc_GE: filament_backend_SamplerCompareFunc = 1;
#[doc = "!< Strictly less than"]
pub const filament_backend_SamplerCompareFunc_L: filament_backend_SamplerCompareFunc = 2;
#[doc = "!< Strictly greater than"]
pub const filament_backend_SamplerCompareFunc_G: filament_backend_SamplerCompareFunc = 3;
#[doc = "!< Equal"]
pub const filament_backend_SamplerCompareFunc_E: filament_backend_SamplerCompareFunc = 4;
#[doc = "!< Not equal"]
pub const filament_backend_SamplerCompareFunc_NE: filament_backend_SamplerCompareFunc = 5;
#[doc = "!< Always. Depth testing is deactivated."]
pub const filament_backend_SamplerCompareFunc_A: filament_backend_SamplerCompareFunc = 6;
#[doc = "!< Never. The depth test always fails."]
pub const filament_backend_SamplerCompareFunc_N: filament_backend_SamplerCompareFunc = 7;
#[doc = "! comparison function for the depth sampler"]
pub type filament_backend_SamplerCompareFunc = u8;
#[doc = "! Sampler paramters"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct filament_backend_SamplerParams {
    pub __bindgen_anon_1: filament_backend_SamplerParams__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union filament_backend_SamplerParams__bindgen_ty_1 {
    pub __bindgen_anon_1: filament_backend_SamplerParams__bindgen_ty_1__bindgen_ty_1,
    pub u: u32,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct filament_backend_SamplerParams__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_filament_backend_SamplerParams__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_SamplerParams__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(filament_backend_SamplerParams__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_SamplerParams__bindgen_ty_1__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_SamplerParams__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl Default for filament_backend_SamplerParams__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl filament_backend_SamplerParams__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn filterMag(&self) -> filament_backend_SamplerMagFilter {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_filterMag(&mut self, val: filament_backend_SamplerMagFilter) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn filterMin(&self) -> filament_backend_SamplerMinFilter {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_filterMin(&mut self, val: filament_backend_SamplerMinFilter) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn wrapS(&self) -> filament_backend_SamplerWrapMode {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_wrapS(&mut self, val: filament_backend_SamplerWrapMode) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn wrapT(&self) -> filament_backend_SamplerWrapMode {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_wrapT(&mut self, val: filament_backend_SamplerWrapMode) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn wrapR(&self) -> filament_backend_SamplerWrapMode {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_wrapR(&mut self, val: filament_backend_SamplerWrapMode) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn anisotropyLog2(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_anisotropyLog2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn compareMode(&self) -> filament_backend_SamplerCompareMode {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_compareMode(&mut self, val: filament_backend_SamplerCompareMode) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn padding0(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_padding0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn compareFunc(&self) -> filament_backend_SamplerCompareFunc {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_compareFunc(&mut self, val: filament_backend_SamplerCompareFunc) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn padding1(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_padding1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn padding2(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u8) }
    }
    #[inline]
    pub fn set_padding2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        filterMag: filament_backend_SamplerMagFilter,
        filterMin: filament_backend_SamplerMinFilter,
        wrapS: filament_backend_SamplerWrapMode,
        wrapT: filament_backend_SamplerWrapMode,
        wrapR: filament_backend_SamplerWrapMode,
        anisotropyLog2: u8,
        compareMode: filament_backend_SamplerCompareMode,
        padding0: u8,
        compareFunc: filament_backend_SamplerCompareFunc,
        padding1: u8,
        padding2: u8,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let filterMag: u8 = unsafe { ::std::mem::transmute(filterMag) };
            filterMag as u64
        });
        __bindgen_bitfield_unit.set(1usize, 3u8, {
            let filterMin: u8 = unsafe { ::std::mem::transmute(filterMin) };
            filterMin as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let wrapS: u8 = unsafe { ::std::mem::transmute(wrapS) };
            wrapS as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let wrapT: u8 = unsafe { ::std::mem::transmute(wrapT) };
            wrapT as u64
        });
        __bindgen_bitfield_unit.set(8usize, 2u8, {
            let wrapR: u8 = unsafe { ::std::mem::transmute(wrapR) };
            wrapR as u64
        });
        __bindgen_bitfield_unit.set(10usize, 3u8, {
            let anisotropyLog2: u8 = unsafe { ::std::mem::transmute(anisotropyLog2) };
            anisotropyLog2 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let compareMode: u8 = unsafe { ::std::mem::transmute(compareMode) };
            compareMode as u64
        });
        __bindgen_bitfield_unit.set(14usize, 2u8, {
            let padding0: u8 = unsafe { ::std::mem::transmute(padding0) };
            padding0 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 3u8, {
            let compareFunc: u8 = unsafe { ::std::mem::transmute(compareFunc) };
            compareFunc as u64
        });
        __bindgen_bitfield_unit.set(19usize, 5u8, {
            let padding1: u8 = unsafe { ::std::mem::transmute(padding1) };
            padding1 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let padding2: u8 = unsafe { ::std::mem::transmute(padding2) };
            padding2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_filament_backend_SamplerParams__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_SamplerParams__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(filament_backend_SamplerParams__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_SamplerParams__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_SamplerParams__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_SamplerParams__bindgen_ty_1>())).u as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_SamplerParams__bindgen_ty_1),
            "::",
            stringify!(u)
        )
    );
}
impl Default for filament_backend_SamplerParams__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_filament_backend_SamplerParams() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_SamplerParams>(),
        4usize,
        concat!("Size of: ", stringify!(filament_backend_SamplerParams))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_SamplerParams>(),
        4usize,
        concat!("Alignment of ", stringify!(filament_backend_SamplerParams))
    );
}
impl Default for filament_backend_SamplerParams {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "!< Not synchronized but copy-free. Good for video."]
pub const filament_backend_StreamType_NATIVE: filament_backend_StreamType = 0;
#[doc = "!< Synchronized, but GL-only and incurs copies. Good for AR on devices before API 26."]
pub const filament_backend_StreamType_TEXTURE_ID: filament_backend_StreamType = 1;
#[doc = "!< Synchronized, copy-free, and take a release callback. Good for AR but requires API 26+."]
pub const filament_backend_StreamType_ACQUIRED: filament_backend_StreamType = 2;
#[doc = "! Stream for external textures"]
pub type filament_backend_StreamType = ::std::os::raw::c_int;
#[doc = "! Releases an ACQUIRED external texture, guaranteed to be called on the application thread."]
pub type filament_backend_StreamCallback = ::std::option::Option<
    unsafe extern "C" fn(image: *mut ::std::os::raw::c_void, user: *mut ::std::os::raw::c_void),
>;
pub type filament_backend_FrameScheduledCallback = ::std::option::Option<
    unsafe extern "C" fn(
        callable: filament_backend_PresentCallable,
        user: *mut ::std::os::raw::c_void,
    ),
>;
pub type filament_backend_FrameCompletedCallback =
    ::std::option::Option<unsafe extern "C" fn(user: *mut ::std::os::raw::c_void)>;
#[doc = " A CPU memory-buffer descriptor, typically used to transfer data from the CPU to the GPU."]
#[doc = ""]
#[doc = " A BufferDescriptor owns the memory buffer it references, therefore BufferDescriptor cannot"]
#[doc = " be copied, but can be moved."]
#[doc = ""]
#[doc = " BufferDescriptor releases ownership of the memory-buffer when it's destroyed."]
#[repr(C)]
#[derive(Debug)]
pub struct filament_backend_BufferDescriptor {
    #[doc = "! CPU mempry-buffer virtual address"]
    pub buffer: *mut ::std::os::raw::c_void,
    #[doc = "! CPU memory-buffer size in bytes"]
    pub size: size_t,
    pub mCallback: filament_backend_BufferDescriptor_Callback,
    pub mUser: *mut ::std::os::raw::c_void,
    pub mHandler: *mut filament_backend_CallbackHandler,
}
#[doc = " Callback used to destroy the buffer data."]
#[doc = " Guarantees:"]
#[doc = "      Called on the main filament thread."]
#[doc = ""]
#[doc = " Limitations:"]
#[doc = "      Must be lightweight."]
#[doc = "      Must not call filament APIs."]
pub type filament_backend_BufferDescriptor_Callback = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *mut ::std::os::raw::c_void,
        size: size_t,
        user: *mut ::std::os::raw::c_void,
    ),
>;
#[test]
fn bindgen_test_layout_filament_backend_BufferDescriptor() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_BufferDescriptor>(),
        40usize,
        concat!("Size of: ", stringify!(filament_backend_BufferDescriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_BufferDescriptor>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_BufferDescriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_BufferDescriptor>())).buffer as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_BufferDescriptor),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_BufferDescriptor>())).size as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_BufferDescriptor),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_BufferDescriptor>())).mCallback as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_BufferDescriptor),
            "::",
            stringify!(mCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_BufferDescriptor>())).mUser as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_BufferDescriptor),
            "::",
            stringify!(mUser)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_BufferDescriptor>())).mHandler as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_BufferDescriptor),
            "::",
            stringify!(mHandler)
        )
    );
}
impl Default for filament_backend_BufferDescriptor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filament_backend_Driver {
    _unused: [u8; 0],
}
#[repr(C)]
pub struct filament_backend_Platform__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct filament_backend_Platform {
    pub vtable_: *const filament_backend_Platform__bindgen_vtable,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_backend_Platform_SwapChain {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_filament_backend_Platform_SwapChain() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_Platform_SwapChain>(),
        1usize,
        concat!("Size of: ", stringify!(filament_backend_Platform_SwapChain))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_Platform_SwapChain>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_Platform_SwapChain)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_backend_Platform_Fence {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_filament_backend_Platform_Fence() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_Platform_Fence>(),
        1usize,
        concat!("Size of: ", stringify!(filament_backend_Platform_Fence))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_Platform_Fence>(),
        1usize,
        concat!("Alignment of ", stringify!(filament_backend_Platform_Fence))
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_backend_Platform_Stream {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_filament_backend_Platform_Stream() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_Platform_Stream>(),
        1usize,
        concat!("Size of: ", stringify!(filament_backend_Platform_Stream))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_Platform_Stream>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_Platform_Stream)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_backend_Platform_ExternalTexture {
    pub image: usize,
}
#[test]
fn bindgen_test_layout_filament_backend_Platform_ExternalTexture() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_Platform_ExternalTexture>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(filament_backend_Platform_ExternalTexture)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_Platform_ExternalTexture>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_Platform_ExternalTexture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_Platform_ExternalTexture>())).image as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_Platform_ExternalTexture),
            "::",
            stringify!(image)
        )
    );
}
#[test]
fn bindgen_test_layout_filament_backend_Platform() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_Platform>(),
        8usize,
        concat!("Size of: ", stringify!(filament_backend_Platform))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_Platform>(),
        8usize,
        concat!("Alignment of ", stringify!(filament_backend_Platform))
    );
}
impl Default for filament_backend_Platform {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament7backend8PlatformD1Ev"]
    pub fn filament_backend_Platform_Platform_destructor(this: *mut filament_backend_Platform);
}
#[doc = " A descriptor to an image in main memory, typically used to transfer image data from the CPU"]
#[doc = " to the GPU."]
#[doc = ""]
#[doc = " A PixelBufferDescriptor owns the memory buffer it references, therefore PixelBufferDescriptor"]
#[doc = " cannot be copied, but can be moved."]
#[doc = ""]
#[doc = " PixelBufferDescriptor releases ownership of the memory-buffer when it's destroyed."]
#[repr(C)]
pub struct filament_backend_PixelBufferDescriptor {
    pub _base: filament_backend_BufferDescriptor,
    #[doc = "! left coordinate in pixels"]
    pub left: u32,
    #[doc = "! top coordinate in pixels"]
    pub top: u32,
    pub __bindgen_anon_1: filament_backend_PixelBufferDescriptor__bindgen_ty_1,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[doc = "! Pixel Data Format"]
pub use self::filament_backend_PixelDataFormat as filament_backend_PixelBufferDescriptor_PixelDataFormat;
#[doc = "! Pixel Data Type"]
pub use self::filament_backend_PixelDataType as filament_backend_PixelBufferDescriptor_PixelDataType;
#[repr(C)]
#[derive(Copy, Clone)]
pub union filament_backend_PixelBufferDescriptor__bindgen_ty_1 {
    pub __bindgen_anon_1: filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "! stride in pixels"]
    pub stride: u32,
    #[doc = "! Pixel data format"]
    pub format: filament_backend_PixelBufferDescriptor_PixelDataFormat,
}
#[test]
fn bindgen_test_layout_filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1>(
        ),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<
                filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1,
            >()))
            .stride as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<
                filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1,
            >()))
            .format as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(format)
        )
    );
}
impl Default for filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2 {
    #[doc = "! compressed image size"]
    pub imageSize: u32,
    #[doc = "! compressed image format"]
    pub compressedFormat: filament_backend_CompressedPixelDataType,
}
#[test]
fn bindgen_test_layout_filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2>(
        ),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<
                filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2,
            >()))
            .imageSize as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(imageSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<
                filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2,
            >()))
            .compressedFormat as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(compressedFormat)
        )
    );
}
impl Default for filament_backend_PixelBufferDescriptor__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_filament_backend_PixelBufferDescriptor__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_PixelBufferDescriptor__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(filament_backend_PixelBufferDescriptor__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_PixelBufferDescriptor__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_PixelBufferDescriptor__bindgen_ty_1)
        )
    );
}
impl Default for filament_backend_PixelBufferDescriptor__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_filament_backend_PixelBufferDescriptor() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_PixelBufferDescriptor>(),
        64usize,
        concat!(
            "Size of: ",
            stringify!(filament_backend_PixelBufferDescriptor)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_PixelBufferDescriptor>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_PixelBufferDescriptor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_PixelBufferDescriptor>())).left as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_PixelBufferDescriptor),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_backend_PixelBufferDescriptor>())).top as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_backend_PixelBufferDescriptor),
            "::",
            stringify!(top)
        )
    );
}
impl Default for filament_backend_PixelBufferDescriptor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl filament_backend_PixelBufferDescriptor {
    #[inline]
    pub fn type_(&self) -> filament_backend_PixelBufferDescriptor_PixelDataType {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_type(&mut self, val: filament_backend_PixelBufferDescriptor_PixelDataType) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn alignment(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_alignment(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: filament_backend_PixelBufferDescriptor_PixelDataType,
        alignment: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let type_: u8 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let alignment: u8 = unsafe { ::std::mem::transmute(alignment) };
            alignment as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
pub struct filament_backend_CallbackHandler__bindgen_vtable(::std::os::raw::c_void);
#[doc = " A generic interface to dispatch callbacks."]
#[doc = ""]
#[doc = " All APIs that take a callback as argument also take a"]
#[doc = " CallbackHandler* which is used to dispatch the"]
#[doc = " callback: CallbackHandler::post() method is called from a service thread as soon"]
#[doc = " as possible (this will NEVER be the main thread), CallbackHandler::post()"]
#[doc = " is  responsible for scheduling the callback onto the thread the"]
#[doc = " user desires."]
#[doc = ""]
#[doc = " This is intended to make callbacks interoperate with"]
#[doc = " the platform/OS's own messaging system."]
#[doc = ""]
#[doc = " CallbackHandler* can always be nullptr in which case the default handler is used. The"]
#[doc = " default handler always dispatches callbacks on filament's main thread opportunistically."]
#[doc = ""]
#[doc = " Life time:"]
#[doc = " ---------"]
#[doc = ""]
#[doc = " Filament make no attempts to manage the life time of the CallbackHandler* and never takes"]
#[doc = " ownership."]
#[doc = " In particular, this means that the CallbackHandler instance must stay valid until all"]
#[doc = " pending callbacks are been dispatched."]
#[doc = ""]
#[doc = " Similarly, when shutting down filament, care must be taken to ensure that all pending callbacks"]
#[doc = " that might access filament's state have been dispatched. Filament can no longer ensure this"]
#[doc = " because callback execution is the responsibility of the CallbackHandler, which is external to"]
#[doc = " filament."]
#[doc = " Typically, the concrete CallbackHandler would have a mechanism to drain and/or wait for all"]
#[doc = " callbacks to be processed."]
#[doc = ""]
#[repr(C)]
#[derive(Debug)]
pub struct filament_backend_CallbackHandler {
    pub vtable_: *const filament_backend_CallbackHandler__bindgen_vtable,
}
pub type filament_backend_CallbackHandler_Callback =
    ::std::option::Option<unsafe extern "C" fn(user: *mut ::std::os::raw::c_void)>;
#[test]
fn bindgen_test_layout_filament_backend_CallbackHandler() {
    assert_eq!(
        ::std::mem::size_of::<filament_backend_CallbackHandler>(),
        8usize,
        concat!("Size of: ", stringify!(filament_backend_CallbackHandler))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_backend_CallbackHandler>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(filament_backend_CallbackHandler)
        )
    );
}
impl Default for filament_backend_CallbackHandler {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament7backend15CallbackHandlerD1Ev"]
    pub fn filament_backend_CallbackHandler_CallbackHandler_destructor(
        this: *mut filament_backend_CallbackHandler,
    );
}
#[doc = " A generic GPU buffer containing data."]
#[doc = ""]
#[doc = " Usage of this BufferObject is optional. For simple use cases it is not necessary. It is useful"]
#[doc = " only when you need to share data between multiple VertexBuffer instances. It also allows you to"]
#[doc = " efficiently swap-out the buffers in VertexBuffer."]
#[doc = ""]
#[doc = " NOTE: For now this is only used for vertex data, but in the future we may use it for other things"]
#[doc = " (e.g. compute)."]
#[doc = ""]
#[doc = " @see VertexBuffer"]
#[repr(C)]
#[derive(Debug, Default)]
pub struct filament_BufferObject {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filament_BufferObject_BuilderDetails {
    _unused: [u8; 0],
}
#[doc = " A CPU memory-buffer descriptor, typically used to transfer data from the CPU to the GPU."]
#[doc = ""]
#[doc = " A BufferDescriptor owns the memory buffer it references, therefore BufferDescriptor cannot"]
#[doc = " be copied, but can be moved."]
#[doc = ""]
#[doc = " BufferDescriptor releases ownership of the memory-buffer when it's destroyed."]
pub type filament_BufferObject_BufferDescriptor = filament_backend_BufferDescriptor;
#[doc = "! Buffer object binding type"]
pub use self::filament_backend_BufferObjectBinding as filament_BufferObject_BindingType;
#[repr(C)]
#[derive(Debug)]
pub struct filament_BufferObject_Builder {
    pub _base: filament_BuilderBase<filament_BufferObject_BuilderDetails>,
}
#[test]
fn bindgen_test_layout_filament_BufferObject_Builder() {
    assert_eq!(
        ::std::mem::size_of::<filament_BufferObject_Builder>(),
        8usize,
        concat!("Size of: ", stringify!(filament_BufferObject_Builder))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_BufferObject_Builder>(),
        8usize,
        concat!("Alignment of ", stringify!(filament_BufferObject_Builder))
    );
}
extern "C" {
    #[doc = " Size of the buffer in bytes."]
    #[doc = " @param byteCount Maximum number of bytes the BufferObject can hold."]
    #[doc = " @return A reference to this Builder for chaining calls."]
    #[link_name = "\u{1}_ZN8filament12BufferObject7Builder4sizeEj"]
    pub fn filament_BufferObject_Builder_size(
        this: *mut filament_BufferObject_Builder,
        byteCount: u32,
    ) -> *mut filament_BufferObject_Builder;
}
extern "C" {
    #[doc = " The binding type for this buffer object. (defaults to VERTEX)"]
    #[doc = " @param BindingType Distinguishes between SSBO, VBO, etc. For now this must be VERTEX."]
    #[doc = " @return A reference to this Builder for chaining calls."]
    #[link_name = "\u{1}_ZN8filament12BufferObject7Builder11bindingTypeENS_7backend19BufferObjectBindingE"]
    pub fn filament_BufferObject_Builder_bindingType(
        this: *mut filament_BufferObject_Builder,
        bindingType: filament_BufferObject_BindingType,
    ) -> *mut filament_BufferObject_Builder;
}
extern "C" {
    #[doc = " Creates the BufferObject and returns a pointer to it. After creation, the buffer"]
    #[doc = " object is uninitialized. Use BufferObject::setBuffer() to initialize it."]
    #[doc = ""]
    #[doc = " @param engine Reference to the filament::Engine to associate this BufferObject with."]
    #[doc = ""]
    #[doc = " @return pointer to the newly created object or nullptr if exceptions are disabled and"]
    #[doc = "         an error occurred."]
    #[doc = ""]
    #[doc = " @exception utils::PostConditionPanic if a runtime error occurred, such as running out of"]
    #[doc = "            memory or other resources."]
    #[doc = " @exception utils::PreConditionPanic if a parameter to a builder function was invalid."]
    #[doc = ""]
    #[doc = " @see IndexBuffer::setBuffer"]
    #[link_name = "\u{1}_ZN8filament12BufferObject7Builder5buildERNS_6EngineE"]
    pub fn filament_BufferObject_Builder_build(
        this: *mut filament_BufferObject_Builder,
        engine: *mut filament_Engine,
    ) -> *mut filament_BufferObject;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament12BufferObject7BuilderC1Ev"]
    pub fn filament_BufferObject_Builder_Builder(this: *mut filament_BufferObject_Builder);
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament12BufferObject7BuilderC1ERKS1_"]
    pub fn filament_BufferObject_Builder_Builder1(
        this: *mut filament_BufferObject_Builder,
        rhs: *const filament_BufferObject_Builder,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament12BufferObject7BuilderC1EOS1_"]
    pub fn filament_BufferObject_Builder_Builder2(
        this: *mut filament_BufferObject_Builder,
        rhs: *mut filament_BufferObject_Builder,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament12BufferObject7BuilderD1Ev"]
    pub fn filament_BufferObject_Builder_Builder_destructor(
        this: *mut filament_BufferObject_Builder,
    );
}
impl Default for filament_BufferObject_Builder {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl filament_BufferObject_Builder {
    #[inline]
    pub unsafe fn size(&mut self, byteCount: u32) -> *mut filament_BufferObject_Builder {
        filament_BufferObject_Builder_size(self, byteCount)
    }
    #[inline]
    pub unsafe fn bindingType(
        &mut self,
        bindingType: filament_BufferObject_BindingType,
    ) -> *mut filament_BufferObject_Builder {
        filament_BufferObject_Builder_bindingType(self, bindingType)
    }
    #[inline]
    pub unsafe fn build(&mut self, engine: *mut filament_Engine) -> *mut filament_BufferObject {
        filament_BufferObject_Builder_build(self, engine)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_BufferObject_Builder_Builder(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(rhs: *const filament_BufferObject_Builder) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_BufferObject_Builder_Builder1(__bindgen_tmp.as_mut_ptr(), rhs);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(rhs: *mut filament_BufferObject_Builder) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_BufferObject_Builder_Builder2(__bindgen_tmp.as_mut_ptr(), rhs);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        filament_BufferObject_Builder_Builder_destructor(self)
    }
}
#[test]
fn bindgen_test_layout_filament_BufferObject() {
    assert_eq!(
        ::std::mem::size_of::<filament_BufferObject>(),
        1usize,
        concat!("Size of: ", stringify!(filament_BufferObject))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_BufferObject>(),
        1usize,
        concat!("Alignment of ", stringify!(filament_BufferObject))
    );
}
extern "C" {
    #[doc = " Asynchronously copy-initializes a region of this BufferObject from the data provided."]
    #[doc = ""]
    #[doc = " @param engine Reference to the filament::Engine associated with this BufferObject."]
    #[doc = " @param buffer A BufferDescriptor representing the data used to initialize the BufferObject."]
    #[doc = " @param byteOffset Offset in bytes into the BufferObject"]
    #[link_name = "\u{1}_ZN8filament12BufferObject9setBufferERNS_6EngineEONS_7backend16BufferDescriptorEj"]
    pub fn filament_BufferObject_setBuffer(
        this: *mut filament_BufferObject,
        engine: *mut filament_Engine,
        buffer: *mut filament_BufferObject_BufferDescriptor,
        byteOffset: u32,
    );
}
extern "C" {
    #[doc = " Returns the size of this BufferObject in elements."]
    #[doc = " @return The maximum capacity of the BufferObject."]
    #[link_name = "\u{1}_ZNK8filament12BufferObject12getByteCountEv"]
    pub fn filament_BufferObject_getByteCount(this: *const filament_BufferObject) -> size_t;
}
impl filament_BufferObject {
    #[inline]
    pub unsafe fn setBuffer(
        &mut self,
        engine: *mut filament_Engine,
        buffer: *mut filament_BufferObject_BufferDescriptor,
        byteOffset: u32,
    ) {
        filament_BufferObject_setBuffer(self, engine, buffer, byteOffset)
    }
    #[inline]
    pub unsafe fn getByteCount(&self) -> size_t {
        filament_BufferObject_getByteCount(self)
    }
}
#[doc = " Camera represents the eye through which the scene is viewed."]
#[doc = ""]
#[doc = " A Camera has a position and orientation and controls the projection and exposure parameters."]
#[doc = ""]
#[doc = " Creation and destruction"]
#[doc = " ========================"]
#[doc = ""]
#[doc = " In Filament, Camera is a component that must be associated with an entity. To do so,"]
#[doc = " use Engine::createCamera(Entity). A Camera component is destroyed using"]
#[doc = " Engine::destroyCameraComponent(Entity)."]
#[doc = ""]
#[doc = " ~~~~~~~~~~~{.cpp}"]
#[doc = "  filament::Engine* engine = filament::Engine::create();"]
#[doc = ""]
#[doc = "  utils::Entity myCameraEntity = utils::EntityManager::get().create();"]
#[doc = "  filament::Camera* myCamera = engine->createCamera(myCameraEntity);"]
#[doc = "  myCamera->setProjection(45, 16.0/9.0, 0.1, 1.0);"]
#[doc = "  myCamera->lookAt({0, 1.60, 1}, {0, 0, 0});"]
#[doc = "  engine->destroyCameraComponent(myCamera);"]
#[doc = " ~~~~~~~~~~~"]
#[doc = ""]
#[doc = ""]
#[doc = " Coordinate system"]
#[doc = " ================="]
#[doc = ""]
#[doc = " The camera coordinate system defines the *view space*. The camera points towards its -z axis"]
#[doc = " and is oriented such that its top side is in the direction of +y, and its right side in the"]
#[doc = " direction of +x."]
#[doc = ""]
#[doc = " @note"]
#[doc = " Since the *near* and *far* planes are defined by the distance from the camera,"]
#[doc = " their respective coordinates are -\\p distance(near) and -\\p distance(far)."]
#[doc = ""]
#[doc = " Clipping planes"]
#[doc = " ==============="]
#[doc = ""]
#[doc = " The camera defines six *clipping planes* which together create a *clipping volume*. The"]
#[doc = " geometry outside this volume is clipped."]
#[doc = ""]
#[doc = " The clipping volume can either be a box or a frustum depending on which projection is used,"]
#[doc = " respectively Projection.ORTHO or Projection.PERSPECTIVE. The six planes are specified either"]
#[doc = " directly or indirectly using setProjection()."]
#[doc = ""]
#[doc = " The six planes are:"]
#[doc = " - left"]
#[doc = " - right"]
#[doc = " - bottom"]
#[doc = " - top"]
#[doc = " - near"]
#[doc = " - far"]
#[doc = ""]
#[doc = " @note"]
#[doc = " To increase the depth-buffer precision, the *far* clipping plane is always assumed to be at"]
#[doc = " infinity for rendering. That is, it is not used to clip geometry during rendering."]
#[doc = " However, it is used during the culling phase (objects entirely behind the *far*"]
#[doc = " plane are culled)."]
#[doc = ""]
#[doc = ""]
#[doc = " Choosing the *near* plane distance"]
#[doc = " =================================="]
#[doc = ""]
#[doc = " The *near* plane distance greatly affects the depth-buffer resolution."]
#[doc = ""]
#[doc = " Example: Precision at 1m, 10m, 100m and 1Km for various near distances assuming a 32-bit float"]
#[doc = " depth-buffer"]
#[doc = ""]
#[doc = "    near (m)  |   1 m  |   10 m  |  100 m   |  1 Km"]
#[doc = "  -----------:|:------:|:-------:|:--------:|:--------:"]
#[doc = "      0.001   | 7.2e-5 |  0.0043 |  0.4624  |  48.58"]
#[doc = "      0.01    | 6.9e-6 |  0.0001 |  0.0430  |   4.62"]
#[doc = "      0.1     | 3.6e-7 |  7.0e-5 |  0.0072  |   0.43"]
#[doc = "      1.0     |    0   |  3.8e-6 |  0.0007  |   0.07"]
#[doc = ""]
#[doc = ""]
#[doc = "  As can be seen in the table above, the depth-buffer precision drops rapidly with the"]
#[doc = "  distance to the camera."]
#[doc = " Make sure to pick the highest *near* plane distance possible."]
#[doc = ""]
#[doc = ""]
#[doc = " Exposure"]
#[doc = " ========"]
#[doc = ""]
#[doc = " The Camera is also used to set the scene's exposure, just like with a real camera. The lights"]
#[doc = " intensity and the Camera exposure interact to produce the final scene's brightness."]
#[doc = ""]
#[doc = ""]
#[doc = ""]
#[doc = " \\see Frustum, View"]
#[repr(C)]
#[derive(Debug, Default)]
pub struct filament_Camera {
    pub _address: u8,
}
#[doc = "!< perspective projection, objects get smaller as they are farther"]
pub const filament_Camera_Projection_PERSPECTIVE: filament_Camera_Projection = 0;
#[doc = "!< orthonormal projection, preserves distances"]
pub const filament_Camera_Projection_ORTHO: filament_Camera_Projection = 1;
#[doc = "! Denotes the projection type used by this camera. \\see setProjection"]
pub type filament_Camera_Projection = ::std::os::raw::c_int;
#[doc = "!< the field-of-view angle is defined on the vertical axis"]
pub const filament_Camera_Fov_VERTICAL: filament_Camera_Fov = 0;
#[doc = "!< the field-of-view angle is defined on the horizontal axis"]
pub const filament_Camera_Fov_HORIZONTAL: filament_Camera_Fov = 1;
#[doc = "! Denotes a field-of-view direction. \\see setProjection"]
pub type filament_Camera_Fov = ::std::os::raw::c_int;
#[test]
fn bindgen_test_layout_filament_Camera() {
    assert_eq!(
        ::std::mem::size_of::<filament_Camera>(),
        1usize,
        concat!("Size of: ", stringify!(filament_Camera))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_Camera>(),
        1usize,
        concat!("Alignment of ", stringify!(filament_Camera))
    );
}
extern "C" {
    #[doc = " Sets the projection matrix from a frustum defined by six planes."]
    #[doc = ""]
    #[doc = " @param projection    type of #Projection to use."]
    #[doc = ""]
    #[doc = " @param left      distance in world units from the camera to the left plane,"]
    #[doc = "                  at the near plane."]
    #[doc = "                  Precondition: \\p left != \\p right."]
    #[doc = ""]
    #[doc = " @param right     distance in world units from the camera to the right plane,"]
    #[doc = "                  at the near plane."]
    #[doc = "                  Precondition: \\p left != \\p right."]
    #[doc = ""]
    #[doc = " @param bottom    distance in world units from the camera to the bottom plane,"]
    #[doc = "                  at the near plane."]
    #[doc = "                  Precondition: \\p bottom != \\p top."]
    #[doc = ""]
    #[doc = " @param top       distance in world units from the camera to the top plane,"]
    #[doc = "                  at the near plane."]
    #[doc = "                  Precondition: \\p left != \\p right."]
    #[doc = ""]
    #[doc = " @param near      distance in world units from the camera to the near plane. The near plane's"]
    #[doc = "                  position in view space is z = -\\p near."]
    #[doc = "                  Precondition: \\p near > 0 for PROJECTION::PERSPECTIVE or"]
    #[doc = "                                \\p near != far for PROJECTION::ORTHO"]
    #[doc = ""]
    #[doc = " @param far       distance in world units from the camera to the far plane. The far plane's"]
    #[doc = "                  position in view space is z = -\\p far."]
    #[doc = "                  Precondition: \\p far > near for PROJECTION::PERSPECTIVE or"]
    #[doc = "                                \\p far != near for PROJECTION::ORTHO"]
    #[doc = ""]
    #[doc = " @attention these parameters are silently modified to meet the preconditions above."]
    #[doc = ""]
    #[doc = " @see Projection, Frustum"]
    #[link_name = "\u{1}_ZN8filament6Camera13setProjectionENS0_10ProjectionEdddddd"]
    pub fn filament_Camera_setProjection(
        this: *mut filament_Camera,
        projection: filament_Camera_Projection,
        left: f64,
        right: f64,
        bottom: f64,
        top: f64,
        near: f64,
        far: f64,
    );
}
extern "C" {
    #[doc = " Sets the projection matrix from the field-of-view."]
    #[doc = ""]
    #[doc = " @param fovInDegrees full field-of-view in degrees. 0 < \\p fov < 180."]
    #[doc = " @param aspect       aspect ratio \\f$ \\frac{width}{height} \\f$. \\p aspect > 0."]
    #[doc = " @param near         distance in world units from the camera to the near plane. \\p near > 0."]
    #[doc = " @param far          distance in world units from the camera to the far plane. \\p far > \\p near."]
    #[doc = " @param direction    direction of the \\p fovInDegrees parameter."]
    #[doc = ""]
    #[doc = " @see Fov."]
    #[link_name = "\u{1}_ZN8filament6Camera13setProjectionEddddNS0_3FovE"]
    pub fn filament_Camera_setProjection1(
        this: *mut filament_Camera,
        fovInDegrees: f64,
        aspect: f64,
        near: f64,
        far: f64,
        direction: filament_Camera_Fov,
    );
}
extern "C" {
    #[doc = " Sets the projection matrix from the focal length."]
    #[doc = ""]
    #[doc = " @param focalLengthInMillimeters lens's focal length in millimeters. \\p focalLength > 0."]
    #[doc = " @param aspect      aspect ratio \\f$ \\frac{width}{height} \\f$. \\p aspect > 0."]
    #[doc = " @param near        distance in world units from the camera to the near plane. \\p near > 0."]
    #[doc = " @param far         distance in world units from the camera to the far plane. \\p far > \\p near."]
    #[link_name = "\u{1}_ZN8filament6Camera17setLensProjectionEdddd"]
    pub fn filament_Camera_setLensProjection(
        this: *mut filament_Camera,
        focalLengthInMillimeters: f64,
        aspect: f64,
        near: f64,
        far: f64,
    );
}
extern "C" {
    #[doc = " Sets a custom projection matrix."]
    #[doc = ""]
    #[doc = " The projection matrix must be of one of the following form:"]
    #[doc = "       a 0 tx 0              a 0 0 tx"]
    #[doc = "       0 b ty 0              0 b 0 ty"]
    #[doc = "       0 0 tz c              0 0 c tz"]
    #[doc = "       0 0 -1 0              0 0 0 1"]
    #[doc = ""]
    #[doc = " The projection matrix must define an NDC system that must match the OpenGL convention,"]
    #[doc = " that is all 3 axis are mapped to [-1, 1]."]
    #[doc = ""]
    #[doc = " @param projection  custom projection matrix used for rendering and culling"]
    #[doc = " @param near        distance in world units from the camera to the near plane. \\p near > 0."]
    #[doc = " @param far         distance in world units from the camera to the far plane. \\p far > \\p near."]
    #[link_name = "\u{1}_ZN8filament6Camera19setCustomProjectionERKNS_4math7details6TMat44IdEEdd"]
    pub fn filament_Camera_setCustomProjection(
        this: *mut filament_Camera,
        projection: *const filament_math_mat4,
        near: f64,
        far: f64,
    );
}
extern "C" {
    #[doc = " Sets the projection matrix."]
    #[doc = ""]
    #[doc = " The projection matrices must be of one of the following form:"]
    #[doc = "       a 0 tx 0              a 0 0 tx"]
    #[doc = "       0 b ty 0              0 b 0 ty"]
    #[doc = "       0 0 tz c              0 0 c tz"]
    #[doc = "       0 0 -1 0              0 0 0 1"]
    #[doc = ""]
    #[doc = " The projection matrices must define an NDC system that must match the OpenGL convention,"]
    #[doc = " that is all 3 axis are mapped to [-1, 1]."]
    #[doc = ""]
    #[doc = " @param projection  custom projection matrix used for rendering"]
    #[doc = " @param projectionForCulling  custom projection matrix used for culling"]
    #[doc = " @param near        distance in world units from the camera to the near plane. \\p near > 0."]
    #[doc = " @param far         distance in world units from the camera to the far plane. \\p far > \\p near."]
    #[link_name = "\u{1}_ZN8filament6Camera19setCustomProjectionERKNS_4math7details6TMat44IdEES6_dd"]
    pub fn filament_Camera_setCustomProjection1(
        this: *mut filament_Camera,
        projection: *const filament_math_mat4,
        projectionForCulling: *const filament_math_mat4,
        near: f64,
        far: f64,
    );
}
extern "C" {
    #[doc = " Sets an additional matrix that scales the projection matrix."]
    #[doc = ""]
    #[doc = " This is useful to adjust the aspect ratio of the camera independent from its projection."]
    #[doc = " First, pass an aspect of 1.0 to setProjection. Then set the scaling with the desired aspect"]
    #[doc = " ratio:"]
    #[doc = ""]
    #[doc = "     const double aspect = width / height;"]
    #[doc = ""]
    #[doc = "     // with Fov::HORIZONTAL passed to setProjection:"]
    #[doc = "     camera->setScaling(double4 {1.0, aspect});"]
    #[doc = ""]
    #[doc = "     // with Fov::VERTICAL passed to setProjection:"]
    #[doc = "     camera->setScaling(double4 {1.0 / aspect, 1.0});"]
    #[doc = ""]
    #[doc = ""]
    #[doc = " By default, this is an identity matrix."]
    #[doc = ""]
    #[doc = " @param scaling     diagonal of the 2x2 scaling matrix to be applied after the projection matrix."]
    #[doc = ""]
    #[doc = " @see setProjection, setLensProjection, setCustomProjection"]
    #[link_name = "\u{1}_ZN8filament6Camera10setScalingENS_4math7details5TVec2IdEE"]
    pub fn filament_Camera_setScaling(this: *mut filament_Camera, scaling: filament_math_double2);
}
extern "C" {
    #[doc = " Sets an additional matrix that shifts the projection matrix."]
    #[doc = " By default, this is an identity matrix."]
    #[doc = ""]
    #[doc = " @param shift     x and y translation added to the projection matrix, specified in NDC"]
    #[doc = "                  coordinates, that is, if the translation must be specified in pixels,"]
    #[doc = "                  shift must be scaled by 1.0 / { viewport.width, viewport.height }."]
    #[doc = ""]
    #[doc = " @see setProjection, setLensProjection, setCustomProjection"]
    #[link_name = "\u{1}_ZN8filament6Camera8setShiftENS_4math7details5TVec2IdEE"]
    pub fn filament_Camera_setShift(this: *mut filament_Camera, shift: filament_math_double2);
}
extern "C" {
    #[doc = " Returns the scaling amount used to scale the projection matrix."]
    #[doc = ""]
    #[doc = " @return the diagonal of the scaling matrix applied after the projection matrix."]
    #[doc = ""]
    #[doc = " @see setScaling"]
    #[link_name = "\u{1}_ZNK8filament6Camera10getScalingEv"]
    pub fn filament_Camera_getScaling(this: *const filament_Camera) -> filament_math_double4;
}
extern "C" {
    #[doc = " Returns the shift amount used to translate the projection matrix."]
    #[doc = ""]
    #[doc = " @return the 2D translation x and y offsets applied after the projection matrix."]
    #[doc = ""]
    #[doc = " @see setShift"]
    #[link_name = "\u{1}_ZNK8filament6Camera8getShiftEv"]
    pub fn filament_Camera_getShift(this: *const filament_Camera) -> filament_math_double2;
}
extern "C" {
    #[doc = " Returns the projection matrix used for rendering."]
    #[doc = ""]
    #[doc = " The projection matrix used for rendering always has its far plane set to infinity. This"]
    #[doc = " is why it may differ from the matrix set through setProjection() or setLensProjection()."]
    #[doc = ""]
    #[doc = " @return The projection matrix used for rendering"]
    #[doc = ""]
    #[doc = " @see setProjection, setLensProjection, setCustomProjection, getCullingProjectionMatrix"]
    #[link_name = "\u{1}_ZNK8filament6Camera19getProjectionMatrixEv"]
    pub fn filament_Camera_getProjectionMatrix(this: *const filament_Camera) -> filament_math_mat4;
}
extern "C" {
    #[doc = " Returns the projection matrix used for culling (far plane is finite)."]
    #[doc = ""]
    #[doc = " @return The projection matrix set by setProjection or setLensProjection."]
    #[doc = ""]
    #[doc = " @see setProjection, setLensProjection, getProjectionMatrix"]
    #[link_name = "\u{1}_ZNK8filament6Camera26getCullingProjectionMatrixEv"]
    pub fn filament_Camera_getCullingProjectionMatrix(
        this: *const filament_Camera,
    ) -> filament_math_mat4;
}
extern "C" {
    #[doc = "! Returns the frustum's near plane"]
    #[link_name = "\u{1}_ZNK8filament6Camera7getNearEv"]
    pub fn filament_Camera_getNear(this: *const filament_Camera) -> f32;
}
extern "C" {
    #[doc = "! Returns the frustum's far plane used for culling"]
    #[link_name = "\u{1}_ZNK8filament6Camera13getCullingFarEv"]
    pub fn filament_Camera_getCullingFar(this: *const filament_Camera) -> f32;
}
extern "C" {
    #[doc = " Sets the camera's view matrix."]
    #[doc = ""]
    #[doc = " Helper method to set the camera's entity transform component."]
    #[doc = " It has the same effect as calling:"]
    #[doc = ""]
    #[doc = " ~~~~~~~~~~~{.cpp}"]
    #[doc = "  engine.getTransformManager().setTransform("]
    #[doc = "          engine.getTransformManager().getInstance(camera->getEntity()), view);"]
    #[doc = " ~~~~~~~~~~~"]
    #[doc = ""]
    #[doc = " @param view The camera position and orientation provided as a rigid transform matrix."]
    #[doc = ""]
    #[doc = " @note The Camera \"looks\" towards its -z axis"]
    #[doc = ""]
    #[doc = " @warning \\p view must be a rigid transform"]
    #[link_name = "\u{1}_ZN8filament6Camera14setModelMatrixERKNS_4math7details6TMat44IdEE"]
    pub fn filament_Camera_setModelMatrix(
        this: *mut filament_Camera,
        view: *const filament_math_mat4,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Camera14setModelMatrixERKNS_4math7details6TMat44IfEE"]
    pub fn filament_Camera_setModelMatrix1(
        this: *mut filament_Camera,
        view: *const filament_math_mat4f,
    );
}
extern "C" {
    #[doc = " Sets the camera's view matrix"]
    #[doc = ""]
    #[doc = " @param eye       The position of the camera in world space."]
    #[doc = " @param center    The point in world space the camera is looking at."]
    #[doc = " @param up        A unit vector denoting the camera's \"up\" direction."]
    #[link_name = "\u{1}_ZN8filament6Camera6lookAtERKNS_4math7details5TVec3IfEES6_S6_"]
    pub fn filament_Camera_lookAt(
        this: *mut filament_Camera,
        eye: *const filament_math_float3,
        center: *const filament_math_float3,
        up: *const filament_math_float3,
    );
}
extern "C" {
    #[doc = " Sets the camera's view matrix, assuming up is along the y axis"]
    #[doc = ""]
    #[doc = " @param eye       The position of the camera in world space."]
    #[doc = " @param center    The point in world space the camera is looking at."]
    #[link_name = "\u{1}_ZN8filament6Camera6lookAtERKNS_4math7details5TVec3IfEES6_"]
    pub fn filament_Camera_lookAt1(
        this: *mut filament_Camera,
        eye: *const filament_math_float3,
        center: *const filament_math_float3,
    );
}
extern "C" {
    #[doc = " Returns the camera's model matrix"]
    #[doc = ""]
    #[doc = " Helper method to return the camera's entity transform component."]
    #[doc = " It has the same effect as calling:"]
    #[doc = ""]
    #[doc = " ~~~~~~~~~~~{.cpp}"]
    #[doc = "  engine.getTransformManager().getWorldTransform("]
    #[doc = "          engine.getTransformManager().getInstance(camera->getEntity()));"]
    #[doc = " ~~~~~~~~~~~"]
    #[doc = ""]
    #[doc = " @return The camera's pose in world space as a rigid transform. Parent transforms, if any,"]
    #[doc = " are taken into account."]
    #[link_name = "\u{1}_ZNK8filament6Camera14getModelMatrixEv"]
    pub fn filament_Camera_getModelMatrix(this: *const filament_Camera) -> filament_math_mat4;
}
extern "C" {
    #[doc = "! Returns the camera's view matrix (inverse of the model matrix)"]
    #[link_name = "\u{1}_ZNK8filament6Camera13getViewMatrixEv"]
    pub fn filament_Camera_getViewMatrix(this: *const filament_Camera) -> filament_math_mat4;
}
extern "C" {
    #[doc = "! Returns the camera's position in world space"]
    #[link_name = "\u{1}_ZNK8filament6Camera11getPositionEv"]
    pub fn filament_Camera_getPosition(this: *const filament_Camera) -> filament_math_float3;
}
extern "C" {
    #[doc = "! Returns the camera's normalized left vector"]
    #[link_name = "\u{1}_ZNK8filament6Camera13getLeftVectorEv"]
    pub fn filament_Camera_getLeftVector(this: *const filament_Camera) -> filament_math_float3;
}
extern "C" {
    #[doc = "! Returns the camera's normalized up vector"]
    #[link_name = "\u{1}_ZNK8filament6Camera11getUpVectorEv"]
    pub fn filament_Camera_getUpVector(this: *const filament_Camera) -> filament_math_float3;
}
extern "C" {
    #[doc = "! Returns the camera's forward vector"]
    #[link_name = "\u{1}_ZNK8filament6Camera16getForwardVectorEv"]
    pub fn filament_Camera_getForwardVector(this: *const filament_Camera) -> filament_math_float3;
}
extern "C" {
    #[doc = "! Returns the camera's field of view in degrees"]
    #[link_name = "\u{1}_ZNK8filament6Camera23getFieldOfViewInDegreesENS0_3FovE"]
    pub fn filament_Camera_getFieldOfViewInDegrees(
        this: *const filament_Camera,
        direction: filament_Camera_Fov,
    ) -> f32;
}
extern "C" {
    #[doc = "! Returns the camera's culling Frustum in world space"]
    #[link_name = "\u{1}_ZNK8filament6Camera10getFrustumEv"]
    pub fn filament_Camera_getFrustum(this: *const filament_Camera) -> filament_Frustum;
}
extern "C" {
    #[doc = "! Returns the entity representing this camera"]
    #[link_name = "\u{1}_ZNK8filament6Camera9getEntityEv"]
    pub fn filament_Camera_getEntity(this: *const filament_Camera) -> utils_Entity;
}
extern "C" {
    #[doc = " Sets this camera's exposure (default is f/16, 1/125s, 100 ISO)"]
    #[doc = ""]
    #[doc = " The exposure ultimately controls the scene's brightness, just like with a real camera."]
    #[doc = " The default values provide adequate exposure for a camera placed outdoors on a sunny day"]
    #[doc = " with the sun at the zenith."]
    #[doc = ""]
    #[doc = " @param aperture      Aperture in f-stops, clamped between 0.5 and 64."]
    #[doc = "                      A lower \\p aperture value *increases* the exposure, leading to"]
    #[doc = "                      a brighter scene. Realistic values are between 0.95 and 32."]
    #[doc = ""]
    #[doc = " @param shutterSpeed  Shutter speed in seconds, clamped between 1/25,000 and 60."]
    #[doc = "                      A lower shutter speed increases the exposure. Realistic values are"]
    #[doc = "                      between 1/8000 and 30."]
    #[doc = ""]
    #[doc = " @param sensitivity   Sensitivity in ISO, clamped between 10 and 204,800."]
    #[doc = "                      A higher \\p sensitivity increases the exposure. Realistic values are"]
    #[doc = "                      between 50 and 25600."]
    #[doc = ""]
    #[doc = " @note"]
    #[doc = " With the default parameters, the scene must contain at least one Light of intensity"]
    #[doc = " similar to the sun (e.g.: a 100,000 lux directional light)."]
    #[doc = ""]
    #[doc = " @see LightManager, Exposure"]
    #[link_name = "\u{1}_ZN8filament6Camera11setExposureEfff"]
    pub fn filament_Camera_setExposure(
        this: *mut filament_Camera,
        aperture: f32,
        shutterSpeed: f32,
        sensitivity: f32,
    );
}
extern "C" {
    #[doc = "! returns this camera's aperture in f-stops"]
    #[link_name = "\u{1}_ZNK8filament6Camera11getApertureEv"]
    pub fn filament_Camera_getAperture(this: *const filament_Camera) -> f32;
}
extern "C" {
    #[doc = "! returns this camera's shutter speed in seconds"]
    #[link_name = "\u{1}_ZNK8filament6Camera15getShutterSpeedEv"]
    pub fn filament_Camera_getShutterSpeed(this: *const filament_Camera) -> f32;
}
extern "C" {
    #[doc = "! returns this camera's sensitivity in ISO"]
    #[link_name = "\u{1}_ZNK8filament6Camera14getSensitivityEv"]
    pub fn filament_Camera_getSensitivity(this: *const filament_Camera) -> f32;
}
extern "C" {
    #[doc = "! returns the focal length in meters [m] for a 35mm camera"]
    #[link_name = "\u{1}_ZNK8filament6Camera14getFocalLengthEv"]
    pub fn filament_Camera_getFocalLength(this: *const filament_Camera) -> f64;
}
extern "C" {
    #[doc = " Sets the camera focus distance. This is used by the Depth-of-field PostProcessing effect."]
    #[doc = " @param distance Distance from the camera to the plane of focus in world units."]
    #[doc = "                 Must be positive and larger than the near clipping plane."]
    #[link_name = "\u{1}_ZN8filament6Camera16setFocusDistanceEf"]
    pub fn filament_Camera_setFocusDistance(this: *mut filament_Camera, distance: f32);
}
extern "C" {
    #[doc = "! Returns the focus distance in world units"]
    #[link_name = "\u{1}_ZNK8filament6Camera16getFocusDistanceEv"]
    pub fn filament_Camera_getFocusDistance(this: *const filament_Camera) -> f32;
}
extern "C" {
    #[doc = " Returns the inverse of a projection matrix."]
    #[doc = ""]
    #[doc = " \\param p the projection matrix to inverse"]
    #[doc = " \\returns the inverse of the projection matrix \\p p"]
    #[doc = ""]
    #[doc = " \\warning the projection matrix to invert must have one of the form below:"]
    #[doc = " - perspective projection"]
    #[doc = ""]
    #[doc = "      \\f$"]
    #[doc = "      \\left("]
    #[doc = "      \\begin{array}{cccc}"]
    #[doc = "      a & 0 & tx & 0 \\\\"]
    #[doc = "      0 & b & ty & 0 \\\\"]
    #[doc = "      0 & 0 & tz & c \\\\"]
    #[doc = "      0 & 0 & -1 & 0 \\\\"]
    #[doc = "      \\end{array}"]
    #[doc = "      \\right)"]
    #[doc = "      \\f$"]
    #[doc = ""]
    #[doc = " - orthographic projection"]
    #[doc = ""]
    #[doc = "      \\f$"]
    #[doc = "      \\left("]
    #[doc = "      \\begin{array}{cccc}"]
    #[doc = "      a & 0 & 0 & tx \\\\"]
    #[doc = "      0 & b & 0 & ty \\\\"]
    #[doc = "      0 & 0 & c & tz \\\\"]
    #[doc = "      0 & 0 & 0 & 1  \\\\"]
    #[doc = "      \\end{array}"]
    #[doc = "      \\right)"]
    #[doc = "      \\f$"]
    #[link_name = "\u{1}_ZN8filament6Camera17inverseProjectionERKNS_4math7details6TMat44IdEE"]
    pub fn filament_Camera_inverseProjection(p: *const filament_math_mat4) -> filament_math_mat4;
}
extern "C" {
    #[doc = " Returns the inverse of a projection matrix."]
    #[doc = " @see inverseProjection(const math::mat4&)"]
    #[link_name = "\u{1}_ZN8filament6Camera17inverseProjectionERKNS_4math7details6TMat44IfEE"]
    pub fn filament_Camera_inverseProjection1(p: *const filament_math_mat4f)
        -> filament_math_mat4f;
}
extern "C" {
    #[doc = " Helper to compute the effective focal length taking into account the focus distance"]
    #[doc = ""]
    #[doc = " @param focalLength       focal length in any unit (e.g. [m] or [mm])"]
    #[doc = " @param focusDistance     focus distance in same unit as focalLength"]
    #[doc = " @return                  the effective focal length in same unit as focalLength"]
    #[link_name = "\u{1}_ZN8filament6Camera27computeEffectiveFocalLengthEdd"]
    pub fn filament_Camera_computeEffectiveFocalLength(focalLength: f64, focusDistance: f64)
        -> f64;
}
extern "C" {
    #[doc = " Helper to compute the effective field-of-view taking into account the focus distance"]
    #[doc = ""]
    #[doc = " @param fovInDegrees      full field of view in degrees"]
    #[doc = " @param focusDistance     focus distance in meters [m]"]
    #[doc = " @return                  effective full field of view in degrees"]
    #[link_name = "\u{1}_ZN8filament6Camera19computeEffectiveFovEdd"]
    pub fn filament_Camera_computeEffectiveFov(fovInDegrees: f64, focusDistance: f64) -> f64;
}
impl filament_Camera {
    #[inline]
    pub unsafe fn setProjection(
        &mut self,
        projection: filament_Camera_Projection,
        left: f64,
        right: f64,
        bottom: f64,
        top: f64,
        near: f64,
        far: f64,
    ) {
        filament_Camera_setProjection(self, projection, left, right, bottom, top, near, far)
    }
    #[inline]
    pub unsafe fn setProjection1(
        &mut self,
        fovInDegrees: f64,
        aspect: f64,
        near: f64,
        far: f64,
        direction: filament_Camera_Fov,
    ) {
        filament_Camera_setProjection1(self, fovInDegrees, aspect, near, far, direction)
    }
    #[inline]
    pub unsafe fn setLensProjection(
        &mut self,
        focalLengthInMillimeters: f64,
        aspect: f64,
        near: f64,
        far: f64,
    ) {
        filament_Camera_setLensProjection(self, focalLengthInMillimeters, aspect, near, far)
    }
    #[inline]
    pub unsafe fn setCustomProjection(
        &mut self,
        projection: *const filament_math_mat4,
        near: f64,
        far: f64,
    ) {
        filament_Camera_setCustomProjection(self, projection, near, far)
    }
    #[inline]
    pub unsafe fn setCustomProjection1(
        &mut self,
        projection: *const filament_math_mat4,
        projectionForCulling: *const filament_math_mat4,
        near: f64,
        far: f64,
    ) {
        filament_Camera_setCustomProjection1(self, projection, projectionForCulling, near, far)
    }
    #[inline]
    pub unsafe fn setScaling(&mut self, scaling: filament_math_double2) {
        filament_Camera_setScaling(self, scaling)
    }
    #[inline]
    pub unsafe fn setShift(&mut self, shift: filament_math_double2) {
        filament_Camera_setShift(self, shift)
    }
    #[inline]
    pub unsafe fn getScaling(&self) -> filament_math_double4 {
        filament_Camera_getScaling(self)
    }
    #[inline]
    pub unsafe fn getShift(&self) -> filament_math_double2 {
        filament_Camera_getShift(self)
    }
    #[inline]
    pub unsafe fn getProjectionMatrix(&self) -> filament_math_mat4 {
        filament_Camera_getProjectionMatrix(self)
    }
    #[inline]
    pub unsafe fn getCullingProjectionMatrix(&self) -> filament_math_mat4 {
        filament_Camera_getCullingProjectionMatrix(self)
    }
    #[inline]
    pub unsafe fn getNear(&self) -> f32 {
        filament_Camera_getNear(self)
    }
    #[inline]
    pub unsafe fn getCullingFar(&self) -> f32 {
        filament_Camera_getCullingFar(self)
    }
    #[inline]
    pub unsafe fn setModelMatrix(&mut self, view: *const filament_math_mat4) {
        filament_Camera_setModelMatrix(self, view)
    }
    #[inline]
    pub unsafe fn setModelMatrix1(&mut self, view: *const filament_math_mat4f) {
        filament_Camera_setModelMatrix1(self, view)
    }
    #[inline]
    pub unsafe fn lookAt(
        &mut self,
        eye: *const filament_math_float3,
        center: *const filament_math_float3,
        up: *const filament_math_float3,
    ) {
        filament_Camera_lookAt(self, eye, center, up)
    }
    #[inline]
    pub unsafe fn lookAt1(
        &mut self,
        eye: *const filament_math_float3,
        center: *const filament_math_float3,
    ) {
        filament_Camera_lookAt1(self, eye, center)
    }
    #[inline]
    pub unsafe fn getModelMatrix(&self) -> filament_math_mat4 {
        filament_Camera_getModelMatrix(self)
    }
    #[inline]
    pub unsafe fn getViewMatrix(&self) -> filament_math_mat4 {
        filament_Camera_getViewMatrix(self)
    }
    #[inline]
    pub unsafe fn getPosition(&self) -> filament_math_float3 {
        filament_Camera_getPosition(self)
    }
    #[inline]
    pub unsafe fn getLeftVector(&self) -> filament_math_float3 {
        filament_Camera_getLeftVector(self)
    }
    #[inline]
    pub unsafe fn getUpVector(&self) -> filament_math_float3 {
        filament_Camera_getUpVector(self)
    }
    #[inline]
    pub unsafe fn getForwardVector(&self) -> filament_math_float3 {
        filament_Camera_getForwardVector(self)
    }
    #[inline]
    pub unsafe fn getFieldOfViewInDegrees(&self, direction: filament_Camera_Fov) -> f32 {
        filament_Camera_getFieldOfViewInDegrees(self, direction)
    }
    #[inline]
    pub unsafe fn getFrustum(&self) -> filament_Frustum {
        filament_Camera_getFrustum(self)
    }
    #[inline]
    pub unsafe fn getEntity(&self) -> utils_Entity {
        filament_Camera_getEntity(self)
    }
    #[inline]
    pub unsafe fn setExposure(&mut self, aperture: f32, shutterSpeed: f32, sensitivity: f32) {
        filament_Camera_setExposure(self, aperture, shutterSpeed, sensitivity)
    }
    #[inline]
    pub unsafe fn getAperture(&self) -> f32 {
        filament_Camera_getAperture(self)
    }
    #[inline]
    pub unsafe fn getShutterSpeed(&self) -> f32 {
        filament_Camera_getShutterSpeed(self)
    }
    #[inline]
    pub unsafe fn getSensitivity(&self) -> f32 {
        filament_Camera_getSensitivity(self)
    }
    #[inline]
    pub unsafe fn getFocalLength(&self) -> f64 {
        filament_Camera_getFocalLength(self)
    }
    #[inline]
    pub unsafe fn setFocusDistance(&mut self, distance: f32) {
        filament_Camera_setFocusDistance(self, distance)
    }
    #[inline]
    pub unsafe fn getFocusDistance(&self) -> f32 {
        filament_Camera_getFocusDistance(self)
    }
    #[inline]
    pub unsafe fn inverseProjection(p: *const filament_math_mat4) -> filament_math_mat4 {
        filament_Camera_inverseProjection(p)
    }
    #[inline]
    pub unsafe fn inverseProjection1(p: *const filament_math_mat4f) -> filament_math_mat4f {
        filament_Camera_inverseProjection1(p)
    }
    #[inline]
    pub unsafe fn computeEffectiveFocalLength(focalLength: f64, focusDistance: f64) -> f64 {
        filament_Camera_computeEffectiveFocalLength(focalLength, focusDistance)
    }
    #[inline]
    pub unsafe fn computeEffectiveFov(fovInDegrees: f64, focusDistance: f64) -> f64 {
        filament_Camera_computeEffectiveFov(fovInDegrees, focusDistance)
    }
}
#[repr(C)]
pub struct filament_ToneMapper__bindgen_vtable(::std::os::raw::c_void);
#[doc = " Interface for tone mapping operators. A tone mapping operator, or tone mapper,"]
#[doc = " is responsible for compressing the dynamic range of the rendered scene to a"]
#[doc = " dynamic range suitable for display."]
#[doc = ""]
#[doc = " In Filament, tone mapping is a color grading step. ToneMapper instances are"]
#[doc = " created and passed to the ColorGrading::Builder to produce a 3D LUT that will"]
#[doc = " be used during post-processing to prepare the final color buffer for display."]
#[doc = ""]
#[doc = " Filament provides several default tone mapping operators that fall into three"]
#[doc = " categories:"]
#[doc = ""]
#[doc = " - Configurable tone mapping operators"]
#[doc = "   - GenericToneMapper"]
#[doc = " - Fixed-aesthetic tone mapping operators"]
#[doc = "   - ACESToneMapper"]
#[doc = "   - ACESLegacyToneMapper"]
#[doc = "   - FilmicToneMapper"]
#[doc = " - Debug/validation tone mapping operators"]
#[doc = "   - LinearToneMapper"]
#[doc = "   - DisplayRangeToneMapper"]
#[doc = ""]
#[doc = " You can create custom tone mapping operators by subclassing ToneMapper."]
#[repr(C)]
#[derive(Debug)]
pub struct filament_ToneMapper {
    pub vtable_: *const filament_ToneMapper__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_filament_ToneMapper() {
    assert_eq!(
        ::std::mem::size_of::<filament_ToneMapper>(),
        8usize,
        concat!("Size of: ", stringify!(filament_ToneMapper))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_ToneMapper>(),
        8usize,
        concat!("Alignment of ", stringify!(filament_ToneMapper))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament10ToneMapperC2Ev"]
    pub fn filament_ToneMapper_ToneMapper(this: *mut filament_ToneMapper);
}
impl Default for filament_ToneMapper {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl filament_ToneMapper {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_ToneMapper_ToneMapper(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament10ToneMapperD1Ev"]
    pub fn filament_ToneMapper_ToneMapper_destructor(this: *mut filament_ToneMapper);
}
#[doc = " ColorGrading is used to transform (either to modify or correct) the colors of the HDR buffer"]
#[doc = " rendered by Filament. Color grading transforms are applied after lighting, and after any lens"]
#[doc = " effects (bloom for instance), and include tone mapping."]
#[doc = ""]
#[doc = " Creation, usage and destruction"]
#[doc = " ==============================="]
#[doc = ""]
#[doc = " A ColorGrading object is created using the ColorGrading::Builder and destroyed by calling"]
#[doc = " Engine::destroy(const ColorGrading*). A ColorGrading object is meant to be set on a View."]
#[doc = ""]
#[doc = " ~~~~~~~~~~~{.cpp}"]
#[doc = "  filament::Engine* engine = filament::Engine::create();"]
#[doc = ""]
#[doc = "  filament::ColorGrading* colorGrading = filament::ColorGrading::Builder()"]
#[doc = "              .toneMapping(filament::ColorGrading::ToneMapping::ACES)"]
#[doc = "              .build(*engine);"]
#[doc = ""]
#[doc = "  myView->setColorGrading(colorGrading);"]
#[doc = ""]
#[doc = "  engine->destroy(colorGrading);"]
#[doc = " ~~~~~~~~~~~"]
#[doc = ""]
#[doc = " Performance"]
#[doc = " ==========="]
#[doc = ""]
#[doc = " Creating a new ColorGrading object may be more expensive than other Filament objects as a"]
#[doc = " 3D LUT may need to be generated. The generation of a 3D LUT, if necessary, may happen on"]
#[doc = " the CPU."]
#[doc = ""]
#[doc = " Ordering"]
#[doc = " ========"]
#[doc = ""]
#[doc = " The various transforms held by ColorGrading are applied in the following order:"]
#[doc = " - Exposure"]
#[doc = " - Night adaptation"]
#[doc = " - White balance"]
#[doc = " - Channel mixer"]
#[doc = " - Shadows/mid-tones/highlights"]
#[doc = " - Slope/offset/power (CDL)"]
#[doc = " - Contrast"]
#[doc = " - Vibrance"]
#[doc = " - Saturation"]
#[doc = " - Curves"]
#[doc = " - Tone mapping"]
#[doc = " - Luminance scaling"]
#[doc = " - Gamut mapping"]
#[doc = ""]
#[doc = " Defaults"]
#[doc = " ========"]
#[doc = ""]
#[doc = " Here are the default color grading options:"]
#[doc = " - Exposure: 0.0"]
#[doc = " - Night adaptation: 0.0"]
#[doc = " - White balance: temperature 0, and tint 0"]
#[doc = " - Channel mixer: red {1,0,0}, green {0,1,0}, blue {0,0,1}"]
#[doc = " - Shadows/mid-tones/highlights: shadows {1,1,1,0}, mid-tones {1,1,1,0}, highlights {1,1,1,0},"]
#[doc = "   ranges {0,0.333,0.550,1}"]
#[doc = " - Slope/offset/power: slope 1.0, offset 0.0, and power 1.0"]
#[doc = " - Contrast: 1.0"]
#[doc = " - Vibrance: 1.0"]
#[doc = " - Saturation: 1.0"]
#[doc = " - Curves: gamma {1,1,1}, midPoint {1,1,1}, and scale {1,1,1}"]
#[doc = " - Tone mapping: ACESLegacyToneMapper"]
#[doc = " - Luminance scaling: false"]
#[doc = " - Gamut mapping: false"]
#[doc = ""]
#[doc = " @see View"]
#[repr(C)]
#[derive(Debug, Default)]
pub struct filament_ColorGrading {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filament_ColorGrading_BuilderDetails {
    _unused: [u8; 0],
}
pub const filament_ColorGrading_QualityLevel_LOW: filament_ColorGrading_QualityLevel = 0;
pub const filament_ColorGrading_QualityLevel_MEDIUM: filament_ColorGrading_QualityLevel = 1;
pub const filament_ColorGrading_QualityLevel_HIGH: filament_ColorGrading_QualityLevel = 2;
pub const filament_ColorGrading_QualityLevel_ULTRA: filament_ColorGrading_QualityLevel = 3;
pub type filament_ColorGrading_QualityLevel = u8;
#[doc = "!< 10 bits per component"]
pub const filament_ColorGrading_LutFormat_INTEGER: filament_ColorGrading_LutFormat = 0;
#[doc = "!< 16 bits per component (10 bits mantissa precision)"]
pub const filament_ColorGrading_LutFormat_FLOAT: filament_ColorGrading_LutFormat = 1;
pub type filament_ColorGrading_LutFormat = u8;
#[doc = "!< Linear tone mapping (i.e. no tone mapping)"]
pub const filament_ColorGrading_ToneMapping_LINEAR: filament_ColorGrading_ToneMapping = 0;
#[doc = "!< ACES tone mapping, with a brightness modifier to match Filament's legacy tone mapper"]
pub const filament_ColorGrading_ToneMapping_ACES_LEGACY: filament_ColorGrading_ToneMapping = 1;
#[doc = "!< ACES tone mapping"]
pub const filament_ColorGrading_ToneMapping_ACES: filament_ColorGrading_ToneMapping = 2;
#[doc = "!< Filmic tone mapping, modelled after ACES but applied in sRGB space"]
pub const filament_ColorGrading_ToneMapping_FILMIC: filament_ColorGrading_ToneMapping = 3;
#[doc = "!< Tone mapping used to validate/debug scene exposure"]
pub const filament_ColorGrading_ToneMapping_DISPLAY_RANGE: filament_ColorGrading_ToneMapping = 4;
#[doc = " List of available tone-mapping operators."]
#[doc = ""]
#[doc = " @deprecated Use Builder::toneMapper(ToneMapper*) instead"]
pub type filament_ColorGrading_ToneMapping = u8;
#[doc = "! Use Builder to construct a ColorGrading object instance"]
#[repr(C)]
#[derive(Debug)]
pub struct filament_ColorGrading_Builder {
    pub _base: filament_BuilderBase<filament_ColorGrading_BuilderDetails>,
}
#[test]
fn bindgen_test_layout_filament_ColorGrading_Builder() {
    assert_eq!(
        ::std::mem::size_of::<filament_ColorGrading_Builder>(),
        8usize,
        concat!("Size of: ", stringify!(filament_ColorGrading_Builder))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_ColorGrading_Builder>(),
        8usize,
        concat!("Alignment of ", stringify!(filament_ColorGrading_Builder))
    );
}
extern "C" {
    #[doc = " Sets the quality level of the color grading. When color grading is implemented using"]
    #[doc = " a 3D LUT, the quality level may impact the resolution and bit depth of the backing"]
    #[doc = " 3D texture. For instance, a low quality level will use a 16x16x16 10 bit LUT, a medium"]
    #[doc = " quality level will use a 32x32x32 10 bit LUT, a high quality will use a 32x32x32 16 bit"]
    #[doc = " LUT, and a ultra quality will use a 64x64x64 16 bit LUT."]
    #[doc = " This overrides the values set by format() and dimensions()."]
    #[doc = ""]
    #[doc = " The default quality is medium."]
    #[doc = ""]
    #[doc = " @param qualityLevel The desired quality of the color grading process"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder7qualityENS0_12QualityLevelE"]
    pub fn filament_ColorGrading_Builder_quality(
        this: *mut filament_ColorGrading_Builder,
        qualityLevel: filament_ColorGrading_QualityLevel,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " When color grading is implemented using a 3D LUT, this sets the texture format of"]
    #[doc = " of the LUT. This overrides the value set by quality()."]
    #[doc = ""]
    #[doc = " The default is INTEGER"]
    #[doc = ""]
    #[doc = " @param format The desired format of the 3D LUT."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder6formatENS0_9LutFormatE"]
    pub fn filament_ColorGrading_Builder_format(
        this: *mut filament_ColorGrading_Builder,
        format: filament_ColorGrading_LutFormat,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " When color grading is implemented using a 3D LUT, this sets the dimension of the LUT."]
    #[doc = " This overrides the value set by quality()."]
    #[doc = ""]
    #[doc = " The default is 32"]
    #[doc = ""]
    #[doc = " @param dim The desired dimension of the LUT. Between 16 and 64."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder10dimensionsEh"]
    pub fn filament_ColorGrading_Builder_dimensions(
        this: *mut filament_ColorGrading_Builder,
        dim: u8,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Selects the tone mapping operator to apply to the HDR color buffer as the last"]
    #[doc = " operation of the color grading post-processing step."]
    #[doc = ""]
    #[doc = " The default tone mapping operator is ACESLegacyToneMapper."]
    #[doc = ""]
    #[doc = " The specified tone mapper must have a lifecycle that exceeds the lifetime of"]
    #[doc = " this builder. Since the build(Engine&) method is synchronous, it is safe to"]
    #[doc = " delete the tone mapper object after that finishes executing."]
    #[doc = ""]
    #[doc = " @param toneMapper The tone mapping operator to apply to the HDR color buffer"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder10toneMapperEPKNS_10ToneMapperE"]
    pub fn filament_ColorGrading_Builder_toneMapper(
        this: *mut filament_ColorGrading_Builder,
        toneMapper: *const filament_ToneMapper,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Selects the tone mapping operator to apply to the HDR color buffer as the last"]
    #[doc = " operation of the color grading post-processing step."]
    #[doc = ""]
    #[doc = " The default tone mapping operator is ACES_LEGACY."]
    #[doc = ""]
    #[doc = " @param toneMapping The tone mapping operator to apply to the HDR color buffer"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[doc = ""]
    #[doc = " @deprecated Use toneMapper(ToneMapper*) instead"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder11toneMappingENS0_11ToneMappingE"]
    pub fn filament_ColorGrading_Builder_toneMapping(
        this: *mut filament_ColorGrading_Builder,
        toneMapping: filament_ColorGrading_ToneMapping,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Enables or disables the luminance scaling component (LICH) from the exposure value"]
    #[doc = " invariant luminance system (EVILS). When this setting is enabled, pixels with high"]
    #[doc = " chromatic values will roll-off to white to offer a more natural rendering. This step"]
    #[doc = " also helps avoid undesirable hue skews caused by out of gamut colors clipped"]
    #[doc = " to the destination color gamut."]
    #[doc = ""]
    #[doc = " When luminance scaling is enabled, tone mapping is performed on the luminance of each"]
    #[doc = " pixel instead of per-channel."]
    #[doc = ""]
    #[doc = " @param luminanceScaling Enables or disables luminance scaling post-tone mapping"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder16luminanceScalingEb"]
    pub fn filament_ColorGrading_Builder_luminanceScaling(
        this: *mut filament_ColorGrading_Builder,
        luminanceScaling: bool,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Enables or disables gamut mapping to the destination color space's gamut. When gamut"]
    #[doc = " mapping is turned off, out-of-gamut colors are clipped to the destination's gamut,"]
    #[doc = " which may produce hue skews (blue skewing to purple, green to yellow, etc.). When"]
    #[doc = " gamut mapping is enabled, out-of-gamut colors are brought back in gamut by trying to"]
    #[doc = " preserve the perceived chroma and lightness of the original values."]
    #[doc = ""]
    #[doc = " @param gamutMapping Enables or disables gamut mapping"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder12gamutMappingEb"]
    pub fn filament_ColorGrading_Builder_gamutMapping(
        this: *mut filament_ColorGrading_Builder,
        gamutMapping: bool,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Adjusts the exposure of this image. The exposure is specified in stops:"]
    #[doc = " each stop brightens (positive values) or darkens (negative values) the image by"]
    #[doc = " a factor of 2. This means that an exposure of 3 will brighten the image 8 times"]
    #[doc = " more than an exposure of 0 (2^3 = 8 and 2^0 = 1). Contrary to the camera's exposure,"]
    #[doc = " this setting is applied after all post-processing (bloom, etc.) are applied."]
    #[doc = ""]
    #[doc = " @param exposure Value in EV stops. Can be negative, 0, or positive."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder8exposureEf"]
    pub fn filament_ColorGrading_Builder_exposure(
        this: *mut filament_ColorGrading_Builder,
        exposure: f32,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Controls the amount of night adaptation to replicate a more natural representation of"]
    #[doc = " low-light conditions as perceived by the human vision system. In low-light conditions,"]
    #[doc = " peak luminance sensitivity of the eye shifts toward the blue end of the color spectrum:"]
    #[doc = " darker tones appear brighter, reducing contrast, and colors are blue shifted (the darker"]
    #[doc = " the more intense the effect)."]
    #[doc = ""]
    #[doc = " @param adaptation Amount of adaptation, between 0 (no adaptation) and 1 (full adaptation)."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder15nightAdaptationEf"]
    pub fn filament_ColorGrading_Builder_nightAdaptation(
        this: *mut filament_ColorGrading_Builder,
        adaptation: f32,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Adjusts the while balance of the image. This can be used to remove color casts"]
    #[doc = " and correct the appearance of the white point in the scene, or to alter the"]
    #[doc = " overall chromaticity of the image for artistic reasons (to make the image appear"]
    #[doc = " cooler or warmer for instance)."]
    #[doc = ""]
    #[doc = " The while balance adjustment is defined with two values:"]
    #[doc = " - Temperature, to modify the color temperature. This value will modify the colors"]
    #[doc = "   on a blue/yellow axis. Lower values apply a cool color temperature, and higher"]
    #[doc = "   values apply a warm color temperature. The lowest value, -1.0f, is equivalent to"]
    #[doc = "   a temperature of 50,000K. The highest value, 1.0f, is equivalent to a temperature"]
    #[doc = "   of 2,000K."]
    #[doc = " - Tint, to modify the colors on a green/magenta axis. The lowest value, -1.0f, will"]
    #[doc = "   apply a strong green cast, and the highest value, 1.0f, will apply a strong magenta"]
    #[doc = "   cast."]
    #[doc = ""]
    #[doc = " Both values are expected to be in the range [-1.0..+1.0]. Values outside of that"]
    #[doc = " range will be clipped to that range."]
    #[doc = ""]
    #[doc = " @param temperature Modification on the blue/yellow axis, as a value between -1.0 and +1.0."]
    #[doc = " @param tint Modification on the green/magenta axis, as a value between -1.0 and +1.0."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder12whiteBalanceEff"]
    pub fn filament_ColorGrading_Builder_whiteBalance(
        this: *mut filament_ColorGrading_Builder,
        temperature: f32,
        tint: f32,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " The channel mixer adjustment modifies each output color channel using the specified"]
    #[doc = " mix of the source color channels."]
    #[doc = ""]
    #[doc = " By default each output color channel is set to use 100% of the corresponding source"]
    #[doc = " channel and 0% of the other channels. For instance, the output red channel is set to"]
    #[doc = " {1.0, 0.0, 1.0} or 100% red, 0% green and 0% blue."]
    #[doc = ""]
    #[doc = " Each output channel can add or subtract data from the source channel by using values"]
    #[doc = " in the range [-2.0..+2.0]. Values outside of that range will be clipped to that range."]
    #[doc = ""]
    #[doc = " Using the channel mixer adjustment you can for instance create a monochrome output"]
    #[doc = " by setting all 3 output channels to the same mix. For instance: {0.4, 0.4, 0.2} for"]
    #[doc = " all 3 output channels(40% red, 40% green and 20% blue)."]
    #[doc = ""]
    #[doc = " More complex mixes can be used to create more complex effects. For instance, here is"]
    #[doc = " a mix that creates a sepia tone effect:"]
    #[doc = " - outRed   = {0.255, 0.858, 0.087}"]
    #[doc = " - outGreen = {0.213, 0.715, 0.072}"]
    #[doc = " - outBlue  = {0.170, 0.572, 0.058}"]
    #[doc = ""]
    #[doc = " @param outRed The mix of source RGB for the output red channel, between -2.0 and +2.0"]
    #[doc = " @param outGreen The mix of source RGB for the output green channel, between -2.0 and +2.0"]
    #[doc = " @param outBlue The mix of source RGB for the output blue channel, between -2.0 and +2.0"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder12channelMixerENS_4math7details5TVec3IfEES5_S5_"]
    pub fn filament_ColorGrading_Builder_channelMixer(
        this: *mut filament_ColorGrading_Builder,
        outRed: filament_math_float3,
        outGreen: filament_math_float3,
        outBlue: filament_math_float3,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Adjusts the colors separately in 3 distinct tonal ranges or zones: shadows, mid-tones,"]
    #[doc = " and highlights."]
    #[doc = ""]
    #[doc = " The tonal zones are by the ranges parameter: the x and y components define the beginning"]
    #[doc = " and end of the transition from shadows to mid-tones, and the z and w components define"]
    #[doc = " the beginning and end of the transition from mid-tones to highlights."]
    #[doc = ""]
    #[doc = " A smooth transition is applied between the zones which means for instance that the"]
    #[doc = " correction color of the shadows range will partially apply to the mid-tones, and the"]
    #[doc = " other way around. This ensure smooth visual transitions in the final image."]
    #[doc = ""]
    #[doc = " Each correction color is defined as a linear RGB color and a weight. The weight is a"]
    #[doc = " value (which may be positive or negative) that is added to the linear RGB color before"]
    #[doc = " mixing. This can be used to darken or brighten the selected tonal range."]
    #[doc = ""]
    #[doc = " Shadows/mid-tones/highlights adjustment are performed linear space."]
    #[doc = ""]
    #[doc = " @param shadows Linear RGB color (.rgb) and weight (.w) to apply to the shadows"]
    #[doc = " @param midtones Linear RGB color (.rgb) and weight (.w) to apply to the mid-tones"]
    #[doc = " @param highlights Linear RGB color (.rgb) and weight (.w) to apply to the highlights"]
    #[doc = " @param ranges Range of the shadows (x and y), and range of the highlights (z and w)"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder25shadowsMidtonesHighlightsENS_4math7details5TVec4IfEES5_S5_S5_"]
    pub fn filament_ColorGrading_Builder_shadowsMidtonesHighlights(
        this: *mut filament_ColorGrading_Builder,
        shadows: filament_math_float4,
        midtones: filament_math_float4,
        highlights: filament_math_float4,
        ranges: filament_math_float4,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Applies a slope, offset, and power, as defined by the ASC CDL (American Society of"]
    #[doc = " Cinematographers Color Decision List) to the image. The CDL can be used to adjust the"]
    #[doc = " colors of different tonal ranges in the image."]
    #[doc = ""]
    #[doc = " The ASC CDL is similar to the lift/gamma/gain controls found in many color grading tools."]
    #[doc = " Lift is equivalent to a combination of offset and slope, gain is equivalent to slope,"]
    #[doc = " and gamma is equivalent to power."]
    #[doc = ""]
    #[doc = " The slope and power values must be strictly positive. Values less than or equal to 0 will"]
    #[doc = " be clamped to a small positive value, offset can be any positive or negative value."]
    #[doc = ""]
    #[doc = " Version 1.2 of the ASC CDL adds saturation control, which is here provided as a separate"]
    #[doc = " API. See the saturation() method for more information."]
    #[doc = ""]
    #[doc = " Slope/offset/power adjustments are performed in log space."]
    #[doc = ""]
    #[doc = " @param slope Multiplier of the input color, must be a strictly positive number"]
    #[doc = " @param offset Added to the input color, can be a negative or positive number, including 0"]
    #[doc = " @param power Power exponent of the input color, must be a strictly positive number"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder16slopeOffsetPowerENS_4math7details5TVec3IfEES5_S5_"]
    pub fn filament_ColorGrading_Builder_slopeOffsetPower(
        this: *mut filament_ColorGrading_Builder,
        slope: filament_math_float3,
        offset: filament_math_float3,
        power: filament_math_float3,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Adjusts the contrast of the image. Lower values decrease the contrast of the image"]
    #[doc = " (the tonal range is narrowed), and higher values increase the contrast of the image"]
    #[doc = " (the tonal range is widened). A value of 1.0 has no effect."]
    #[doc = ""]
    #[doc = " The contrast is defined as a value in the range [0.0...2.0]. Values outside of that"]
    #[doc = " range will be clipped to that range."]
    #[doc = ""]
    #[doc = " Contrast adjustment is performed in log space."]
    #[doc = ""]
    #[doc = " @param contrast Contrast expansion, between 0.0 and 2.0. 1.0 leaves contrast unaffected"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder8contrastEf"]
    pub fn filament_ColorGrading_Builder_contrast(
        this: *mut filament_ColorGrading_Builder,
        contrast: f32,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Adjusts the saturation of the image based on the input color's saturation level."]
    #[doc = " Colors with a high level of saturation are less affected than colors with low saturation"]
    #[doc = " levels."]
    #[doc = ""]
    #[doc = " Lower vibrance values decrease intensity of the colors present in the image, and"]
    #[doc = " higher values increase the intensity of the colors in the image. A value of 1.0 has"]
    #[doc = " no effect."]
    #[doc = ""]
    #[doc = " The vibrance is defined as a value in the range [0.0...2.0]. Values outside of that"]
    #[doc = " range will be clipped to that range."]
    #[doc = ""]
    #[doc = " Vibrance adjustment is performed in linear space."]
    #[doc = ""]
    #[doc = " @param vibrance Vibrance, between 0.0 and 2.0. 1.0 leaves vibrance unaffected"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder8vibranceEf"]
    pub fn filament_ColorGrading_Builder_vibrance(
        this: *mut filament_ColorGrading_Builder,
        vibrance: f32,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Adjusts the saturation of the image. Lower values decrease intensity of the colors"]
    #[doc = " present in the image, and higher values increase the intensity of the colors in the"]
    #[doc = " image. A value of 1.0 has no effect."]
    #[doc = ""]
    #[doc = " The saturation is defined as a value in the range [0.0...2.0]. Values outside of that"]
    #[doc = " range will be clipped to that range."]
    #[doc = ""]
    #[doc = " Saturation adjustment is performed in linear space."]
    #[doc = ""]
    #[doc = " @param saturation Saturation, between 0.0 and 2.0. 1.0 leaves saturation unaffected"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder10saturationEf"]
    pub fn filament_ColorGrading_Builder_saturation(
        this: *mut filament_ColorGrading_Builder,
        saturation: f32,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Applies a curve to each RGB channel of the image. Each curve is defined by 3 values:"]
    #[doc = " a gamma value applied to the shadows only, a mid-point indicating where shadows stop"]
    #[doc = " and highlights start, and a scale factor for the highlights."]
    #[doc = ""]
    #[doc = " The gamma and mid-point must be strictly positive values. If they are not, they will be"]
    #[doc = " clamped to a small positive value. The scale can be any negative of positive value."]
    #[doc = ""]
    #[doc = " Curves are applied in linear space."]
    #[doc = ""]
    #[doc = " @param shadowGamma Power value to apply to the shadows, must be strictly positive"]
    #[doc = " @param midPoint Mid-point defining where shadows stop and highlights start, must be strictly positive"]
    #[doc = " @param highlightScale Scale factor for the highlights, can be any negative or positive value"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls"]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder6curvesENS_4math7details5TVec3IfEES5_S5_"]
    pub fn filament_ColorGrading_Builder_curves(
        this: *mut filament_ColorGrading_Builder,
        shadowGamma: filament_math_float3,
        midPoint: filament_math_float3,
        highlightScale: filament_math_float3,
    ) -> *mut filament_ColorGrading_Builder;
}
extern "C" {
    #[doc = " Creates the ColorGrading object and returns a pointer to it."]
    #[doc = ""]
    #[doc = " @param engine Reference to the filament::Engine to associate this ColorGrading with."]
    #[doc = ""]
    #[doc = " @return pointer to the newly created object or nullptr if exceptions are disabled and"]
    #[doc = "         an error occurred."]
    #[link_name = "\u{1}_ZN8filament12ColorGrading7Builder5buildERNS_6EngineE"]
    pub fn filament_ColorGrading_Builder_build(
        this: *mut filament_ColorGrading_Builder,
        engine: *mut filament_Engine,
    ) -> *mut filament_ColorGrading;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament12ColorGrading7BuilderC1Ev"]
    pub fn filament_ColorGrading_Builder_Builder(this: *mut filament_ColorGrading_Builder);
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament12ColorGrading7BuilderC1ERKS1_"]
    pub fn filament_ColorGrading_Builder_Builder1(
        this: *mut filament_ColorGrading_Builder,
        rhs: *const filament_ColorGrading_Builder,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament12ColorGrading7BuilderC1EOS1_"]
    pub fn filament_ColorGrading_Builder_Builder2(
        this: *mut filament_ColorGrading_Builder,
        rhs: *mut filament_ColorGrading_Builder,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament12ColorGrading7BuilderD1Ev"]
    pub fn filament_ColorGrading_Builder_Builder_destructor(
        this: *mut filament_ColorGrading_Builder,
    );
}
impl Default for filament_ColorGrading_Builder {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl filament_ColorGrading_Builder {
    #[inline]
    pub unsafe fn quality(
        &mut self,
        qualityLevel: filament_ColorGrading_QualityLevel,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_quality(self, qualityLevel)
    }
    #[inline]
    pub unsafe fn format(
        &mut self,
        format: filament_ColorGrading_LutFormat,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_format(self, format)
    }
    #[inline]
    pub unsafe fn dimensions(&mut self, dim: u8) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_dimensions(self, dim)
    }
    #[inline]
    pub unsafe fn toneMapper(
        &mut self,
        toneMapper: *const filament_ToneMapper,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_toneMapper(self, toneMapper)
    }
    #[inline]
    pub unsafe fn toneMapping(
        &mut self,
        toneMapping: filament_ColorGrading_ToneMapping,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_toneMapping(self, toneMapping)
    }
    #[inline]
    pub unsafe fn luminanceScaling(
        &mut self,
        luminanceScaling: bool,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_luminanceScaling(self, luminanceScaling)
    }
    #[inline]
    pub unsafe fn gamutMapping(
        &mut self,
        gamutMapping: bool,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_gamutMapping(self, gamutMapping)
    }
    #[inline]
    pub unsafe fn exposure(&mut self, exposure: f32) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_exposure(self, exposure)
    }
    #[inline]
    pub unsafe fn nightAdaptation(
        &mut self,
        adaptation: f32,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_nightAdaptation(self, adaptation)
    }
    #[inline]
    pub unsafe fn whiteBalance(
        &mut self,
        temperature: f32,
        tint: f32,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_whiteBalance(self, temperature, tint)
    }
    #[inline]
    pub unsafe fn channelMixer(
        &mut self,
        outRed: filament_math_float3,
        outGreen: filament_math_float3,
        outBlue: filament_math_float3,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_channelMixer(self, outRed, outGreen, outBlue)
    }
    #[inline]
    pub unsafe fn shadowsMidtonesHighlights(
        &mut self,
        shadows: filament_math_float4,
        midtones: filament_math_float4,
        highlights: filament_math_float4,
        ranges: filament_math_float4,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_shadowsMidtonesHighlights(
            self, shadows, midtones, highlights, ranges,
        )
    }
    #[inline]
    pub unsafe fn slopeOffsetPower(
        &mut self,
        slope: filament_math_float3,
        offset: filament_math_float3,
        power: filament_math_float3,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_slopeOffsetPower(self, slope, offset, power)
    }
    #[inline]
    pub unsafe fn contrast(&mut self, contrast: f32) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_contrast(self, contrast)
    }
    #[inline]
    pub unsafe fn vibrance(&mut self, vibrance: f32) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_vibrance(self, vibrance)
    }
    #[inline]
    pub unsafe fn saturation(&mut self, saturation: f32) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_saturation(self, saturation)
    }
    #[inline]
    pub unsafe fn curves(
        &mut self,
        shadowGamma: filament_math_float3,
        midPoint: filament_math_float3,
        highlightScale: filament_math_float3,
    ) -> *mut filament_ColorGrading_Builder {
        filament_ColorGrading_Builder_curves(self, shadowGamma, midPoint, highlightScale)
    }
    #[inline]
    pub unsafe fn build(&mut self, engine: *mut filament_Engine) -> *mut filament_ColorGrading {
        filament_ColorGrading_Builder_build(self, engine)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_ColorGrading_Builder_Builder(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(rhs: *const filament_ColorGrading_Builder) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_ColorGrading_Builder_Builder1(__bindgen_tmp.as_mut_ptr(), rhs);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(rhs: *mut filament_ColorGrading_Builder) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_ColorGrading_Builder_Builder2(__bindgen_tmp.as_mut_ptr(), rhs);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        filament_ColorGrading_Builder_Builder_destructor(self)
    }
}
#[test]
fn bindgen_test_layout_filament_ColorGrading() {
    assert_eq!(
        ::std::mem::size_of::<filament_ColorGrading>(),
        1usize,
        concat!("Size of: ", stringify!(filament_ColorGrading))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_ColorGrading>(),
        1usize,
        concat!("Alignment of ", stringify!(filament_ColorGrading))
    );
}
#[doc = "! RGB color in linear space"]
pub type filament_LinearColor = filament_math_float3;
#[doc = "! RGBA color in linear space, with alpha"]
pub type filament_LinearColorA = filament_math_float4;
#[doc = "!< the color is defined in sRGB space"]
pub const filament_RgbType_sRGB: filament_RgbType = 0;
#[doc = "!< the color is defined in linear space"]
pub const filament_RgbType_LINEAR: filament_RgbType = 1;
#[doc = "! types of RGB colors"]
pub type filament_RgbType = u8;
#[doc = " the color is defined in sRGB space and the RGB values"]
#[doc = " have not been premultiplied by the alpha (for instance, a 50%"]
#[doc = " transparent red is <1,0,0,0.5>)"]
pub const filament_RgbaType_sRGB: filament_RgbaType = 0;
#[doc = " the color is defined in linear space and the RGB values"]
#[doc = " have not been premultiplied by the alpha (for instance, a 50%"]
#[doc = " transparent red is <1,0,0,0.5>)"]
pub const filament_RgbaType_LINEAR: filament_RgbaType = 1;
#[doc = " the color is defined in sRGB space and the RGB values"]
#[doc = " have been premultiplied by the alpha (for instance, a 50%"]
#[doc = " transparent red is <0.5,0,0,0.5>)"]
pub const filament_RgbaType_PREMULTIPLIED_sRGB: filament_RgbaType = 2;
#[doc = " the color is defined in linear space and the RGB values"]
#[doc = " have been premultiplied by the alpha (for instance, a 50%"]
#[doc = " transparent red is <0.5,0,0,0.5>)"]
pub const filament_RgbaType_PREMULTIPLIED_LINEAR: filament_RgbaType = 3;
#[doc = "! types of RGBA colors"]
pub type filament_RgbaType = u8;
#[doc = " A registry of runtime properties used exclusively for debugging"]
#[doc = ""]
#[doc = " Filament exposes a few properties that can be queried and set, which control certain debugging"]
#[doc = " features of the engine. These properties can be set at runtime at anytime."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Default)]
pub struct filament_DebugRegistry {
    pub _address: u8,
}
pub const filament_DebugRegistry_Type_BOOL: filament_DebugRegistry_Type = 0;
pub const filament_DebugRegistry_Type_INT: filament_DebugRegistry_Type = 1;
pub const filament_DebugRegistry_Type_FLOAT: filament_DebugRegistry_Type = 2;
pub const filament_DebugRegistry_Type_FLOAT2: filament_DebugRegistry_Type = 3;
pub const filament_DebugRegistry_Type_FLOAT3: filament_DebugRegistry_Type = 4;
pub const filament_DebugRegistry_Type_FLOAT4: filament_DebugRegistry_Type = 5;
#[doc = " Type of a property"]
pub type filament_DebugRegistry_Type = ::std::os::raw::c_uint;
#[doc = " Information about a property"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filament_DebugRegistry_Property {
    #[doc = "!< property name"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = "!< property type"]
    pub type_: filament_DebugRegistry_Type,
}
#[test]
fn bindgen_test_layout_filament_DebugRegistry_Property() {
    assert_eq!(
        ::std::mem::size_of::<filament_DebugRegistry_Property>(),
        16usize,
        concat!("Size of: ", stringify!(filament_DebugRegistry_Property))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_DebugRegistry_Property>(),
        8usize,
        concat!("Alignment of ", stringify!(filament_DebugRegistry_Property))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_Property>())).name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_Property),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_Property>())).type_ as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_Property),
            "::",
            stringify!(type_)
        )
    );
}
impl Default for filament_DebugRegistry_Property {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filament_DebugRegistry_DataSource {
    pub data: *const ::std::os::raw::c_void,
    pub count: size_t,
}
#[test]
fn bindgen_test_layout_filament_DebugRegistry_DataSource() {
    assert_eq!(
        ::std::mem::size_of::<filament_DebugRegistry_DataSource>(),
        16usize,
        concat!("Size of: ", stringify!(filament_DebugRegistry_DataSource))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_DebugRegistry_DataSource>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(filament_DebugRegistry_DataSource)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_DataSource>())).data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_DataSource),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_DataSource>())).count as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_DataSource),
            "::",
            stringify!(count)
        )
    );
}
impl Default for filament_DebugRegistry_DataSource {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_DebugRegistry_FrameHistory {
    pub target: filament_DebugRegistry_FrameHistory_duration_ms,
    pub targetWithHeadroom: filament_DebugRegistry_FrameHistory_duration_ms,
    pub frameTime: filament_DebugRegistry_FrameHistory_duration_ms,
    pub frameTimeDenoised: filament_DebugRegistry_FrameHistory_duration_ms,
    pub scale: f32,
    pub pid_e: f32,
    pub pid_i: f32,
    pub pid_d: f32,
}
pub type filament_DebugRegistry_FrameHistory_duration_ms = f32;
#[test]
fn bindgen_test_layout_filament_DebugRegistry_FrameHistory() {
    assert_eq!(
        ::std::mem::size_of::<filament_DebugRegistry_FrameHistory>(),
        32usize,
        concat!("Size of: ", stringify!(filament_DebugRegistry_FrameHistory))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_DebugRegistry_FrameHistory>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(filament_DebugRegistry_FrameHistory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_FrameHistory>())).target as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_FrameHistory),
            "::",
            stringify!(target)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_FrameHistory>())).targetWithHeadroom
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_FrameHistory),
            "::",
            stringify!(targetWithHeadroom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_FrameHistory>())).frameTime as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_FrameHistory),
            "::",
            stringify!(frameTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_FrameHistory>())).frameTimeDenoised
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_FrameHistory),
            "::",
            stringify!(frameTimeDenoised)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_FrameHistory>())).scale as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_FrameHistory),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_FrameHistory>())).pid_e as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_FrameHistory),
            "::",
            stringify!(pid_e)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_FrameHistory>())).pid_i as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_FrameHistory),
            "::",
            stringify!(pid_i)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_DebugRegistry_FrameHistory>())).pid_d as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_DebugRegistry_FrameHistory),
            "::",
            stringify!(pid_d)
        )
    );
}
#[test]
fn bindgen_test_layout_filament_DebugRegistry() {
    assert_eq!(
        ::std::mem::size_of::<filament_DebugRegistry>(),
        1usize,
        concat!("Size of: ", stringify!(filament_DebugRegistry))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_DebugRegistry>(),
        1usize,
        concat!("Alignment of ", stringify!(filament_DebugRegistry))
    );
}
extern "C" {
    #[doc = " Queries whether a property exists"]
    #[doc = " @param name The name of the property to query"]
    #[doc = " @return true if the property exists, false otherwise"]
    #[link_name = "\u{1}_ZNK8filament13DebugRegistry11hasPropertyEPKc"]
    pub fn filament_DebugRegistry_hasProperty(
        this: *const filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    #[doc = " Queries the address of a property's data from its name"]
    #[doc = " @param name Name of the property we want the data address of"]
    #[doc = " @return Address of the data of the \\p name property"]
    #[doc = " @{"]
    #[link_name = "\u{1}_ZN8filament13DebugRegistry18getPropertyAddressEPKc"]
    pub fn filament_DebugRegistry_getPropertyAddress(
        this: *mut filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Set the value of a property"]
    #[doc = " @param name Name of the property to set the value of"]
    #[doc = " @param v Value to set"]
    #[doc = " @return true if the operation was successful, false otherwise."]
    #[doc = " @{"]
    #[link_name = "\u{1}_ZN8filament13DebugRegistry11setPropertyEPKcb"]
    pub fn filament_DebugRegistry_setProperty(
        this: *mut filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: bool,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament13DebugRegistry11setPropertyEPKci"]
    pub fn filament_DebugRegistry_setProperty1(
        this: *mut filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament13DebugRegistry11setPropertyEPKcf"]
    pub fn filament_DebugRegistry_setProperty2(
        this: *mut filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: f32,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament13DebugRegistry11setPropertyEPKcNS_4math7details5TVec2IfEE"]
    pub fn filament_DebugRegistry_setProperty3(
        this: *mut filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: filament_math_float2,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament13DebugRegistry11setPropertyEPKcNS_4math7details5TVec3IfEE"]
    pub fn filament_DebugRegistry_setProperty4(
        this: *mut filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: filament_math_float3,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament13DebugRegistry11setPropertyEPKcNS_4math7details5TVec4IfEE"]
    pub fn filament_DebugRegistry_setProperty5(
        this: *mut filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: filament_math_float4,
    ) -> bool;
}
extern "C" {
    #[doc = " Get the value of a property"]
    #[doc = " @param name Name of the property to get the value of"]
    #[doc = " @param v A pointer to a variable which will hold the result"]
    #[doc = " @return true if the call was successful and \\p v was updated"]
    #[doc = " @{"]
    #[link_name = "\u{1}_ZNK8filament13DebugRegistry11getPropertyEPKcPb"]
    pub fn filament_DebugRegistry_getProperty(
        this: *const filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: *mut bool,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK8filament13DebugRegistry11getPropertyEPKcPi"]
    pub fn filament_DebugRegistry_getProperty1(
        this: *const filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: *mut ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK8filament13DebugRegistry11getPropertyEPKcPf"]
    pub fn filament_DebugRegistry_getProperty2(
        this: *const filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: *mut f32,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK8filament13DebugRegistry11getPropertyEPKcPNS_4math7details5TVec2IfEE"]
    pub fn filament_DebugRegistry_getProperty3(
        this: *const filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: *mut filament_math_float2,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK8filament13DebugRegistry11getPropertyEPKcPNS_4math7details5TVec3IfEE"]
    pub fn filament_DebugRegistry_getProperty4(
        this: *const filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: *mut filament_math_float3,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK8filament13DebugRegistry11getPropertyEPKcPNS_4math7details5TVec4IfEE"]
    pub fn filament_DebugRegistry_getProperty5(
        this: *const filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
        v: *mut filament_math_float4,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZNK8filament13DebugRegistry13getDataSourceEPKc"]
    pub fn filament_DebugRegistry_getDataSource(
        this: *const filament_DebugRegistry,
        name: *const ::std::os::raw::c_char,
    ) -> filament_DebugRegistry_DataSource;
}
impl filament_DebugRegistry {
    #[inline]
    pub unsafe fn hasProperty(&self, name: *const ::std::os::raw::c_char) -> bool {
        filament_DebugRegistry_hasProperty(self, name)
    }
    #[inline]
    pub unsafe fn getPropertyAddress(
        &mut self,
        name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void {
        filament_DebugRegistry_getPropertyAddress(self, name)
    }
    #[inline]
    pub unsafe fn setProperty(&mut self, name: *const ::std::os::raw::c_char, v: bool) -> bool {
        filament_DebugRegistry_setProperty(self, name, v)
    }
    #[inline]
    pub unsafe fn setProperty1(
        &mut self,
        name: *const ::std::os::raw::c_char,
        v: ::std::os::raw::c_int,
    ) -> bool {
        filament_DebugRegistry_setProperty1(self, name, v)
    }
    #[inline]
    pub unsafe fn setProperty2(&mut self, name: *const ::std::os::raw::c_char, v: f32) -> bool {
        filament_DebugRegistry_setProperty2(self, name, v)
    }
    #[inline]
    pub unsafe fn setProperty3(
        &mut self,
        name: *const ::std::os::raw::c_char,
        v: filament_math_float2,
    ) -> bool {
        filament_DebugRegistry_setProperty3(self, name, v)
    }
    #[inline]
    pub unsafe fn setProperty4(
        &mut self,
        name: *const ::std::os::raw::c_char,
        v: filament_math_float3,
    ) -> bool {
        filament_DebugRegistry_setProperty4(self, name, v)
    }
    #[inline]
    pub unsafe fn setProperty5(
        &mut self,
        name: *const ::std::os::raw::c_char,
        v: filament_math_float4,
    ) -> bool {
        filament_DebugRegistry_setProperty5(self, name, v)
    }
    #[inline]
    pub unsafe fn getProperty(&self, name: *const ::std::os::raw::c_char, v: *mut bool) -> bool {
        filament_DebugRegistry_getProperty(self, name, v)
    }
    #[inline]
    pub unsafe fn getProperty1(
        &self,
        name: *const ::std::os::raw::c_char,
        v: *mut ::std::os::raw::c_int,
    ) -> bool {
        filament_DebugRegistry_getProperty1(self, name, v)
    }
    #[inline]
    pub unsafe fn getProperty2(&self, name: *const ::std::os::raw::c_char, v: *mut f32) -> bool {
        filament_DebugRegistry_getProperty2(self, name, v)
    }
    #[inline]
    pub unsafe fn getProperty3(
        &self,
        name: *const ::std::os::raw::c_char,
        v: *mut filament_math_float2,
    ) -> bool {
        filament_DebugRegistry_getProperty3(self, name, v)
    }
    #[inline]
    pub unsafe fn getProperty4(
        &self,
        name: *const ::std::os::raw::c_char,
        v: *mut filament_math_float3,
    ) -> bool {
        filament_DebugRegistry_getProperty4(self, name, v)
    }
    #[inline]
    pub unsafe fn getProperty5(
        &self,
        name: *const ::std::os::raw::c_char,
        v: *mut filament_math_float4,
    ) -> bool {
        filament_DebugRegistry_getProperty5(self, name, v)
    }
    #[inline]
    pub unsafe fn getDataSource(
        &self,
        name: *const ::std::os::raw::c_char,
    ) -> filament_DebugRegistry_DataSource {
        filament_DebugRegistry_getDataSource(self, name)
    }
}
#[doc = " Engine is filament's main entry-point."]
#[doc = ""]
#[doc = " An Engine instance main function is to keep track of all resources created by the user and"]
#[doc = " manage the rendering thread as well as the hardware renderer."]
#[doc = ""]
#[doc = " To use filament, an Engine instance must be created first:"]
#[doc = ""]
#[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
#[doc = " #include <filament/Engine.h>"]
#[doc = " using namespace filament;"]
#[doc = ""]
#[doc = " Engine* engine = Engine::create();"]
#[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
#[doc = ""]
#[doc = " Engine essentially represents (or is associated to) a hardware context"]
#[doc = " (e.g. an OpenGL ES context)."]
#[doc = ""]
#[doc = " Rendering typically happens in an operating system's window (which can be full screen), such"]
#[doc = " window is managed by a filament.Renderer."]
#[doc = ""]
#[doc = " A typical filament render loop looks like this:"]
#[doc = ""]
#[doc = ""]
#[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
#[doc = " #include <filament/Engine.h>"]
#[doc = " #include <filament/Renderer.h>"]
#[doc = " #include <filament/Scene.h>"]
#[doc = " #include <filament/View.h>"]
#[doc = " using namespace filament;"]
#[doc = ""]
#[doc = " Engine* engine       = Engine::create();"]
#[doc = " SwapChain* swapChain = engine->createSwapChain(nativeWindow);"]
#[doc = " Renderer* renderer   = engine->createRenderer();"]
#[doc = " Scene* scene         = engine->createScene();"]
#[doc = " View* view           = engine->createView();"]
#[doc = ""]
#[doc = " view->setScene(scene);"]
#[doc = ""]
#[doc = " do {"]
#[doc = "     // typically we wait for VSYNC and user input events"]
#[doc = "     if (renderer->beginFrame(swapChain)) {"]
#[doc = "         renderer->render(view);"]
#[doc = "         renderer->endFrame();"]
#[doc = "     }"]
#[doc = " } while (!quit);"]
#[doc = ""]
#[doc = " engine->destroy(view);"]
#[doc = " engine->destroy(scene);"]
#[doc = " engine->destroy(renderer);"]
#[doc = " engine->destroy(swapChain);"]
#[doc = " Engine::destroy(&engine); // clears engine*"]
#[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
#[doc = ""]
#[doc = " Resource Tracking"]
#[doc = " ================="]
#[doc = ""]
#[doc = "  Each Engine instance keeps track of all objects created by the user, such as vertex and index"]
#[doc = "  buffers, lights, cameras, etc..."]
#[doc = "  The user is expected to free those resources, however, leaked resources are freed when the"]
#[doc = "  engine instance is destroyed and a warning is emitted in the console."]
#[doc = ""]
#[doc = " Thread safety"]
#[doc = " ============="]
#[doc = ""]
#[doc = " An Engine instance is not thread-safe. The implementation makes no attempt to synchronize"]
#[doc = " calls to an Engine instance methods."]
#[doc = " If multi-threading is needed, synchronization must be external."]
#[doc = ""]
#[doc = " Multi-threading"]
#[doc = " ==============="]
#[doc = ""]
#[doc = " When created, the Engine instance starts a render thread as well as multiple worker threads,"]
#[doc = " these threads have an elevated priority appropriate for rendering, based on the platform's"]
#[doc = " best practices. The number of worker threads depends on the platform and is automatically"]
#[doc = " chosen for best performance."]
#[doc = ""]
#[doc = " On platforms with asymmetric cores (e.g. ARM's Big.Little), Engine makes some educated guesses"]
#[doc = " as to which cores to use for the render thread and worker threads. For example, it'll try to"]
#[doc = " keep an OpenGL ES thread on a Big core."]
#[doc = ""]
#[doc = " Swap Chains"]
#[doc = " ==========="]
#[doc = ""]
#[doc = " A swap chain represents an Operating System's *native* renderable surface. Typically it's a window"]
#[doc = " or a view. Because a SwapChain is initialized from a native object, it is given to filament"]
#[doc = " as a `void*`, which must be of the proper type for each platform filament is running on."]
#[doc = ""]
#[doc = " @see SwapChain"]
#[doc = ""]
#[doc = ""]
#[doc = " @see Renderer"]
#[repr(C)]
#[derive(Debug, Default)]
pub struct filament_Engine {
    pub _address: u8,
}
pub type filament_Engine_Platform = filament_backend_Platform;
#[doc = " Selects which driver a particular Engine should use."]
pub use self::filament_backend_Backend as filament_Engine_Backend;
#[doc = " A callback used with Engine::createAsync() called once the engine is initialized and it is"]
#[doc = " safe to call Engine::getEngine(token). This callback is invoked from an arbitrary worker"]
#[doc = " thread. Engine::getEngine() CANNOT be called from that thread, instead it must be called"]
#[doc = " from the same thread than Engine::createAsync() was called from."]
#[doc = ""]
#[doc = " @param user   User provided parameter given in createAsync()."]
#[doc = ""]
#[doc = " @param token  An opaque token used to call Engine::getEngine()."]
pub type filament_Engine_CreateCallback = ::std::option::Option<
    unsafe extern "C" fn(user: *mut ::std::os::raw::c_void, token: *mut ::std::os::raw::c_void),
>;
#[test]
fn bindgen_test_layout_filament_Engine() {
    assert_eq!(
        ::std::mem::size_of::<filament_Engine>(),
        1usize,
        concat!("Size of: ", stringify!(filament_Engine))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_Engine>(),
        1usize,
        concat!("Alignment of ", stringify!(filament_Engine))
    );
}
extern "C" {
    #[doc = " Creates an instance of Engine"]
    #[doc = ""]
    #[doc = " @param backend           Which driver backend to use."]
    #[doc = ""]
    #[doc = " @param platform          A pointer to an object that implements Platform. If this is"]
    #[doc = "                          provided, then this object is used to create the hardware context"]
    #[doc = "                          and expose platform features to it."]
    #[doc = ""]
    #[doc = "                          If not provided (or nullptr is used), an appropriate Platform"]
    #[doc = "                          is created automatically."]
    #[doc = ""]
    #[doc = "                          All methods of this interface are called from filament's"]
    #[doc = "                          render thread, which is different from the main thread."]
    #[doc = ""]
    #[doc = "                          The lifetime of \\p platform must exceed the lifetime of"]
    #[doc = "                          the Engine object."]
    #[doc = ""]
    #[doc = "  @param sharedGLContext  A platform-dependant OpenGL context used as a shared context"]
    #[doc = "                          when creating filament's internal context."]
    #[doc = "                          Setting this parameter will force filament to use the OpenGL"]
    #[doc = "                          implementation (instead of Vulkan for instance)."]
    #[doc = ""]
    #[doc = ""]
    #[doc = " @return A pointer to the newly created Engine, or nullptr if the Engine couldn't be created."]
    #[doc = ""]
    #[doc = " nullptr if the GPU driver couldn't be initialized, for instance if it doesn't"]
    #[doc = " support the right version of OpenGL or OpenGL ES."]
    #[doc = ""]
    #[doc = " @exception utils::PostConditionPanic can be thrown if there isn't enough memory to"]
    #[doc = " allocate the command buffer. If exceptions are disabled, this condition if fatal and"]
    #[doc = " this function will abort."]
    #[doc = ""]
    #[doc = " \\remark"]
    #[doc = " This method is thread-safe."]
    #[link_name = "\u{1}_ZN8filament6Engine6createENS_7backend7BackendEPNS1_8PlatformEPv"]
    pub fn filament_Engine_create(
        backend: filament_Engine_Backend,
        platform: *mut filament_Engine_Platform,
        sharedGLContext: *mut ::std::os::raw::c_void,
    ) -> *mut filament_Engine;
}
extern "C" {
    #[doc = " Creates an instance of Engine asynchronously"]
    #[doc = ""]
    #[doc = " @param callback          Callback called once the engine is initialized and it is safe to"]
    #[doc = "                          call Engine::getEngine."]
    #[doc = ""]
    #[doc = " @param user              A user provided pointer that is given back to callback unmodified."]
    #[doc = ""]
    #[doc = " @param backend           Which driver backend to use."]
    #[doc = ""]
    #[doc = " @param platform          A pointer to an object that implements Platform. If this is"]
    #[doc = "                          provided, then this object is used to create the hardware context"]
    #[doc = "                          and expose platform features to it."]
    #[doc = ""]
    #[doc = "                          If not provided (or nullptr is used), an appropriate Platform"]
    #[doc = "                          is created automatically."]
    #[doc = ""]
    #[doc = "                          All methods of this interface are called from filament's"]
    #[doc = "                          render thread, which is different from the main thread."]
    #[doc = ""]
    #[doc = "                          The lifetime of \\p platform must exceed the lifetime of"]
    #[doc = "                          the Engine object."]
    #[doc = ""]
    #[doc = "  @param sharedGLContext  A platform-dependant OpenGL context used as a shared context"]
    #[doc = "                          when creating filament's internal context."]
    #[doc = "                          Setting this parameter will force filament to use the OpenGL"]
    #[doc = "                          implementation (instead of Vulkan for instance)."]
    #[link_name = "\u{1}_ZN8filament6Engine11createAsyncEPFvPvS1_ES1_NS_7backend7BackendEPNS4_8PlatformES1_"]
    pub fn filament_Engine_createAsync(
        callback: filament_Engine_CreateCallback,
        user: *mut ::std::os::raw::c_void,
        backend: filament_Engine_Backend,
        platform: *mut filament_Engine_Platform,
        sharedGLContext: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " Retrieve an Engine* from createAsync(). This must be called from the same thread than"]
    #[doc = " Engine::createAsync() was called from."]
    #[doc = ""]
    #[doc = " @param token An opaque token given in the createAsync() callback function."]
    #[doc = ""]
    #[doc = " @return A pointer to the newly created Engine, or nullptr if the Engine couldn't be created."]
    #[doc = ""]
    #[doc = " @exception utils::PostConditionPanic can be thrown if there isn't enough memory to"]
    #[doc = " allocate the command buffer. If exceptions are disabled, this condition if fatal and"]
    #[doc = " this function will abort."]
    #[link_name = "\u{1}_ZN8filament6Engine9getEngineEPv"]
    pub fn filament_Engine_getEngine(token: *mut ::std::os::raw::c_void) -> *mut filament_Engine;
}
extern "C" {
    #[doc = " Destroy the Engine instance and all associated resources."]
    #[doc = ""]
    #[doc = " Engine.destroy() should be called last and after all other resources have been destroyed,"]
    #[doc = " it ensures all filament resources are freed."]
    #[doc = ""]
    #[doc = " Destroy performs the following tasks:"]
    #[doc = " 1. Destroy all internal software and hardware resources."]
    #[doc = " 2. Free all user allocated resources that are not already destroyed and logs a warning."]
    #[doc = "    This indicates a \"leak\" in the user's code."]
    #[doc = " 3. Terminate the rendering engine's thread."]
    #[doc = ""]
    #[doc = " @param engine A pointer to the filament.Engine* to be destroyed."]
    #[doc = "               \\p engine is cleared upon return."]
    #[doc = ""]
    #[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
    #[doc = " #include <filament/Engine.h>"]
    #[doc = " using namespace filament;"]
    #[doc = ""]
    #[doc = " Engine* engine = Engine::create();"]
    #[doc = " Engine::destroy(&engine); // clears engine*"]
    #[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
    #[doc = ""]
    #[doc = " \\remark"]
    #[doc = " This method is thread-safe."]
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPPS0_"]
    pub fn filament_Engine_destroy(engine: *mut *mut filament_Engine);
}
extern "C" {
    #[doc = " Destroy the Engine instance and all associated resources."]
    #[doc = ""]
    #[doc = " Engine.destroy() should be called last and after all other resources have been destroyed,"]
    #[doc = " it ensures all filament resources are freed."]
    #[doc = ""]
    #[doc = " Destroy performs the following tasks:"]
    #[doc = " 1. Destroy all internal software and hardware resources."]
    #[doc = " 2. Free all user allocated resources that are not already destroyed and logs a warning."]
    #[doc = "    This indicates a \"leak\" in the user's code."]
    #[doc = " 3. Terminate the rendering engine's thread."]
    #[doc = ""]
    #[doc = " @param engine A pointer to the filament.Engine to be destroyed."]
    #[doc = ""]
    #[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
    #[doc = " #include <filament/Engine.h>"]
    #[doc = " using namespace filament;"]
    #[doc = ""]
    #[doc = " Engine* engine = Engine::create();"]
    #[doc = " Engine::destroy(engine);"]
    #[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
    #[doc = ""]
    #[doc = " \\remark"]
    #[doc = " This method is thread-safe."]
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPS0_"]
    pub fn filament_Engine_destroy1(engine: *mut filament_Engine);
}
extern "C" {
    #[doc = " @return EntityManager used by filament"]
    #[link_name = "\u{1}_ZN8filament6Engine16getEntityManagerEv"]
    pub fn filament_Engine_getEntityManager(this: *mut filament_Engine)
        -> *mut utils_EntityManager;
}
extern "C" {
    #[doc = " @return RenderableManager reference"]
    #[link_name = "\u{1}_ZN8filament6Engine20getRenderableManagerEv"]
    pub fn filament_Engine_getRenderableManager(
        this: *mut filament_Engine,
    ) -> *mut filament_RenderableManager;
}
extern "C" {
    #[doc = " @return LightManager reference"]
    #[link_name = "\u{1}_ZN8filament6Engine15getLightManagerEv"]
    pub fn filament_Engine_getLightManager(
        this: *mut filament_Engine,
    ) -> *mut filament_LightManager;
}
extern "C" {
    #[doc = " @return TransformManager reference"]
    #[link_name = "\u{1}_ZN8filament6Engine19getTransformManagerEv"]
    pub fn filament_Engine_getTransformManager(
        this: *mut filament_Engine,
    ) -> *mut filament_TransformManager;
}
extern "C" {
    #[doc = " Helper to enable accurate translations."]
    #[doc = " If you need this Engine to handle a very large world space, one way to achieve this"]
    #[doc = " automatically is to enable accurate translations in the TransformManager. This helper"]
    #[doc = " provides a convenient way of doing that."]
    #[doc = " This is typically called once just after creating the Engine."]
    #[link_name = "\u{1}_ZN8filament6Engine26enableAccurateTranslationsEv"]
    pub fn filament_Engine_enableAccurateTranslations(this: *mut filament_Engine);
}
extern "C" {
    #[doc = " Creates a SwapChain from the given Operating System's native window handle."]
    #[doc = ""]
    #[doc = " @param nativeWindow An opaque native window handle. e.g.: on Android this is an"]
    #[doc = "                     `ANativeWindow*`."]
    #[doc = " @param flags One or more configuration flags as defined in `SwapChain`."]
    #[doc = ""]
    #[doc = " @return A pointer to the newly created SwapChain or nullptr if it couldn't be created."]
    #[doc = ""]
    #[doc = " @see Renderer.beginFrame()"]
    #[link_name = "\u{1}_ZN8filament6Engine15createSwapChainEPvm"]
    pub fn filament_Engine_createSwapChain(
        this: *mut filament_Engine,
        nativeWindow: *mut ::std::os::raw::c_void,
        flags: u64,
    ) -> *mut filament_SwapChain;
}
extern "C" {
    #[doc = " Creates a headless SwapChain."]
    #[doc = ""]
    #[doc = " @param width    Width of the drawing buffer in pixels."]
    #[doc = " @param height   Height of the drawing buffer in pixels."]
    #[doc = " @param flags     One or more configuration flags as defined in `SwapChain`."]
    #[doc = ""]
    #[doc = " @return A pointer to the newly created SwapChain or nullptr if it couldn't be created."]
    #[doc = ""]
    #[doc = " @see Renderer.beginFrame()"]
    #[link_name = "\u{1}_ZN8filament6Engine15createSwapChainEjjm"]
    pub fn filament_Engine_createSwapChain1(
        this: *mut filament_Engine,
        width: u32,
        height: u32,
        flags: u64,
    ) -> *mut filament_SwapChain;
}
extern "C" {
    #[doc = " Creates a renderer associated to this engine."]
    #[doc = ""]
    #[doc = " A Renderer is intended to map to a *window* on screen."]
    #[doc = ""]
    #[doc = " @return A pointer to the newly created Renderer or nullptr if it couldn't be created."]
    #[link_name = "\u{1}_ZN8filament6Engine14createRendererEv"]
    pub fn filament_Engine_createRenderer(this: *mut filament_Engine) -> *mut filament_Renderer;
}
extern "C" {
    #[doc = " Creates a View."]
    #[doc = ""]
    #[doc = " @return A pointer to the newly created View or nullptr if it couldn't be created."]
    #[link_name = "\u{1}_ZN8filament6Engine10createViewEv"]
    pub fn filament_Engine_createView(this: *mut filament_Engine) -> *mut filament_View;
}
extern "C" {
    #[doc = " Creates a Scene."]
    #[doc = ""]
    #[doc = " @return A pointer to the newly created Scene or nullptr if it couldn't be created."]
    #[link_name = "\u{1}_ZN8filament6Engine11createSceneEv"]
    pub fn filament_Engine_createScene(this: *mut filament_Engine) -> *mut filament_Scene;
}
extern "C" {
    #[doc = " Creates a Camera component."]
    #[doc = ""]
    #[doc = " @param entity Entity to add the camera component to."]
    #[doc = " @return A pointer to the newly created Camera or nullptr if it couldn't be created."]
    #[link_name = "\u{1}_ZN8filament6Engine12createCameraEN5utils6EntityE"]
    pub fn filament_Engine_createCamera(
        this: *mut filament_Engine,
        entity: utils_Entity,
    ) -> *mut filament_Camera;
}
extern "C" {
    #[doc = " Returns the Camera component of the given entity."]
    #[doc = ""]
    #[doc = " @param entity An entity."]
    #[doc = " @return A pointer to the Camera component for this entity or nullptr if the entity didn't"]
    #[doc = "         have a Camera component. The pointer is valid until destroyCameraComponent()"]
    #[doc = "         is called or the entity itself is destroyed."]
    #[link_name = "\u{1}_ZN8filament6Engine18getCameraComponentEN5utils6EntityE"]
    pub fn filament_Engine_getCameraComponent(
        this: *mut filament_Engine,
        entity: utils_Entity,
    ) -> *mut filament_Camera;
}
extern "C" {
    #[doc = " Destroys the Camera component associated with the given entity."]
    #[doc = ""]
    #[doc = " @param entity An entity."]
    #[link_name = "\u{1}_ZN8filament6Engine22destroyCameraComponentEN5utils6EntityE"]
    pub fn filament_Engine_destroyCameraComponent(this: *mut filament_Engine, entity: utils_Entity);
}
extern "C" {
    #[doc = " Creates a Fence."]
    #[doc = ""]
    #[doc = " @return A pointer to the newly created Fence or nullptr if it couldn't be created."]
    #[link_name = "\u{1}_ZN8filament6Engine11createFenceEv"]
    pub fn filament_Engine_createFence(this: *mut filament_Engine) -> *mut filament_Fence;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_12BufferObjectE"]
    pub fn filament_Engine_destroy2(
        this: *mut filament_Engine,
        p: *const filament_BufferObject,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_12VertexBufferE"]
    pub fn filament_Engine_destroy3(
        this: *mut filament_Engine,
        p: *const filament_VertexBuffer,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_5FenceE"]
    pub fn filament_Engine_destroy4(this: *mut filament_Engine, p: *const filament_Fence) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_11IndexBufferE"]
    pub fn filament_Engine_destroy5(
        this: *mut filament_Engine,
        p: *const filament_IndexBuffer,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_14SkinningBufferE"]
    pub fn filament_Engine_destroy6(
        this: *mut filament_Engine,
        p: *const filament_SkinningBuffer,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_17MorphTargetBufferE"]
    pub fn filament_Engine_destroy7(
        this: *mut filament_Engine,
        p: *const filament_MorphTargetBuffer,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_13IndirectLightE"]
    pub fn filament_Engine_destroy8(
        this: *mut filament_Engine,
        p: *const filament_IndirectLight,
    ) -> bool;
}
extern "C" {
    #[doc = " Destroys a Material object"]
    #[doc = " @param p the material object to destroy"]
    #[doc = " @attention All MaterialInstance of the specified material must be destroyed before"]
    #[doc = "            destroying it."]
    #[doc = " @exception utils::PreConditionPanic is thrown if some MaterialInstances remain."]
    #[doc = " no-op if exceptions are disabled and some MaterialInstances remain."]
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_8MaterialE"]
    pub fn filament_Engine_destroy9(
        this: *mut filament_Engine,
        p: *const filament_Material,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_16MaterialInstanceE"]
    pub fn filament_Engine_destroy10(
        this: *mut filament_Engine,
        p: *const filament_MaterialInstance,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_8RendererE"]
    pub fn filament_Engine_destroy11(
        this: *mut filament_Engine,
        p: *const filament_Renderer,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_5SceneE"]
    pub fn filament_Engine_destroy12(this: *mut filament_Engine, p: *const filament_Scene) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_6SkyboxE"]
    pub fn filament_Engine_destroy13(this: *mut filament_Engine, p: *const filament_Skybox)
        -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_12ColorGradingE"]
    pub fn filament_Engine_destroy14(
        this: *mut filament_Engine,
        p: *const filament_ColorGrading,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_9SwapChainE"]
    pub fn filament_Engine_destroy15(
        this: *mut filament_Engine,
        p: *const filament_SwapChain,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_6StreamE"]
    pub fn filament_Engine_destroy16(this: *mut filament_Engine, p: *const filament_Stream)
        -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_7TextureE"]
    pub fn filament_Engine_destroy17(
        this: *mut filament_Engine,
        p: *const filament_Texture,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_12RenderTargetE"]
    pub fn filament_Engine_destroy18(
        this: *mut filament_Engine,
        p: *const filament_RenderTarget,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEPKNS_4ViewE"]
    pub fn filament_Engine_destroy19(this: *mut filament_Engine, p: *const filament_View) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine7destroyEN5utils6EntityE"]
    pub fn filament_Engine_destroy20(this: *mut filament_Engine, e: utils_Entity);
}
extern "C" {
    #[doc = " Kicks the hardware thread (e.g. the OpenGL, Vulkan or Metal thread) and blocks until"]
    #[doc = " all commands to this point are executed. Note that does guarantee that the"]
    #[doc = " hardware is actually finished."]
    #[doc = ""]
    #[doc = " <p>This is typically used right after destroying the <code>SwapChain</code>,"]
    #[doc = " in cases where a guarantee about the <code>SwapChain</code> destruction is needed in a"]
    #[doc = " timely fashion, such as when responding to Android's"]
    #[doc = " <code>android.view.SurfaceHolder.Callback.surfaceDestroyed</code></p>"]
    #[link_name = "\u{1}_ZN8filament6Engine12flushAndWaitEv"]
    pub fn filament_Engine_flushAndWait(this: *mut filament_Engine);
}
extern "C" {
    #[doc = " Kicks the hardware thread (e.g. the OpenGL, Vulkan or Metal thread) but does not wait"]
    #[doc = " for commands to be either executed or the hardware finished."]
    #[doc = ""]
    #[doc = " <p>This is typically used after creating a lot of objects to start draining the command"]
    #[doc = " queue which has a limited size.</p>"]
    #[link_name = "\u{1}_ZN8filament6Engine5flushEv"]
    pub fn filament_Engine_flush(this: *mut filament_Engine);
}
extern "C" {
    #[doc = " Drains the user callback message queue and immediately execute all pending callbacks."]
    #[doc = ""]
    #[doc = " <p> Typically this should be called once per frame right after the application's vsync tick,"]
    #[doc = " and typically just before computing parameters (e.g. object positions) for the next frame."]
    #[doc = " This is useful because otherwise callbacks will be executed by filament at a later time,"]
    #[doc = " which may increase latency in certain applications.</p>"]
    #[link_name = "\u{1}_ZN8filament6Engine17pumpMessageQueuesEv"]
    pub fn filament_Engine_pumpMessageQueues(this: *mut filament_Engine);
}
extern "C" {
    #[doc = " Returns the default Material."]
    #[doc = ""]
    #[doc = " The default material is 80% white and uses the Material.Shading.LIT shading."]
    #[doc = ""]
    #[doc = " @return A pointer to the default Material instance (a singleton)."]
    #[link_name = "\u{1}_ZNK8filament6Engine18getDefaultMaterialEv"]
    pub fn filament_Engine_getDefaultMaterial(
        this: *const filament_Engine,
    ) -> *const filament_Material;
}
extern "C" {
    #[doc = " Returns the resolved backend."]
    #[link_name = "\u{1}_ZNK8filament6Engine10getBackendEv"]
    pub fn filament_Engine_getBackend(this: *const filament_Engine) -> filament_Engine_Backend;
}
extern "C" {
    #[doc = " Returns the Platform object that belongs to this Engine."]
    #[doc = ""]
    #[doc = " When Engine::create is called with no platform argument, Filament creates an appropriate"]
    #[doc = " Platform subclass automatically. The specific subclass created depends on the backend and"]
    #[doc = " OS. For example, when the OpenGL backend is used, the Platform object will be a descendant of"]
    #[doc = " OpenGLPlatform."]
    #[doc = ""]
    #[doc = " dynamic_cast should be used to cast the returned Platform object into a specific subclass."]
    #[doc = " Note that RTTI must be available to use dynamic_cast."]
    #[doc = ""]
    #[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
    #[doc = " Platform* platform = engine->getPlatform();"]
    #[doc = " // static_cast also works, but more dangerous."]
    #[doc = " SpecificPlatform* specificPlatform = dynamic_cast<SpecificPlatform*>(platform);"]
    #[doc = " specificPlatform->platformSpecificMethod();"]
    #[doc = " ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"]
    #[doc = ""]
    #[doc = " When a custom Platform is passed to Engine::create, Filament will use it instead, and this"]
    #[doc = " method will return it."]
    #[doc = ""]
    #[doc = " @return A pointer to the Platform object that was provided to Engine::create, or the"]
    #[doc = " Filament-created one."]
    #[link_name = "\u{1}_ZNK8filament6Engine11getPlatformEv"]
    pub fn filament_Engine_getPlatform(
        this: *const filament_Engine,
    ) -> *mut filament_Engine_Platform;
}
extern "C" {
    #[doc = " Allocate a small amount of memory directly in the command stream. The allocated memory is"]
    #[doc = " guaranteed to be preserved until the current command buffer is executed"]
    #[doc = ""]
    #[doc = " @param size       size to allocate in bytes. This should be small (e.g. < 1 KB)"]
    #[doc = " @param alignment  alignment requested"]
    #[doc = " @return           a pointer to the allocated buffer or nullptr if no memory was available."]
    #[doc = ""]
    #[doc = " @note there is no need to destroy this buffer, it will be freed automatically when"]
    #[doc = "       the current command buffer is executed."]
    #[link_name = "\u{1}_ZN8filament6Engine11streamAllocEmm"]
    pub fn filament_Engine_streamAlloc(
        this: *mut filament_Engine,
        size: size_t,
        alignment: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Invokes one iteration of the render loop, used only on single-threaded platforms."]
    #[doc = ""]
    #[doc = " This should be called every time the windowing system needs to paint (e.g. at 60 Hz)."]
    #[link_name = "\u{1}_ZN8filament6Engine7executeEv"]
    pub fn filament_Engine_execute(this: *mut filament_Engine);
}
extern "C" {
    #[doc = " Retrieves the job system that the Engine has ownership over."]
    #[doc = ""]
    #[doc = " @return JobSystem used by filament"]
    #[link_name = "\u{1}_ZN8filament6Engine12getJobSystemEv"]
    pub fn filament_Engine_getJobSystem(this: *mut filament_Engine) -> *mut utils_JobSystem;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament6Engine16getDebugRegistryEv"]
    pub fn filament_Engine_getDebugRegistry(
        this: *mut filament_Engine,
    ) -> *mut filament_DebugRegistry;
}
impl filament_Engine {
    #[inline]
    pub unsafe fn create(
        backend: filament_Engine_Backend,
        platform: *mut filament_Engine_Platform,
        sharedGLContext: *mut ::std::os::raw::c_void,
    ) -> *mut filament_Engine {
        filament_Engine_create(backend, platform, sharedGLContext)
    }
    #[inline]
    pub unsafe fn createAsync(
        callback: filament_Engine_CreateCallback,
        user: *mut ::std::os::raw::c_void,
        backend: filament_Engine_Backend,
        platform: *mut filament_Engine_Platform,
        sharedGLContext: *mut ::std::os::raw::c_void,
    ) {
        filament_Engine_createAsync(callback, user, backend, platform, sharedGLContext)
    }
    #[inline]
    pub unsafe fn getEngine(token: *mut ::std::os::raw::c_void) -> *mut filament_Engine {
        filament_Engine_getEngine(token)
    }
    #[inline]
    pub unsafe fn destroy(engine: *mut *mut filament_Engine) {
        filament_Engine_destroy(engine)
    }
    #[inline]
    pub unsafe fn destroy1(engine: *mut filament_Engine) {
        filament_Engine_destroy1(engine)
    }
    #[inline]
    pub unsafe fn getEntityManager(&mut self) -> *mut utils_EntityManager {
        filament_Engine_getEntityManager(self)
    }
    #[inline]
    pub unsafe fn getRenderableManager(&mut self) -> *mut filament_RenderableManager {
        filament_Engine_getRenderableManager(self)
    }
    #[inline]
    pub unsafe fn getLightManager(&mut self) -> *mut filament_LightManager {
        filament_Engine_getLightManager(self)
    }
    #[inline]
    pub unsafe fn getTransformManager(&mut self) -> *mut filament_TransformManager {
        filament_Engine_getTransformManager(self)
    }
    #[inline]
    pub unsafe fn enableAccurateTranslations(&mut self) {
        filament_Engine_enableAccurateTranslations(self)
    }
    #[inline]
    pub unsafe fn createSwapChain(
        &mut self,
        nativeWindow: *mut ::std::os::raw::c_void,
        flags: u64,
    ) -> *mut filament_SwapChain {
        filament_Engine_createSwapChain(self, nativeWindow, flags)
    }
    #[inline]
    pub unsafe fn createSwapChain1(
        &mut self,
        width: u32,
        height: u32,
        flags: u64,
    ) -> *mut filament_SwapChain {
        filament_Engine_createSwapChain1(self, width, height, flags)
    }
    #[inline]
    pub unsafe fn createRenderer(&mut self) -> *mut filament_Renderer {
        filament_Engine_createRenderer(self)
    }
    #[inline]
    pub unsafe fn createView(&mut self) -> *mut filament_View {
        filament_Engine_createView(self)
    }
    #[inline]
    pub unsafe fn createScene(&mut self) -> *mut filament_Scene {
        filament_Engine_createScene(self)
    }
    #[inline]
    pub unsafe fn createCamera(&mut self, entity: utils_Entity) -> *mut filament_Camera {
        filament_Engine_createCamera(self, entity)
    }
    #[inline]
    pub unsafe fn getCameraComponent(&mut self, entity: utils_Entity) -> *mut filament_Camera {
        filament_Engine_getCameraComponent(self, entity)
    }
    #[inline]
    pub unsafe fn destroyCameraComponent(&mut self, entity: utils_Entity) {
        filament_Engine_destroyCameraComponent(self, entity)
    }
    #[inline]
    pub unsafe fn createFence(&mut self) -> *mut filament_Fence {
        filament_Engine_createFence(self)
    }
    #[inline]
    pub unsafe fn destroy2(&mut self, p: *const filament_BufferObject) -> bool {
        filament_Engine_destroy2(self, p)
    }
    #[inline]
    pub unsafe fn destroy3(&mut self, p: *const filament_VertexBuffer) -> bool {
        filament_Engine_destroy3(self, p)
    }
    #[inline]
    pub unsafe fn destroy4(&mut self, p: *const filament_Fence) -> bool {
        filament_Engine_destroy4(self, p)
    }
    #[inline]
    pub unsafe fn destroy5(&mut self, p: *const filament_IndexBuffer) -> bool {
        filament_Engine_destroy5(self, p)
    }
    #[inline]
    pub unsafe fn destroy6(&mut self, p: *const filament_SkinningBuffer) -> bool {
        filament_Engine_destroy6(self, p)
    }
    #[inline]
    pub unsafe fn destroy7(&mut self, p: *const filament_MorphTargetBuffer) -> bool {
        filament_Engine_destroy7(self, p)
    }
    #[inline]
    pub unsafe fn destroy8(&mut self, p: *const filament_IndirectLight) -> bool {
        filament_Engine_destroy8(self, p)
    }
    #[inline]
    pub unsafe fn destroy9(&mut self, p: *const filament_Material) -> bool {
        filament_Engine_destroy9(self, p)
    }
    #[inline]
    pub unsafe fn destroy10(&mut self, p: *const filament_MaterialInstance) -> bool {
        filament_Engine_destroy10(self, p)
    }
    #[inline]
    pub unsafe fn destroy11(&mut self, p: *const filament_Renderer) -> bool {
        filament_Engine_destroy11(self, p)
    }
    #[inline]
    pub unsafe fn destroy12(&mut self, p: *const filament_Scene) -> bool {
        filament_Engine_destroy12(self, p)
    }
    #[inline]
    pub unsafe fn destroy13(&mut self, p: *const filament_Skybox) -> bool {
        filament_Engine_destroy13(self, p)
    }
    #[inline]
    pub unsafe fn destroy14(&mut self, p: *const filament_ColorGrading) -> bool {
        filament_Engine_destroy14(self, p)
    }
    #[inline]
    pub unsafe fn destroy15(&mut self, p: *const filament_SwapChain) -> bool {
        filament_Engine_destroy15(self, p)
    }
    #[inline]
    pub unsafe fn destroy16(&mut self, p: *const filament_Stream) -> bool {
        filament_Engine_destroy16(self, p)
    }
    #[inline]
    pub unsafe fn destroy17(&mut self, p: *const filament_Texture) -> bool {
        filament_Engine_destroy17(self, p)
    }
    #[inline]
    pub unsafe fn destroy18(&mut self, p: *const filament_RenderTarget) -> bool {
        filament_Engine_destroy18(self, p)
    }
    #[inline]
    pub unsafe fn destroy19(&mut self, p: *const filament_View) -> bool {
        filament_Engine_destroy19(self, p)
    }
    #[inline]
    pub unsafe fn destroy20(&mut self, e: utils_Entity) {
        filament_Engine_destroy20(self, e)
    }
    #[inline]
    pub unsafe fn flushAndWait(&mut self) {
        filament_Engine_flushAndWait(self)
    }
    #[inline]
    pub unsafe fn flush(&mut self) {
        filament_Engine_flush(self)
    }
    #[inline]
    pub unsafe fn pumpMessageQueues(&mut self) {
        filament_Engine_pumpMessageQueues(self)
    }
    #[inline]
    pub unsafe fn getDefaultMaterial(&self) -> *const filament_Material {
        filament_Engine_getDefaultMaterial(self)
    }
    #[inline]
    pub unsafe fn getBackend(&self) -> filament_Engine_Backend {
        filament_Engine_getBackend(self)
    }
    #[inline]
    pub unsafe fn getPlatform(&self) -> *mut filament_Engine_Platform {
        filament_Engine_getPlatform(self)
    }
    #[inline]
    pub unsafe fn streamAlloc(
        &mut self,
        size: size_t,
        alignment: size_t,
    ) -> *mut ::std::os::raw::c_void {
        filament_Engine_streamAlloc(self, size, alignment)
    }
    #[inline]
    pub unsafe fn execute(&mut self) {
        filament_Engine_execute(self)
    }
    #[inline]
    pub unsafe fn getJobSystem(&mut self) -> *mut utils_JobSystem {
        filament_Engine_getJobSystem(self)
    }
    #[inline]
    pub unsafe fn getDebugRegistry(&mut self) -> *mut filament_DebugRegistry {
        filament_Engine_getDebugRegistry(self)
    }
}
#[doc = " Fence is used to synchronize rendering operations together, with the CPU or with compute."]
#[doc = ""]
#[doc = " \\note"]
#[doc = " Currently Fence only provide client-side synchronization."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Default)]
pub struct filament_Fence {
    pub _address: u8,
}
#[doc = " Error codes for Fence::wait()"]
#[doc = " @see Fence, Fence::wait()"]
pub use self::filament_backend_FenceStatus as filament_Fence_FenceStatus;
#[doc = "!< The command stream is flushed"]
pub const filament_Fence_Mode_FLUSH: filament_Fence_Mode = 0;
#[doc = "!< The command stream is not flushed"]
pub const filament_Fence_Mode_DONT_FLUSH: filament_Fence_Mode = 1;
#[doc = " Mode controls the behavior of the command stream when calling wait()"]
#[doc = ""]
#[doc = " @attention"]
#[doc = " It would be unwise to call `wait(..., Mode::DONT_FLUSH)` from the same thread"]
#[doc = " the Fence was created, as it would most certainly create a dead-lock."]
pub type filament_Fence_Mode = u8;
extern "C" {
    #[doc = "! Special \\p timeout value to disable wait()'s timeout."]
    #[link_name = "\u{1}_ZN8filament5Fence19FENCE_WAIT_FOR_EVERE"]
    pub static filament_Fence_FENCE_WAIT_FOR_EVER: u64;
}
#[test]
fn bindgen_test_layout_filament_Fence() {
    assert_eq!(
        ::std::mem::size_of::<filament_Fence>(),
        1usize,
        concat!("Size of: ", stringify!(filament_Fence))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_Fence>(),
        1usize,
        concat!("Alignment of ", stringify!(filament_Fence))
    );
}
extern "C" {
    #[doc = " Client-side wait on the Fence."]
    #[doc = ""]
    #[doc = " Blocks the current thread until the Fence signals."]
    #[doc = ""]
    #[doc = " @param mode      Whether the command stream is flushed before waiting or not."]
    #[doc = " @param timeout   Wait time out. Using a \\p timeout of 0 is a way to query the state of the fence."]
    #[doc = "                  A \\p timeout value of FENCE_WAIT_FOR_EVER is used to disable the timeout."]
    #[doc = " @return          FenceStatus::CONDITION_SATISFIED on success,"]
    #[doc = "                  FenceStatus::TIMEOUT_EXPIRED if the time out expired or"]
    #[doc = "                  FenceStatus::ERROR in other cases."]
    #[doc = " @see #Mode"]
    #[link_name = "\u{1}_ZN8filament5Fence4waitENS0_4ModeEm"]
    pub fn filament_Fence_wait(
        this: *mut filament_Fence,
        mode: filament_Fence_Mode,
        timeout: u64,
    ) -> filament_Fence_FenceStatus;
}
extern "C" {
    #[doc = " Client-side wait on a Fence and destroy the Fence."]
    #[doc = ""]
    #[doc = " @param fence Fence object to wait on."]
    #[doc = ""]
    #[doc = " @param mode  Whether the command stream is flushed before waiting or not."]
    #[doc = ""]
    #[doc = " @return  FenceStatus::CONDITION_SATISFIED on success,"]
    #[doc = "          FenceStatus::ERROR otherwise."]
    #[link_name = "\u{1}_ZN8filament5Fence14waitAndDestroyEPS0_NS0_4ModeE"]
    pub fn filament_Fence_waitAndDestroy(
        fence: *mut filament_Fence,
        mode: filament_Fence_Mode,
    ) -> filament_Fence_FenceStatus;
}
impl filament_Fence {
    #[inline]
    pub unsafe fn wait(
        &mut self,
        mode: filament_Fence_Mode,
        timeout: u64,
    ) -> filament_Fence_FenceStatus {
        filament_Fence_wait(self, mode, timeout)
    }
    #[inline]
    pub unsafe fn waitAndDestroy(
        fence: *mut filament_Fence,
        mode: filament_Fence_Mode,
    ) -> filament_Fence_FenceStatus {
        filament_Fence_waitAndDestroy(fence, mode)
    }
}
#[doc = " A frustum defined by six planes"]
#[repr(C)]
pub struct filament_Frustum {
    pub mPlanes: [filament_math_float4; 6usize],
}
pub const filament_Frustum_Plane_LEFT: filament_Frustum_Plane = 0;
pub const filament_Frustum_Plane_RIGHT: filament_Frustum_Plane = 1;
pub const filament_Frustum_Plane_BOTTOM: filament_Frustum_Plane = 2;
pub const filament_Frustum_Plane_TOP: filament_Frustum_Plane = 3;
pub const filament_Frustum_Plane_FAR: filament_Frustum_Plane = 4;
pub const filament_Frustum_Plane_NEAR: filament_Frustum_Plane = 5;
pub type filament_Frustum_Plane = u8;
#[test]
fn bindgen_test_layout_filament_Frustum() {
    assert_eq!(
        ::std::mem::size_of::<filament_Frustum>(),
        96usize,
        concat!("Size of: ", stringify!(filament_Frustum))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_Frustum>(),
        4usize,
        concat!("Alignment of ", stringify!(filament_Frustum))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<filament_Frustum>())).mPlanes as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_Frustum),
            "::",
            stringify!(mPlanes)
        )
    );
}
extern "C" {
    #[doc = " Sets the frustum from the given projection matrix"]
    #[doc = " @param pv a 4x4 projection matrix"]
    #[link_name = "\u{1}_ZN8filament7Frustum13setProjectionERKNS_4math7details6TMat44IfEE"]
    pub fn filament_Frustum_setProjection(
        this: *mut filament_Frustum,
        pv: *const filament_math_mat4f,
    );
}
extern "C" {
    #[doc = " Returns the plane equation parameters with normalized normals"]
    #[doc = " @param plane Identifier of the plane to retrieve the equation of"]
    #[doc = " @return A plane equation encoded a float4 R such as R.x*x + R.y*y + R.z*z + R.w = 0"]
    #[link_name = "\u{1}_ZNK8filament7Frustum18getNormalizedPlaneENS0_5PlaneE"]
    pub fn filament_Frustum_getNormalizedPlane(
        this: *const filament_Frustum,
        plane: filament_Frustum_Plane,
    ) -> filament_math_float4;
}
extern "C" {
    #[doc = " Returns a copy of all six frustum planes in left, right, bottom, top, far, near order"]
    #[doc = " @param planes six plane equations encoded as in getNormalizedPlane() in"]
    #[doc = "              left, right, bottom, top, far, near order"]
    #[link_name = "\u{1}_ZNK8filament7Frustum19getNormalizedPlanesEPNS_4math7details5TVec4IfEE"]
    pub fn filament_Frustum_getNormalizedPlanes(
        this: *const filament_Frustum,
        planes: *mut filament_math_float4,
    );
}
extern "C" {
    #[doc = " Returns whether a box intersects the frustum (i.e. is visible)"]
    #[doc = " @param box The box to test against the frustum"]
    #[doc = " @return true if the box may intersects the frustum, false otherwise. In some situations"]
    #[doc = " a box that doesn't intersect the frustum might be reported as though it does. However,"]
    #[doc = " a box that does intersect the frustum is always reported correctly (true)."]
    #[link_name = "\u{1}_ZNK8filament7Frustum10intersectsERKNS_3BoxE"]
    pub fn filament_Frustum_intersects(
        this: *const filament_Frustum,
        box_: *const filament_Box,
    ) -> bool;
}
extern "C" {
    #[doc = " Returns whether a sphere intersects the frustum (i.e. is visible)"]
    #[doc = " @param sphere A sphere encoded as a center + radius."]
    #[doc = " @return true if the sphere may intersects the frustum, false otherwise. In some situations"]
    #[doc = " a sphere that doesn't intersect the frustum might be reported as though it does. However,"]
    #[doc = " a sphere that does intersect the frustum is always reported correctly (true)."]
    #[link_name = "\u{1}_ZNK8filament7Frustum10intersectsERKNS_4math7details5TVec4IfEE"]
    pub fn filament_Frustum_intersects1(
        this: *const filament_Frustum,
        sphere: *const filament_math_float4,
    ) -> bool;
}
extern "C" {
    #[doc = " Returns whether the frustum contains a given point."]
    #[doc = " @param p the point to test"]
    #[doc = " @return the maximum signed distance to the frustum. Negative if p is inside."]
    #[link_name = "\u{1}_ZNK8filament7Frustum8containsENS_4math7details5TVec3IfEE"]
    pub fn filament_Frustum_contains(this: *const filament_Frustum, p: filament_math_float3)
        -> f32;
}
extern "C" {
    #[doc = " Creates a frustum from a projection matrix in GL convention"]
    #[doc = " (usually the projection * view matrix)"]
    #[doc = " @param pv a 4x4 projection matrix in GL convention"]
    #[link_name = "\u{1}_ZN8filament7FrustumC1ERKNS_4math7details6TMat44IfEE"]
    pub fn filament_Frustum_Frustum(this: *mut filament_Frustum, pv: *const filament_math_mat4f);
}
extern "C" {
    #[doc = " Creates a frustum from 8 corner coordinates."]
    #[doc = " @param corners the corners of the frustum"]
    #[doc = ""]
    #[doc = " The corners should be specified in this order:"]
    #[doc = " 0. far bottom left"]
    #[doc = " 1. far bottom right"]
    #[doc = " 2. far top left"]
    #[doc = " 3. far top right"]
    #[doc = " 4. near bottom left"]
    #[doc = " 5. near bottom right"]
    #[doc = " 6. near top left"]
    #[doc = " 7. near top right"]
    #[doc = ""]
    #[doc = "     2----3"]
    #[doc = "    /|   /|"]
    #[doc = "   6----7 |"]
    #[doc = "   | 0--|-1      far"]
    #[doc = "   |/   |/       /"]
    #[doc = "   4----5      near"]
    #[doc = ""]
    #[link_name = "\u{1}_ZN8filament7FrustumC1EPKNS_4math7details5TVec3IfEE"]
    pub fn filament_Frustum_Frustum1(
        this: *mut filament_Frustum,
        corners: *const filament_math_float3,
    );
}
impl Default for filament_Frustum {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl filament_Frustum {
    #[inline]
    pub unsafe fn setProjection(&mut self, pv: *const filament_math_mat4f) {
        filament_Frustum_setProjection(self, pv)
    }
    #[inline]
    pub unsafe fn getNormalizedPlane(&self, plane: filament_Frustum_Plane) -> filament_math_float4 {
        filament_Frustum_getNormalizedPlane(self, plane)
    }
    #[inline]
    pub unsafe fn getNormalizedPlanes(&self, planes: *mut filament_math_float4) {
        filament_Frustum_getNormalizedPlanes(self, planes)
    }
    #[inline]
    pub unsafe fn intersects(&self, box_: *const filament_Box) -> bool {
        filament_Frustum_intersects(self, box_)
    }
    #[inline]
    pub unsafe fn intersects1(&self, sphere: *const filament_math_float4) -> bool {
        filament_Frustum_intersects1(self, sphere)
    }
    #[inline]
    pub unsafe fn contains(&self, p: filament_math_float3) -> f32 {
        filament_Frustum_contains(self, p)
    }
    #[inline]
    pub unsafe fn new(pv: *const filament_math_mat4f) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_Frustum_Frustum(__bindgen_tmp.as_mut_ptr(), pv);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(corners: *const filament_math_float3) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_Frustum_Frustum1(__bindgen_tmp.as_mut_ptr(), corners);
        __bindgen_tmp.assume_init()
    }
}
#[doc = " A buffer containing vertex indices into a VertexBuffer. Indices can be 16 or 32 bit."]
#[doc = " The buffer itself is a GPU resource, therefore mutating the data can be relatively slow."]
#[doc = " Typically these buffers are constant."]
#[doc = ""]
#[doc = " It is possible, and even encouraged, to use a single index buffer for several Renderables."]
#[doc = ""]
#[doc = " @see VertexBuffer, RenderableManager"]
#[repr(C)]
#[derive(Debug, Default)]
pub struct filament_IndexBuffer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filament_IndexBuffer_BuilderDetails {
    _unused: [u8; 0],
}
#[doc = " A CPU memory-buffer descriptor, typically used to transfer data from the CPU to the GPU."]
#[doc = ""]
#[doc = " A BufferDescriptor owns the memory buffer it references, therefore BufferDescriptor cannot"]
#[doc = " be copied, but can be moved."]
#[doc = ""]
#[doc = " BufferDescriptor releases ownership of the memory-buffer when it's destroyed."]
pub type filament_IndexBuffer_BufferDescriptor = filament_backend_BufferDescriptor;
#[doc = "!< 16-bit indices"]
pub const filament_IndexBuffer_IndexType_USHORT: filament_IndexBuffer_IndexType = 12;
#[doc = "!< 32-bit indices"]
pub const filament_IndexBuffer_IndexType_UINT: filament_IndexBuffer_IndexType = 17;
#[doc = " Type of the index buffer"]
pub type filament_IndexBuffer_IndexType = u8;
#[repr(C)]
#[derive(Debug)]
pub struct filament_IndexBuffer_Builder {
    pub _base: filament_BuilderBase<filament_IndexBuffer_BuilderDetails>,
}
#[test]
fn bindgen_test_layout_filament_IndexBuffer_Builder() {
    assert_eq!(
        ::std::mem::size_of::<filament_IndexBuffer_Builder>(),
        8usize,
        concat!("Size of: ", stringify!(filament_IndexBuffer_Builder))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_IndexBuffer_Builder>(),
        8usize,
        concat!("Alignment of ", stringify!(filament_IndexBuffer_Builder))
    );
}
extern "C" {
    #[doc = " Size of the index buffer in elements."]
    #[doc = " @param indexCount Number of indices the IndexBuffer can hold."]
    #[doc = " @return A reference to this Builder for chaining calls."]
    #[link_name = "\u{1}_ZN8filament11IndexBuffer7Builder10indexCountEj"]
    pub fn filament_IndexBuffer_Builder_indexCount(
        this: *mut filament_IndexBuffer_Builder,
        indexCount: u32,
    ) -> *mut filament_IndexBuffer_Builder;
}
extern "C" {
    #[doc = " Type of the index buffer, 16-bit or 32-bit."]
    #[doc = " @param indexType Type of indices stored in the IndexBuffer."]
    #[doc = " @return A reference to this Builder for chaining calls."]
    #[link_name = "\u{1}_ZN8filament11IndexBuffer7Builder10bufferTypeENS0_9IndexTypeE"]
    pub fn filament_IndexBuffer_Builder_bufferType(
        this: *mut filament_IndexBuffer_Builder,
        indexType: filament_IndexBuffer_IndexType,
    ) -> *mut filament_IndexBuffer_Builder;
}
extern "C" {
    #[doc = " Creates the IndexBuffer object and returns a pointer to it. After creation, the index"]
    #[doc = " buffer is uninitialized. Use IndexBuffer::setBuffer() to initialize the IndexBuffer."]
    #[doc = ""]
    #[doc = " @param engine Reference to the filament::Engine to associate this IndexBuffer with."]
    #[doc = ""]
    #[doc = " @return pointer to the newly created object or nullptr if exceptions are disabled and"]
    #[doc = "         an error occurred."]
    #[doc = ""]
    #[doc = " @exception utils::PostConditionPanic if a runtime error occurred, such as running out of"]
    #[doc = "            memory or other resources."]
    #[doc = " @exception utils::PreConditionPanic if a parameter to a builder function was invalid."]
    #[doc = ""]
    #[doc = " @see IndexBuffer::setBuffer"]
    #[link_name = "\u{1}_ZN8filament11IndexBuffer7Builder5buildERNS_6EngineE"]
    pub fn filament_IndexBuffer_Builder_build(
        this: *mut filament_IndexBuffer_Builder,
        engine: *mut filament_Engine,
    ) -> *mut filament_IndexBuffer;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament11IndexBuffer7BuilderC1Ev"]
    pub fn filament_IndexBuffer_Builder_Builder(this: *mut filament_IndexBuffer_Builder);
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament11IndexBuffer7BuilderC1ERKS1_"]
    pub fn filament_IndexBuffer_Builder_Builder1(
        this: *mut filament_IndexBuffer_Builder,
        rhs: *const filament_IndexBuffer_Builder,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament11IndexBuffer7BuilderC1EOS1_"]
    pub fn filament_IndexBuffer_Builder_Builder2(
        this: *mut filament_IndexBuffer_Builder,
        rhs: *mut filament_IndexBuffer_Builder,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament11IndexBuffer7BuilderD1Ev"]
    pub fn filament_IndexBuffer_Builder_Builder_destructor(this: *mut filament_IndexBuffer_Builder);
}
impl Default for filament_IndexBuffer_Builder {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl filament_IndexBuffer_Builder {
    #[inline]
    pub unsafe fn indexCount(&mut self, indexCount: u32) -> *mut filament_IndexBuffer_Builder {
        filament_IndexBuffer_Builder_indexCount(self, indexCount)
    }
    #[inline]
    pub unsafe fn bufferType(
        &mut self,
        indexType: filament_IndexBuffer_IndexType,
    ) -> *mut filament_IndexBuffer_Builder {
        filament_IndexBuffer_Builder_bufferType(self, indexType)
    }
    #[inline]
    pub unsafe fn build(&mut self, engine: *mut filament_Engine) -> *mut filament_IndexBuffer {
        filament_IndexBuffer_Builder_build(self, engine)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_IndexBuffer_Builder_Builder(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(rhs: *const filament_IndexBuffer_Builder) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_IndexBuffer_Builder_Builder1(__bindgen_tmp.as_mut_ptr(), rhs);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(rhs: *mut filament_IndexBuffer_Builder) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_IndexBuffer_Builder_Builder2(__bindgen_tmp.as_mut_ptr(), rhs);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        filament_IndexBuffer_Builder_Builder_destructor(self)
    }
}
#[test]
fn bindgen_test_layout_filament_IndexBuffer() {
    assert_eq!(
        ::std::mem::size_of::<filament_IndexBuffer>(),
        1usize,
        concat!("Size of: ", stringify!(filament_IndexBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_IndexBuffer>(),
        1usize,
        concat!("Alignment of ", stringify!(filament_IndexBuffer))
    );
}
extern "C" {
    #[doc = " Asynchronously copy-initializes a region of this IndexBuffer from the data provided."]
    #[doc = ""]
    #[doc = " @param engine Reference to the filament::Engine to associate this IndexBuffer with."]
    #[doc = " @param buffer A BufferDescriptor representing the data used to initialize the IndexBuffer."]
    #[doc = "               BufferDescriptor points to raw, untyped data that will be interpreted as"]
    #[doc = "               either 16-bit or 32-bits indices based on the Type of this IndexBuffer."]
    #[doc = " @param byteOffset Offset in *bytes* into the IndexBuffer"]
    #[link_name = "\u{1}_ZN8filament11IndexBuffer9setBufferERNS_6EngineEONS_7backend16BufferDescriptorEj"]
    pub fn filament_IndexBuffer_setBuffer(
        this: *mut filament_IndexBuffer,
        engine: *mut filament_Engine,
        buffer: *mut filament_IndexBuffer_BufferDescriptor,
        byteOffset: u32,
    );
}
extern "C" {
    #[doc = " Returns the size of this IndexBuffer in elements."]
    #[doc = " @return The number of indices the IndexBuffer holds."]
    #[link_name = "\u{1}_ZNK8filament11IndexBuffer13getIndexCountEv"]
    pub fn filament_IndexBuffer_getIndexCount(this: *const filament_IndexBuffer) -> size_t;
}
impl filament_IndexBuffer {
    #[inline]
    pub unsafe fn setBuffer(
        &mut self,
        engine: *mut filament_Engine,
        buffer: *mut filament_IndexBuffer_BufferDescriptor,
        byteOffset: u32,
    ) {
        filament_IndexBuffer_setBuffer(self, engine, buffer, byteOffset)
    }
    #[inline]
    pub unsafe fn getIndexCount(&self) -> size_t {
        filament_IndexBuffer_getIndexCount(self)
    }
}
#[doc = " IndirectLight is used to simulate environment lighting, a form of global illumination."]
#[doc = ""]
#[doc = " Environment lighting has a two components:"]
#[doc = "  1. irradiance"]
#[doc = "  2. reflections (specular component)"]
#[doc = ""]
#[doc = " Environments are usually captured as high-resolution HDR equirectangular images and processed"]
#[doc = " by the **cmgen** tool to generate the data needed by IndirectLight."]
#[doc = ""]
#[doc = " @note"]
#[doc = " Currently IndirectLight is intended to be used for \"distant probes\", that is, to represent"]
#[doc = " global illumination from a distant (i.e. at infinity) environment, such as the sky or distant"]
#[doc = " mountains. Only a single IndirectLight can be used in a Scene. This limitation will be lifted"]
#[doc = " in the future."]
#[doc = ""]
#[doc = " Creation and destruction"]
#[doc = " ========================"]
#[doc = ""]
#[doc = " An IndirectLight object is created using the IndirectLight::Builder and destroyed by calling"]
#[doc = " Engine::destroy(const IndirectLight*)."]
#[doc = ""]
#[doc = " ~~~~~~~~~~~{.cpp}"]
#[doc = "  filament::Engine* engine = filament::Engine::create();"]
#[doc = ""]
#[doc = "  filament::IndirectLight* environment = filament::IndirectLight::Builder()"]
#[doc = "              .reflections(cubemap)"]
#[doc = "              .build(*engine);"]
#[doc = ""]
#[doc = "  engine->destroy(environment);"]
#[doc = " ~~~~~~~~~~~"]
#[doc = ""]
#[doc = ""]
#[doc = " Irradiance"]
#[doc = " =========="]
#[doc = ""]
#[doc = " The irradiance represents the light that comes from the environment and shines an"]
#[doc = " object's surface."]
#[doc = ""]
#[doc = " The irradiance is calculated automatically from the Reflections (see below), and generally"]
#[doc = " doesn't need to be provided explicitly.  However, it can be provided separately from the"]
#[doc = " Reflections as"]
#[doc = " [spherical harmonics](https://en.wikipedia.org/wiki/Spherical_harmonics) (SH) of 1, 2 or"]
#[doc = " 3 bands, respectively 1, 4 or 9 coefficients."]
#[doc = ""]
#[doc = " @note"]
#[doc = " Use the **cmgen** tool to generate the `SH` for a given environment."]
#[doc = ""]
#[doc = " Reflections"]
#[doc = " ==========="]
#[doc = ""]
#[doc = " The reflections on object surfaces (specular component) is calculated from a specially"]
#[doc = " filtered cubemap pyramid generated by the **cmgen** tool."]
#[doc = ""]
#[doc = ""]
#[doc = " @see Scene, Light, Texture, Skybox"]
#[repr(C)]
#[derive(Debug, Default)]
pub struct filament_IndirectLight {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filament_IndirectLight_BuilderDetails {
    _unused: [u8; 0],
}
#[doc = "! Use Builder to construct an IndirectLight object instance"]
#[repr(C)]
#[derive(Debug)]
pub struct filament_IndirectLight_Builder {
    pub _base: filament_BuilderBase<filament_IndirectLight_BuilderDetails>,
}
#[test]
fn bindgen_test_layout_filament_IndirectLight_Builder() {
    assert_eq!(
        ::std::mem::size_of::<filament_IndirectLight_Builder>(),
        8usize,
        concat!("Size of: ", stringify!(filament_IndirectLight_Builder))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_IndirectLight_Builder>(),
        8usize,
        concat!("Alignment of ", stringify!(filament_IndirectLight_Builder))
    );
}
extern "C" {
    #[doc = " Set the reflections cubemap mipmap chain."]
    #[doc = ""]
    #[doc = " @param cubemap   A mip-mapped cubemap generated by **cmgen**. Each cubemap level"]
    #[doc = "                  encodes a the irradiance for a roughness level."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[doc = ""]
    #[link_name = "\u{1}_ZN8filament13IndirectLight7Builder11reflectionsEPKNS_7TextureE"]
    pub fn filament_IndirectLight_Builder_reflections(
        this: *mut filament_IndirectLight_Builder,
        cubemap: *const filament_Texture,
    ) -> *mut filament_IndirectLight_Builder;
}
extern "C" {
    #[doc = " Sets the irradiance as Spherical Harmonics."]
    #[doc = ""]
    #[doc = " The irradiance must be pre-convolved by \\f$ \\langle n \\cdot l \\rangle \\f$ and"]
    #[doc = " pre-multiplied by the Lambertian diffuse BRDF \\f$ \\frac{1}{\\pi} \\f$ and"]
    #[doc = " specified as Spherical Harmonics coefficients."]
    #[doc = ""]
    #[doc = " Additionally, these Spherical Harmonics coefficients must be pre-scaled by the"]
    #[doc = " reconstruction factors \\f$ A_{l}^{m} \\f$ below."]
    #[doc = ""]
    #[doc = " The final coefficients can be generated using the `cmgen` tool."]
    #[doc = ""]
    #[doc = " The index in the \\p sh array is given by:"]
    #[doc = ""]
    #[doc = "  `index(l, m) = l * (l + 1) + m`"]
    #[doc = ""]
    #[doc = "  \\f$ sh[index(l,m)] = L_{l}^{m} \\frac{1}{\\pi} A_{l}^{m} \\hat{C_{l}} \\f$"]
    #[doc = ""]
    #[doc = "   index |  l  |  m  |  \\f$ A_{l}^{m} \\f$ |  \\f$ \\hat{C_{l}} \\f$  |  \\f$ \\frac{1}{\\pi} A_{l}^{m}\\hat{C_{l}} \\f$ |"]
    #[doc = "  :-----:|:---:|:---:|:------------------:|:---------------------:|:--------------------------------------------:"]
    #[doc = "     0   |  0  |  0  |      0.282095      |       3.1415926       |   0.282095"]
    #[doc = "     1   |  1  | -1  |     -0.488602      |       2.0943951       |  -0.325735"]
    #[doc = "     2   |  ^  |  0  |      0.488602      |       ^               |   0.325735"]
    #[doc = "     3   |  ^  |  1  |     -0.488602      |       ^               |  -0.325735"]
    #[doc = "     4   |  2  | -2  |      1.092548      |       0.785398        |   0.273137"]
    #[doc = "     5   |  ^  | -1  |     -1.092548      |       ^               |  -0.273137"]
    #[doc = "     6   |  ^  |  0  |      0.315392      |       ^               |   0.078848"]
    #[doc = "     7   |  ^  |  1  |     -1.092548      |       ^               |  -0.273137"]
    #[doc = "     8   |  ^  |  2  |      0.546274      |       ^               |   0.136569"]
    #[doc = ""]
    #[doc = ""]
    #[doc = " Only 1, 2 or 3 bands are allowed."]
    #[doc = ""]
    #[doc = " @param bands     Number of spherical harmonics bands. Must be 1, 2 or 3."]
    #[doc = " @param sh        Array containing the spherical harmonics coefficients."]
    #[doc = "                  The size of the array must be \\f$ bands^{2} \\f$."]
    #[doc = "                  (i.e. 1, 4 or 9 coefficients respectively)."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[doc = ""]
    #[doc = " @note"]
    #[doc = " Because the coefficients are pre-scaled, `sh[0]` is the environment's"]
    #[doc = " average irradiance."]
    #[link_name = "\u{1}_ZN8filament13IndirectLight7Builder10irradianceEhPKNS_4math7details5TVec3IfEE"]
    pub fn filament_IndirectLight_Builder_irradiance(
        this: *mut filament_IndirectLight_Builder,
        bands: u8,
        sh: *const filament_math_float3,
    ) -> *mut filament_IndirectLight_Builder;
}
extern "C" {
    #[doc = " Sets the irradiance from the radiance expressed as Spherical Harmonics."]
    #[doc = ""]
    #[doc = " The radiance must be specified as Spherical Harmonics coefficients \\f$ L_{l}^{m} \\f$"]
    #[doc = ""]
    #[doc = " The index in the \\p sh array is given by:"]
    #[doc = ""]
    #[doc = "  `index(l, m) = l * (l + 1) + m`"]
    #[doc = ""]
    #[doc = "  \\f$ sh[index(l,m)] = L_{l}^{m} \\f$"]
    #[doc = ""]
    #[doc = "   index |  l  |  m"]
    #[doc = "  :-----:|:---:|:---:"]
    #[doc = "     0   |  0  |  0"]
    #[doc = "     1   |  1  | -1"]
    #[doc = "     2   |  ^  |  0"]
    #[doc = "     3   |  ^  |  1"]
    #[doc = "     4   |  2  | -2"]
    #[doc = "     5   |  ^  | -1"]
    #[doc = "     6   |  ^  |  0"]
    #[doc = "     7   |  ^  |  1"]
    #[doc = "     8   |  ^  |  2"]
    #[doc = ""]
    #[doc = " @param bands     Number of spherical harmonics bands. Must be 1, 2 or 3."]
    #[doc = " @param sh        Array containing the spherical harmonics coefficients."]
    #[doc = "                  The size of the array must be \\f$ bands^{2} \\f$."]
    #[doc = "                  (i.e. 1, 4 or 9 coefficients respectively)."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[link_name = "\u{1}_ZN8filament13IndirectLight7Builder8radianceEhPKNS_4math7details5TVec3IfEE"]
    pub fn filament_IndirectLight_Builder_radiance(
        this: *mut filament_IndirectLight_Builder,
        bands: u8,
        sh: *const filament_math_float3,
    ) -> *mut filament_IndirectLight_Builder;
}
extern "C" {
    #[doc = " Sets the irradiance as a cubemap."]
    #[doc = ""]
    #[doc = " The irradiance can alternatively be specified as a cubemap instead of Spherical"]
    #[doc = " Harmonics coefficients. It may or may not be more efficient, depending on your"]
    #[doc = " hardware (essentially, it's trading ALU for bandwidth)."]
    #[doc = ""]
    #[doc = " @param cubemap   Cubemap representing the Irradiance pre-convolved by"]
    #[doc = "                  \\f$ \\langle n \\cdot l \\rangle \\f$."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[doc = ""]
    #[doc = " @note"]
    #[doc = " This irradiance cubemap can be generated with the **cmgen** tool."]
    #[doc = ""]
    #[doc = " @see irradiance(uint8_t bands, math::float3 const* sh)"]
    #[link_name = "\u{1}_ZN8filament13IndirectLight7Builder10irradianceEPKNS_7TextureE"]
    pub fn filament_IndirectLight_Builder_irradiance1(
        this: *mut filament_IndirectLight_Builder,
        cubemap: *const filament_Texture,
    ) -> *mut filament_IndirectLight_Builder;
}
extern "C" {
    #[doc = " (optional) Environment intensity."]
    #[doc = ""]
    #[doc = " Because the environment is encoded usually relative to some reference, the"]
    #[doc = " range can be adjusted with this method."]
    #[doc = ""]
    #[doc = " @param envIntensity  Scale factor applied to the environment and irradiance such that"]
    #[doc = "                      the result is in lux, or lumen/m^2 (default = 30000)"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[link_name = "\u{1}_ZN8filament13IndirectLight7Builder9intensityEf"]
    pub fn filament_IndirectLight_Builder_intensity(
        this: *mut filament_IndirectLight_Builder,
        envIntensity: f32,
    ) -> *mut filament_IndirectLight_Builder;
}
extern "C" {
    #[doc = " Specifies the rigid-body transformation to apply to the IBL."]
    #[doc = ""]
    #[doc = " @param rotation 3x3 rotation matrix. Must be a rigid-body transform."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[link_name = "\u{1}_ZN8filament13IndirectLight7Builder8rotationERKNS_4math7details6TMat33IfEE"]
    pub fn filament_IndirectLight_Builder_rotation(
        this: *mut filament_IndirectLight_Builder,
        rotation: *const filament_math_mat3f,
    ) -> *mut filament_IndirectLight_Builder;
}
extern "C" {
    #[doc = " Creates the IndirectLight object and returns a pointer to it."]
    #[doc = ""]
    #[doc = " @param engine Reference to the filament::Engine to associate this IndirectLight with."]
    #[doc = ""]
    #[doc = " @return pointer to the newly created object or nullptr if exceptions are disabled and"]
    #[doc = "         an error occurred."]
    #[doc = ""]
    #[doc = " @exception utils::PostConditionPanic if a runtime error occurred, such as running out of"]
    #[doc = "            memory or other resources."]
    #[doc = " @exception utils::PreConditionPanic if a parameter to a builder function was invalid."]
    #[link_name = "\u{1}_ZN8filament13IndirectLight7Builder5buildERNS_6EngineE"]
    pub fn filament_IndirectLight_Builder_build(
        this: *mut filament_IndirectLight_Builder,
        engine: *mut filament_Engine,
    ) -> *mut filament_IndirectLight;
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament13IndirectLight7BuilderC1Ev"]
    pub fn filament_IndirectLight_Builder_Builder(this: *mut filament_IndirectLight_Builder);
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament13IndirectLight7BuilderC1ERKS1_"]
    pub fn filament_IndirectLight_Builder_Builder1(
        this: *mut filament_IndirectLight_Builder,
        rhs: *const filament_IndirectLight_Builder,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament13IndirectLight7BuilderC1EOS1_"]
    pub fn filament_IndirectLight_Builder_Builder2(
        this: *mut filament_IndirectLight_Builder,
        rhs: *mut filament_IndirectLight_Builder,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8filament13IndirectLight7BuilderD1Ev"]
    pub fn filament_IndirectLight_Builder_Builder_destructor(
        this: *mut filament_IndirectLight_Builder,
    );
}
impl Default for filament_IndirectLight_Builder {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl filament_IndirectLight_Builder {
    #[inline]
    pub unsafe fn reflections(
        &mut self,
        cubemap: *const filament_Texture,
    ) -> *mut filament_IndirectLight_Builder {
        filament_IndirectLight_Builder_reflections(self, cubemap)
    }
    #[inline]
    pub unsafe fn irradiance(
        &mut self,
        bands: u8,
        sh: *const filament_math_float3,
    ) -> *mut filament_IndirectLight_Builder {
        filament_IndirectLight_Builder_irradiance(self, bands, sh)
    }
    #[inline]
    pub unsafe fn radiance(
        &mut self,
        bands: u8,
        sh: *const filament_math_float3,
    ) -> *mut filament_IndirectLight_Builder {
        filament_IndirectLight_Builder_radiance(self, bands, sh)
    }
    #[inline]
    pub unsafe fn irradiance1(
        &mut self,
        cubemap: *const filament_Texture,
    ) -> *mut filament_IndirectLight_Builder {
        filament_IndirectLight_Builder_irradiance1(self, cubemap)
    }
    #[inline]
    pub unsafe fn intensity(&mut self, envIntensity: f32) -> *mut filament_IndirectLight_Builder {
        filament_IndirectLight_Builder_intensity(self, envIntensity)
    }
    #[inline]
    pub unsafe fn rotation(
        &mut self,
        rotation: *const filament_math_mat3f,
    ) -> *mut filament_IndirectLight_Builder {
        filament_IndirectLight_Builder_rotation(self, rotation)
    }
    #[inline]
    pub unsafe fn build(&mut self, engine: *mut filament_Engine) -> *mut filament_IndirectLight {
        filament_IndirectLight_Builder_build(self, engine)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_IndirectLight_Builder_Builder(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(rhs: *const filament_IndirectLight_Builder) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_IndirectLight_Builder_Builder1(__bindgen_tmp.as_mut_ptr(), rhs);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(rhs: *mut filament_IndirectLight_Builder) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        filament_IndirectLight_Builder_Builder2(__bindgen_tmp.as_mut_ptr(), rhs);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        filament_IndirectLight_Builder_Builder_destructor(self)
    }
}
#[test]
fn bindgen_test_layout_filament_IndirectLight() {
    assert_eq!(
        ::std::mem::size_of::<filament_IndirectLight>(),
        1usize,
        concat!("Size of: ", stringify!(filament_IndirectLight))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_IndirectLight>(),
        1usize,
        concat!("Alignment of ", stringify!(filament_IndirectLight))
    );
}
extern "C" {
    #[doc = " Sets the environment's intensity."]
    #[doc = ""]
    #[doc = " Because the environment is encoded usually relative to some reference, the"]
    #[doc = " range can be adjusted with this method."]
    #[doc = ""]
    #[doc = " @param intensity  Scale factor applied to the environment and irradiance such that"]
    #[doc = "                   the result is in lux, or <i>lumen/m^2(default = 30000)"]
    #[link_name = "\u{1}_ZN8filament13IndirectLight12setIntensityEf"]
    pub fn filament_IndirectLight_setIntensity(this: *mut filament_IndirectLight, intensity: f32);
}
extern "C" {
    #[doc = " Returns the environment's intensity in <i>lux</i>, or <i>lumen/m^2</i>."]
    #[link_name = "\u{1}_ZNK8filament13IndirectLight12getIntensityEv"]
    pub fn filament_IndirectLight_getIntensity(this: *const filament_IndirectLight) -> f32;
}
extern "C" {
    #[doc = " Sets the rigid-body transformation to apply to the IBL."]
    #[doc = ""]
    #[doc = " @param rotation 3x3 rotation matrix. Must be a rigid-body transform."]
    #[link_name = "\u{1}_ZN8filament13IndirectLight11setRotationERKNS_4math7details6TMat33IfEE"]
    pub fn filament_IndirectLight_setRotation(
        this: *mut filament_IndirectLight,
        rotation: *const filament_math_mat3f,
    );
}
extern "C" {
    #[doc = " Returns the rigid-body transformation applied to the IBL."]
    #[link_name = "\u{1}_ZNK8filament13IndirectLight11getRotationEv"]
    pub fn filament_IndirectLight_getRotation(
        this: *const filament_IndirectLight,
    ) -> *const filament_math_mat3f;
}
extern "C" {
    #[doc = " Returns the associated reflection map, or null if it does not exist."]
    #[link_name = "\u{1}_ZNK8filament13IndirectLight21getReflectionsTextureEv"]
    pub fn filament_IndirectLight_getReflectionsTexture(
        this: *const filament_IndirectLight,
    ) -> *const filament_Texture;
}
extern "C" {
    #[doc = " Returns the associated irradiance map, or null if it does not exist."]
    #[link_name = "\u{1}_ZNK8filament13IndirectLight20getIrradianceTextureEv"]
    pub fn filament_IndirectLight_getIrradianceTexture(
        this: *const filament_IndirectLight,
    ) -> *const filament_Texture;
}
extern "C" {
    #[doc = " Helper to estimate the direction of the dominant light in the environment represented by"]
    #[doc = " spherical harmonics."]
    #[doc = ""]
    #[doc = " This assumes that there is only a single dominant light (such as the sun in outdoors"]
    #[doc = " environments), if it's not the case the direction returned will be an average of the"]
    #[doc = " various lights based on their intensity."]
    #[doc = ""]
    #[doc = " If there are no clear dominant light, as is often the case with low dynamic range (LDR)"]
    #[doc = " environments, this method may return a wrong or unexpected direction."]
    #[doc = ""]
    #[doc = " The dominant light direction can be used to set a directional light's direction,"]
    #[doc = " for instance to produce shadows that match the environment."]
    #[doc = ""]
    #[doc = " @param sh        3-band spherical harmonics"]
    #[doc = ""]
    #[doc = " @return A unit vector representing the direction of the dominant light"]
    #[doc = ""]
    #[doc = " @see LightManager::Builder::direction()"]
    #[doc = " @see getColorEstimate()"]
    #[link_name = "\u{1}_ZN8filament13IndirectLight20getDirectionEstimateEPKNS_4math7details5TVec3IfEE"]
    pub fn filament_IndirectLight_getDirectionEstimate(
        sh: *const filament_math_float3,
    ) -> filament_math_float3;
}
extern "C" {
    #[doc = " Helper to estimate the color and relative intensity of the environment represented by"]
    #[doc = " spherical harmonics in a given direction."]
    #[doc = ""]
    #[doc = " This can be used to set the color and intensity of a directional light. In this case"]
    #[doc = " make sure to multiply this relative intensity by the the intensity of this indirect light."]
    #[doc = ""]
    #[doc = " @param sh        3-band spherical harmonics"]
    #[doc = " @param direction a unit vector representing the direction of the light to estimate the"]
    #[doc = "                  color of. Typically this the value returned by getDirectionEstimate()."]
    #[doc = ""]
    #[doc = " @return A vector of 4 floats where the first 3 components represent the linear color and"]
    #[doc = "         the 4th component represents the intensity of the dominant light"]
    #[doc = ""]
    #[doc = " @see LightManager::Builder::color()"]
    #[doc = " @see LightManager::Builder::intensity()"]
    #[doc = " @see getDirectionEstimate, getIntensity, setIntensity"]
    #[link_name = "\u{1}_ZN8filament13IndirectLight16getColorEstimateEPKNS_4math7details5TVec3IfEES4_"]
    pub fn filament_IndirectLight_getColorEstimate(
        sh: *const filament_math_float3,
        direction: filament_math_float3,
    ) -> filament_math_float4;
}
extern "C" {
    #[doc = " @deprecated use static versions instead"]
    #[link_name = "\u{1}_ZNK8filament13IndirectLight20getDirectionEstimateEv"]
    pub fn filament_IndirectLight_getDirectionEstimate1(
        this: *const filament_IndirectLight,
    ) -> filament_math_float3;
}
extern "C" {
    #[doc = " @deprecated use static versions instead"]
    #[link_name = "\u{1}_ZNK8filament13IndirectLight16getColorEstimateENS_4math7details5TVec3IfEE"]
    pub fn filament_IndirectLight_getColorEstimate1(
        this: *const filament_IndirectLight,
        direction: filament_math_float3,
    ) -> filament_math_float4;
}
impl filament_IndirectLight {
    #[inline]
    pub unsafe fn setIntensity(&mut self, intensity: f32) {
        filament_IndirectLight_setIntensity(self, intensity)
    }
    #[inline]
    pub unsafe fn getIntensity(&self) -> f32 {
        filament_IndirectLight_getIntensity(self)
    }
    #[inline]
    pub unsafe fn setRotation(&mut self, rotation: *const filament_math_mat3f) {
        filament_IndirectLight_setRotation(self, rotation)
    }
    #[inline]
    pub unsafe fn getRotation(&self) -> *const filament_math_mat3f {
        filament_IndirectLight_getRotation(self)
    }
    #[inline]
    pub unsafe fn getReflectionsTexture(&self) -> *const filament_Texture {
        filament_IndirectLight_getReflectionsTexture(self)
    }
    #[inline]
    pub unsafe fn getIrradianceTexture(&self) -> *const filament_Texture {
        filament_IndirectLight_getIrradianceTexture(self)
    }
    #[inline]
    pub unsafe fn getDirectionEstimate(sh: *const filament_math_float3) -> filament_math_float3 {
        filament_IndirectLight_getDirectionEstimate(sh)
    }
    #[inline]
    pub unsafe fn getColorEstimate(
        sh: *const filament_math_float3,
        direction: filament_math_float3,
    ) -> filament_math_float4 {
        filament_IndirectLight_getColorEstimate(sh, direction)
    }
    #[inline]
    pub unsafe fn getDirectionEstimate1(&self) -> filament_math_float3 {
        filament_IndirectLight_getDirectionEstimate1(self)
    }
    #[inline]
    pub unsafe fn getColorEstimate1(
        &self,
        direction: filament_math_float3,
    ) -> filament_math_float4 {
        filament_IndirectLight_getColorEstimate1(self, direction)
    }
}
#[doc = " LightManager allows to create a light source in the scene, such as a sun or street lights."]
#[doc = ""]
#[doc = " At least one light must be added to a scene in order to see anything"]
#[doc = " (unless the Material.Shading.UNLIT is used)."]
#[doc = ""]
#[doc = ""]
#[doc = " Creation and destruction"]
#[doc = " ========================"]
#[doc = ""]
#[doc = " A Light component is created using the LightManager::Builder and destroyed by calling"]
#[doc = " LightManager::destroy(utils::Entity)."]
#[doc = ""]
#[doc = " ~~~~~~~~~~~{.cpp}"]
#[doc = "  filament::Engine* engine = filament::Engine::create();"]
#[doc = "  utils::Entity sun = utils::EntityManager.get().create();"]
#[doc = ""]
#[doc = "  filament::LightManager::Builder(Type::SUN)"]
#[doc = "              .castShadows(true)"]
#[doc = "              .build(*engine, sun);"]
#[doc = ""]
#[doc = "  engine->getLightManager().destroy(sun);"]
#[doc = " ~~~~~~~~~~~"]
#[doc = ""]
#[doc = ""]
#[doc = " Light types"]
#[doc = " ==========="]
#[doc = ""]
#[doc = " Lights come in three flavors:"]
#[doc = " - directional lights"]
#[doc = " - point lights"]
#[doc = " - spot lights"]
#[doc = ""]
#[doc = ""]
#[doc = " Directional lights"]
#[doc = " ------------------"]
#[doc = ""]
#[doc = " Directional lights have a direction, but don't have a position. All light rays are"]
#[doc = " parallel and come from infinitely far away and from everywhere. Typically a directional light"]
#[doc = " is used to simulate the sun."]
#[doc = ""]
#[doc = " Directional lights and spot lights are able to cast shadows."]
#[doc = ""]
#[doc = " To create a directional light use Type.DIRECTIONAL or Type.SUN, both are similar, but the later"]
#[doc = " also draws a sun's disk in the sky and its reflection on glossy objects."]
#[doc = ""]
#[doc = " @warning Currently, only a single directional light is supported. If several directional lights"]
#[doc = " are added to the scene, the dominant one will be used."]
#[doc = ""]
#[doc = " @see Builder.direction(), Builder.sunAngularRadius()"]
#[doc = ""]
#[doc = " Point lights"]
#[doc = " ------------"]
#[doc = ""]
#[doc = " Unlike directional lights, point lights have a position but emit light in all directions."]
#[doc = " The intensity of the light diminishes with the inverse square of the distance to the light."]
#[doc = " Builder.falloff() controls distance beyond which the light has no more influence."]
#[doc = ""]
#[doc = " A scene can have multiple point lights."]
#[doc = ""]
#[doc = " @see Builder.position(), Builder.falloff()"]
#[doc = ""]
#[doc = " Spot lights"]
#[doc = " -----------"]
#[doc = ""]
#[doc = " Spot lights are similar to point lights but the light it emits is limited to a cone defined by"]
#[doc = " Builder.spotLightCone() and the light's direction."]
#[doc = ""]
#[doc = " A spot light is therefore defined by a position, a direction and inner and outer cones. The"]
#[doc = " spot light's influence is limited to inside the outer cone. The inner cone defines the light's"]
#[doc = " falloff attenuation."]
#[doc = ""]
#[doc = " A physically correct spot light is a little difficult to use because changing the outer angle"]
#[doc = " of the cone changes the illumination levels, as the same amount of light is spread over a"]
#[doc = " changing volume. The coupling of illumination and the outer cone means that an artist cannot"]
#[doc = " tweak the influence cone of a spot light without also changing the perceived illumination."]
#[doc = " It therefore makes sense to provide artists with a parameter to disable this coupling. This"]
#[doc = " is the difference between Type.FOCUSED_SPOT and Type.SPOT."]
#[doc = ""]
#[doc = " @see Builder.position(), Builder.direction(), Builder.falloff(), Builder.spotLightCone()"]
#[doc = ""]
#[doc = " Performance considerations"]
#[doc = " =========================="]
#[doc = ""]
#[doc = " Generally, adding lights to the scene hurts performance, however filament is designed to be"]
#[doc = " able to handle hundreds of lights in a scene under certain conditions. Here are some tips"]
#[doc = " to keep performances high."]
#[doc = ""]
#[doc = " 1. Prefer spot lights to point lights and use the smallest outer cone angle possible."]
#[doc = ""]
#[doc = " 2. Use the smallest possible falloff distance for point and spot lights."]
#[doc = "    Performance is very sensitive to overlapping lights. The falloff distance essentially"]
#[doc = "    defines a sphere of influence for the light, so try to position point and spot lights"]
#[doc = "    such that they don't overlap too much."]
#[doc = ""]
#[doc = "    On the other hand, a scene can contain hundreds of non overlapping lights without"]
#[doc = "    incurring a significant overhead."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Default)]
pub struct filament_LightManager {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filament_LightManager_BuilderDetails {
    _unused: [u8; 0],
}
pub type filament_LightManager_Instance = u32;
#[doc = "!< Directional light that also draws a sun's disk in the sky."]
pub const filament_LightManager_Type_SUN: filament_LightManager_Type = 0;
#[doc = "!< Directional light, emits light in a given direction."]
pub const filament_LightManager_Type_DIRECTIONAL: filament_LightManager_Type = 1;
#[doc = "!< Point light, emits light from a position, in all directions."]
pub const filament_LightManager_Type_POINT: filament_LightManager_Type = 2;
#[doc = "!< Physically correct spot light."]
pub const filament_LightManager_Type_FOCUSED_SPOT: filament_LightManager_Type = 3;
#[doc = "!< Spot light with coupling of outer cone and illumination disabled."]
pub const filament_LightManager_Type_SPOT: filament_LightManager_Type = 4;
#[doc = "! Denotes the type of the light being created."]
pub type filament_LightManager_Type = u8;
#[doc = " Control the quality / performance of the shadow map associated to this light"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_LightManager_ShadowOptions {
    #[doc = " Size of the shadow map in texels. Must be a power-of-two and larger or equal to 8."]
    pub mapSize: u32,
    #[doc = " Number of shadow cascades to use for this light. Must be between 1 and 4 (inclusive)."]
    #[doc = " A value greater than 1 turns on cascaded shadow mapping (CSM)."]
    #[doc = " Only applicable to Type.SUN or Type.DIRECTIONAL lights."]
    #[doc = ""]
    #[doc = " When using shadow cascades, cascadeSplitPositions must also be set."]
    #[doc = ""]
    #[doc = " @see ShadowOptions::cascadeSplitPositions"]
    pub shadowCascades: u8,
    #[doc = " The split positions for shadow cascades."]
    #[doc = ""]
    #[doc = " Cascaded shadow mapping (CSM) partitions the camera frustum into cascades. These values"]
    #[doc = " determine the planes along the camera's Z axis to split the frustum. The camera near"]
    #[doc = " plane is represented by 0.0f and the far plane represented by 1.0f."]
    #[doc = ""]
    #[doc = " For example, if using 4 cascades, these values would set a uniform split scheme:"]
    #[doc = " { 0.25f, 0.50f, 0.75f }"]
    #[doc = ""]
    #[doc = " For N cascades, N - 1 split positions will be read from this array."]
    #[doc = ""]
    #[doc = " Filament provides utility methods inside LightManager::ShadowCascades to help set these"]
    #[doc = " values. For example, to use a uniform split scheme:"]
    #[doc = ""]
    #[doc = " ~~~~~~~~~~~{.cpp}"]
    #[doc = "   LightManager::ShadowCascades::computeUniformSplits(options.splitPositions, 4);"]
    #[doc = " ~~~~~~~~~~~"]
    #[doc = ""]
    #[doc = " @see ShadowCascades::computeUniformSplits"]
    #[doc = " @see ShadowCascades::computeLogSplits"]
    #[doc = " @see ShadowCascades::computePracticalSplits"]
    pub cascadeSplitPositions: [f32; 3usize],
    #[doc = " Constant bias in world units (e.g. meters) by which shadows are moved away from the"]
    #[doc = " light. 1mm by default."]
    #[doc = " This is ignored when the View's ShadowType is set to VSM."]
    pub constantBias: f32,
    #[doc = " Amount by which the maximum sampling error is scaled. The resulting value is used"]
    #[doc = " to move the shadow away from the fragment normal. Should be 1.0."]
    #[doc = " This is ignored when the View's ShadowType is set to VSM."]
    pub normalBias: f32,
    #[doc = " Distance from the camera after which shadows are clipped. This is used to clip"]
    #[doc = " shadows that are too far and wouldn't contribute to the scene much, improving"]
    #[doc = " performance and quality. This value is always positive."]
    #[doc = " Use 0.0f to use the camera far distance."]
    pub shadowFar: f32,
    #[doc = " Optimize the quality of shadows from this distance from the camera. Shadows will"]
    #[doc = " be rendered in front of this distance, but the quality may not be optimal."]
    #[doc = " This value is always positive. Use 0.0f to use the camera near distance."]
    #[doc = " The default of 1m works well with many scenes. The quality of shadows may drop"]
    #[doc = " rapidly when this value decreases."]
    pub shadowNearHint: f32,
    #[doc = " Optimize the quality of shadows in front of this distance from the camera. Shadows"]
    #[doc = " will be rendered behind this distance, but the quality may not be optimal."]
    #[doc = " This value is always positive. Use std::numerical_limits<float>::infinity() to"]
    #[doc = " use the camera far distance."]
    pub shadowFarHint: f32,
    #[doc = " Controls whether the shadow map should be optimized for resolution or stability."]
    #[doc = " When set to true, all resolution enhancing features that can affect stability are"]
    #[doc = " disabling, resulting in significantly lower resolution shadows, albeit stable ones."]
    pub stable: bool,
    #[doc = " Constant bias in depth-resolution units by which shadows are moved away from the"]
    #[doc = " light. The default value of 0.5 is used to round depth values up."]
    #[doc = " Generally this value shouldn't be changed or at least be small and positive."]
    #[doc = " This is ignored when the View's ShadowType is set to VSM."]
    pub polygonOffsetConstant: f32,
    #[doc = " Bias based on the change in depth in depth-resolution units by which shadows are moved"]
    #[doc = " away from the light. The default value of 2.0 works well with SHADOW_SAMPLING_PCF_LOW."]
    #[doc = " Generally this value is between 0.5 and the size in texel of the PCF filter."]
    #[doc = " Setting this value correctly is essential for LISPSM shadow-maps."]
    #[doc = " This is ignored when the View's ShadowType is set to VSM."]
    pub polygonOffsetSlope: f32,
    #[doc = " Whether screen-space contact shadows are used. This applies regardless of whether a"]
    #[doc = " Renderable is a shadow caster."]
    #[doc = " Screen-space contact shadows are typically useful in large scenes."]
    #[doc = " (off by default)"]
    pub screenSpaceContactShadows: bool,
    #[doc = " Number of ray-marching steps for screen-space contact shadows (8 by default)."]
    #[doc = ""]
    #[doc = " CAUTION: this parameter is ignored for all lights except the directional/sun light,"]
    #[doc = "          all other lights use the same value set for the directional/sun light."]
    #[doc = ""]
    pub stepCount: u8,
    #[doc = " Maximum shadow-occluder distance for screen-space contact shadows (world units)."]
    #[doc = " (30 cm by default)"]
    #[doc = ""]
    #[doc = " CAUTION: this parameter is ignored for all lights except the directional/sun light,"]
    #[doc = "          all other lights use the same value set for the directional/sun light."]
    #[doc = ""]
    pub maxShadowDistance: f32,
    pub vsm: filament_LightManager_ShadowOptions_Vsm,
    #[doc = " Light bulb radius used for soft shadows. Currently this is only used when DPCF or PCSS is"]
    #[doc = " enabled. (2cm by default)."]
    pub shadowBulbRadius: f32,
}
#[doc = " Options available when the View's ShadowType is set to VSM."]
#[doc = ""]
#[doc = " @warning This API is still experimental and subject to change."]
#[doc = " @see View::setShadowType"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_LightManager_ShadowOptions_Vsm {
    #[doc = " The number of MSAA samples to use when rendering VSM shadow maps."]
    #[doc = " Must be a power-of-two and greater than or equal to 1. A value of 1 effectively turns"]
    #[doc = " off MSAA."]
    #[doc = " Higher values may not be available depending on the underlying hardware."]
    pub msaaSamples: u8,
    #[doc = " Blur width for the VSM blur. Zero do disable."]
    #[doc = " The maximum value is 125."]
    pub blurWidth: f32,
}
#[test]
fn bindgen_test_layout_filament_LightManager_ShadowOptions_Vsm() {
    assert_eq!(
        ::std::mem::size_of::<filament_LightManager_ShadowOptions_Vsm>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(filament_LightManager_ShadowOptions_Vsm)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<filament_LightManager_ShadowOptions_Vsm>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(filament_LightManager_ShadowOptions_Vsm)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions_Vsm>())).msaaSamples
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions_Vsm),
            "::",
            stringify!(msaaSamples)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions_Vsm>())).blurWidth
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions_Vsm),
            "::",
            stringify!(blurWidth)
        )
    );
}
#[test]
fn bindgen_test_layout_filament_LightManager_ShadowOptions() {
    assert_eq!(
        ::std::mem::size_of::<filament_LightManager_ShadowOptions>(),
        72usize,
        concat!("Size of: ", stringify!(filament_LightManager_ShadowOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_LightManager_ShadowOptions>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(filament_LightManager_ShadowOptions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).mapSize as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(mapSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).shadowCascades
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(shadowCascades)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).cascadeSplitPositions
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(cascadeSplitPositions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).constantBias as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(constantBias)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).normalBias as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(normalBias)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).shadowFar as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(shadowFar)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).shadowNearHint
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(shadowNearHint)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).shadowFarHint
                as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(shadowFarHint)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).stable as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(stable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).polygonOffsetConstant
                as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(polygonOffsetConstant)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).polygonOffsetSlope
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(polygonOffsetSlope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>()))
                .screenSpaceContactShadows as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(screenSpaceContactShadows)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).stepCount as *const _
                as usize
        },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(stepCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).maxShadowDistance
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(maxShadowDistance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).vsm as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(vsm)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<filament_LightManager_ShadowOptions>())).shadowBulbRadius
                as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(filament_LightManager_ShadowOptions),
            "::",
            stringify!(shadowBulbRadius)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct filament_LightManager_ShadowCascades {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_filament_LightManager_ShadowCascades() {
    assert_eq!(
        ::std::mem::size_of::<filament_LightManager_ShadowCascades>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(filament_LightManager_ShadowCascades)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<filament_LightManager_ShadowCascades>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(filament_LightManager_ShadowCascades)
        )
    );
}
extern "C" {
    #[doc = " Utility method to compute ShadowOptions::cascadeSplitPositions according to a uniform"]
    #[doc = " split scheme."]
    #[doc = ""]
    #[doc = " @param splitPositions    a float array of at least size (cascades - 1) to write the split"]
    #[doc = "                          positions into"]
    #[doc = " @param cascades          the number of shadow cascades, at most 4"]
    #[link_name = "\u{1}_ZN8filament12LightManager14ShadowCascades20computeUniformSplitsEPfh"]
    pub fn filament_LightManager_ShadowCascades_computeUniformSplits(
        splitPositions: *mut f32,
        cascades: u8,
    );
}
extern "C" {
    #[doc = " Utility method to compute ShadowOptions::cascadeSplitPositions according to a logarithmic"]
    #[doc = " split scheme."]
    #[doc = ""]
    #[doc = " @param splitPositions    a float array of at least size (cascades - 1) to write the split"]
    #[doc = "                          positions into"]
    #[doc = " @param cascades          the number of shadow cascades, at most 4"]
    #[doc = " @param near              the camera near plane"]
    #[doc = " @param far               the camera far plane"]
    #[link_name = "\u{1}_ZN8filament12LightManager14ShadowCascades16computeLogSplitsEPfhff"]
    pub fn filament_LightManager_ShadowCascades_computeLogSplits(
        splitPositions: *mut f32,
        cascades: u8,
        near: f32,
        far: f32,
    );
}
extern "C" {
    #[doc = " Utility method to compute ShadowOptions::cascadeSplitPositions according to a practical"]
    #[doc = " split scheme."]
    #[doc = ""]
    #[doc = " The practical split scheme uses uses a lambda value to interpolate between the logarithmic"]
    #[doc = " and uniform split schemes. Start with a lambda value of 0.5f and adjust for your scene."]
    #[doc = ""]
    #[doc = " See: Zhang et al 2006, \"Parallel-split shadow maps for large-scale virtual environments\""]
    #[doc = ""]
    #[doc = " @param splitPositions    a float array of at least size (cascades - 1) to write the split"]
    #[doc = "                          positions into"]
    #[doc = " @param cascades          the number of shadow cascades, at most 4"]
    #[doc = " @param near              the camera near plane"]
    #[doc = " @param far               the camera far plane"]
    #[doc = " @param lambda            a float in the range [0, 1] that interpolates between log and"]
    #[doc = "                          uniform split schemes"]
    #[link_name = "\u{1}_ZN8filament12LightManager14ShadowCascades22computePracticalSplitsEPfhfff"]
    pub fn filament_LightManager_ShadowCascades_computePracticalSplits(
        splitPositions: *mut f32,
        cascades: u8,
        near: f32,
        far: f32,
        lambda: f32,
    );
}
impl filament_LightManager_ShadowCascades {
    #[inline]
    pub unsafe fn computeUniformSplits(splitPositions: *mut f32, cascades: u8) {
        filament_LightManager_ShadowCascades_computeUniformSplits(splitPositions, cascades)
    }
    #[inline]
    pub unsafe fn computeLogSplits(splitPositions: *mut f32, cascades: u8, near: f32, far: f32) {
        filament_LightManager_ShadowCascades_computeLogSplits(splitPositions, cascades, near, far)
    }
    #[inline]
    pub unsafe fn computePracticalSplits(
        splitPositions: *mut f32,
        cascades: u8,
        near: f32,
        far: f32,
        lambda: f32,
    ) {
        filament_LightManager_ShadowCascades_computePracticalSplits(
            splitPositions,
            cascades,
            near,
            far,
            lambda,
        )
    }
}
#[doc = "! Use Builder to construct a Light object instance"]
#[repr(C)]
#[derive(Debug)]
pub struct filament_LightManager_Builder {
    pub _base: filament_BuilderBase<filament_LightManager_BuilderDetails>,
}
pub const filament_LightManager_Builder_Result_Error: filament_LightManager_Builder_Result = -1;
pub const filament_LightManager_Builder_Result_Success: filament_LightManager_Builder_Result = 0;
pub type filament_LightManager_Builder_Result = ::std::os::raw::c_int;
#[test]
fn bindgen_test_layout_filament_LightManager_Builder() {
    assert_eq!(
        ::std::mem::size_of::<filament_LightManager_Builder>(),
        8usize,
        concat!("Size of: ", stringify!(filament_LightManager_Builder))
    );
    assert_eq!(
        ::std::mem::align_of::<filament_LightManager_Builder>(),
        8usize,
        concat!("Alignment of ", stringify!(filament_LightManager_Builder))
    );
}
extern "C" {
    #[doc = " Enables or disables a light channel. Light channel 0 is enabled by default."]
    #[doc = ""]
    #[doc = " @param channel Light channel to enable or disable, between 0 and 7."]
    #[doc = " @param enable Whether to enable or disable the light channel."]
    #[doc = " @return This Builder, for chaining calls."]
    #[link_name = "\u{1}_ZN8filament12LightManager7Builder12lightChannelEjb"]
    pub fn filament_LightManager_Builder_lightChannel(
        this: *mut filament_LightManager_Builder,
        channel: ::std::os::raw::c_uint,
        enable: bool,
    ) -> *mut filament_LightManager_Builder;
}
extern "C" {
    #[doc = " Whether this Light casts shadows (disabled by default)"]
    #[doc = ""]
    #[doc = " @param enable Enables or disables casting shadows from this Light."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[doc = ""]
    #[doc = " @warning"]
    #[doc = " - Only a Type.DIRECTIONAL, Type.SUN, Type.SPOT, or Type.FOCUSED_SPOT light can cast shadows"]
    #[link_name = "\u{1}_ZN8filament12LightManager7Builder11castShadowsEb"]
    pub fn filament_LightManager_Builder_castShadows(
        this: *mut filament_LightManager_Builder,
        enable: bool,
    ) -> *mut filament_LightManager_Builder;
}
extern "C" {
    #[doc = " Sets the shadow-map options for this light."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[link_name = "\u{1}_ZN8filament12LightManager7Builder13shadowOptionsERKNS0_13ShadowOptionsE"]
    pub fn filament_LightManager_Builder_shadowOptions(
        this: *mut filament_LightManager_Builder,
        options: *const filament_LightManager_ShadowOptions,
    ) -> *mut filament_LightManager_Builder;
}
extern "C" {
    #[doc = " Whether this light casts light (enabled by default)"]
    #[doc = ""]
    #[doc = " @param enable Enables or disables lighting from this Light."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[doc = ""]
    #[doc = " @note"]
    #[doc = " In some situations it can be useful to have a light in the scene that doesn't"]
    #[doc = " actually emit light, but does cast shadows."]
    #[link_name = "\u{1}_ZN8filament12LightManager7Builder9castLightEb"]
    pub fn filament_LightManager_Builder_castLight(
        this: *mut filament_LightManager_Builder,
        enable: bool,
    ) -> *mut filament_LightManager_Builder;
}
extern "C" {
    #[doc = " Sets the initial position of the light in world space."]
    #[doc = ""]
    #[doc = " @param position Light's position in world space. The default is at the origin."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[doc = ""]
    #[doc = " @note"]
    #[doc = " The Light's position is ignored for directional lights (Type.DIRECTIONAL or Type.SUN)"]
    #[link_name = "\u{1}_ZN8filament12LightManager7Builder8positionERKNS_4math7details5TVec3IfEE"]
    pub fn filament_LightManager_Builder_position(
        this: *mut filament_LightManager_Builder,
        position: *const filament_math_float3,
    ) -> *mut filament_LightManager_Builder;
}
extern "C" {
    #[doc = " Sets the initial direction of a light in world space."]
    #[doc = ""]
    #[doc = " @param direction Light's direction in world space. Should be a unit vector."]
    #[doc = "                  The default is {0,-1,0}."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[doc = ""]
    #[doc = " @note"]
    #[doc = " The Light's direction is ignored for Type.POINT lights."]
    #[link_name = "\u{1}_ZN8filament12LightManager7Builder9directionERKNS_4math7details5TVec3IfEE"]
    pub fn filament_LightManager_Builder_direction(
        this: *mut filament_LightManager_Builder,
        direction: *const filament_math_float3,
    ) -> *mut filament_LightManager_Builder;
}
extern "C" {
    #[doc = " Sets the initial color of a light."]
    #[doc = ""]
    #[doc = " @param color Color of the light specified in the linear sRGB color-space."]
    #[doc = "              The default is white {1,1,1}."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[link_name = "\u{1}_ZN8filament12LightManager7Builder5colorERKNS_4math7details5TVec3IfEE"]
    pub fn filament_LightManager_Builder_color(
        this: *mut filament_LightManager_Builder,
        color: *const filament_LinearColor,
    ) -> *mut filament_LightManager_Builder;
}
extern "C" {
    #[doc = " Sets the initial intensity of a light."]
    #[doc = " @param intensity This parameter depends on the Light.Type:"]
    #[doc = "                  - For directional lights, it specifies the illuminance in *lux*"]
    #[doc = "                  (or *lumen/m^2*)."]
    #[doc = "                  - For point lights and spot lights, it specifies the luminous power"]
    #[doc = "                  in *lumen*."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[doc = ""]
    #[doc = " For example, the sun's illuminance is about 100,000 lux."]
    #[doc = ""]
    #[doc = " This method overrides any prior calls to intensity or intensityCandela."]
    #[doc = ""]
    #[link_name = "\u{1}_ZN8filament12LightManager7Builder9intensityEf"]
    pub fn filament_LightManager_Builder_intensity(
        this: *mut filament_LightManager_Builder,
        intensity: f32,
    ) -> *mut filament_LightManager_Builder;
}
extern "C" {
    #[doc = " Sets the initial intensity of a spot or point light in candela."]
    #[doc = ""]
    #[doc = " @param intensity Luminous intensity in *candela*."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[doc = ""]
    #[doc = " @note"]
    #[doc = " This method is equivalent to calling intensity(float intensity) for directional lights"]
    #[doc = " (Type.DIRECTIONAL or Type.SUN)."]
    #[doc = ""]
    #[doc = " This method overrides any prior calls to intensity or intensityCandela."]
    #[link_name = "\u{1}_ZN8filament12LightManager7Builder16intensityCandelaEf"]
    pub fn filament_LightManager_Builder_intensityCandela(
        this: *mut filament_LightManager_Builder,
        intensity: f32,
    ) -> *mut filament_LightManager_Builder;
}
extern "C" {
    #[doc = " Sets the initial intensity of a light in watts."]
    #[doc = ""]
    #[doc = " @param watts         Energy consumed by a lightbulb. It is related to the energy produced"]
    #[doc = "                      and ultimately the brightness by the \\p efficiency parameter."]
    #[doc = "                      This value is often available on the packaging of commercial"]
    #[doc = "                      lightbulbs."]
    #[doc = ""]
    #[doc = " @param efficiency    Efficiency in percent. This depends on the type of lightbulb used."]
    #[doc = ""]
    #[doc = "  Lightbulb type  | Efficiency"]
    #[doc = " ----------------:|-----------:"]
    #[doc = "     Incandescent |  2.2%"]
    #[doc = "         Halogen  |  7.0%"]
    #[doc = "             LED  |  8.7%"]
    #[doc = "     Fluorescent  | 10.7%"]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[doc = ""]
    #[doc = ""]
    #[doc = " @note"]
    #[doc = " This call is equivalent to `Builder::intensity(efficiency * 683 * watts);`"]
    #[doc = ""]
    #[doc = " This method overrides any prior calls to intensity or intensityCandela."]
    #[link_name = "\u{1}_ZN8filament12LightManager7Builder9intensityEff"]
    pub fn filament_LightManager_Builder_intensity1(
        this: *mut filament_LightManager_Builder,
        watts: f32,
        efficiency: f32,
    ) -> *mut filament_LightManager_Builder;
}
extern "C" {
    #[doc = " Set the falloff distance for point lights and spot lights."]
    #[doc = ""]
    #[doc = " At the falloff distance, the light has no more effect on objects."]
    #[doc = ""]
    #[doc = " The falloff distance essentially defines a *sphere of influence* around the light, and"]
    #[doc = " therefore has an impact on performance. Larger falloffs might reduce performance"]
    #[doc = " significantly, especially when many lights are used."]
    #[doc = ""]
    #[doc = " Try to avoid having a large number of light's spheres of influence overlap."]
    #[doc = ""]
    #[doc = " @param radius Falloff distance in world units. Default is 1 meter."]
    #[doc = ""]
    #[doc = " @return This Builder, for chaining calls."]
    #[doc = ""]
    #[doc = " @note"]
    #[doc = " The Light's falloff is ignored for directional lights (Type.DIRECTIONAL or Type.SUN)"]
    #[link_name = "\u{1}_ZN8filament12LightManager7Builder7falloffEf"]
    pub fn filament_LightManager_Builder_falloff(
        this: *mut filament_LightManager_Builder,
        radius: f32,
    ) -> *mut filament_LightManager_Builder;
}
extern "C" {
    #[doc = " Defines a spot light'st angular falloff attenuation."]
    #[doc = ""]
    #[doc = " A spot light is defined by a position, a direction and two cones, \\p inner and \\p outer."]
    #[doc = " These two cones are used to define the angular falloff attenuation of the spot light"]
    #[doc = " and are defined by the angle from the center axis to where the falloff begins (i.e."]
